#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:51 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SettingSelectionItemData.BP_STRUCT_SettingSelectionItemData
// 0x0028
struct FBP_STRUCT_SettingSelectionItemData
{
	struct FString                                     LayoutName_0_6CF36040395A80D1721FC2830514DF05;            // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               IsEmpty_2_499133400F0E738B572270920B677A09;               // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	int                                                Index_3_5B0B9E807CC0332655317C8A0DA557F8;                 // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsUse_4_03F8BAC001DF9E29553E74380DBB91A5;                 // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	struct FString                                     FileName_5_3B5260C01DF0B7CD7FFC9BD40FFB9E45;              // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                TimeTag_6_096B8B40767C849F14A7704501FE97C7;               // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

