#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:52 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RankIntegralLevel_type.BP_STRUCT_RankIntegralLevel_type
// 0x0060
struct FBP_STRUCT_RankIntegralLevel_type
{
	int                                                IntegralType_0_5DB652C74A6C2C5E4B1123A62ADC38A8;          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     IntegralTypeName_1_37066B404ACB346A9C01D683DD3A29FB;      // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     FrameID_2_FA51FC0F47FB8AEB41067AB1A00E044D;               // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                MinIntegral_3_8BCC404B4E31165611A2F3A5DCA7F9EB;           // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Level_4_4248BF2F4F85F33AF1FFF8B269550E92;                 // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IntegralTypeOrder_5_E1D966464BA0136A4682EA8533722D30;     // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Name_6_B98FA8AA4955E5E532285FA0BC38606D;                  // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DayTaskIcon_7_0ECF428032F6C8EA097B9C980259461E;           // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                DayTaskDrop_8_78156580500C0A28097B507002590520;           // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     DayTaskName_9_5ABA2080225C2402096AA3A2025AFC75;           // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DayTaskDesc_10_20DA200024B2DCFC09740AC0025910D3;          // 0x0050(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                StarNum_11_045B8680677A2C3C3C50D91C069A9F6D;              // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

