#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ShortHand.BP_STRUCT_ShortHand
// 0x0030
struct FBP_STRUCT_ShortHand
{
	struct FString                                     ShortHandUrl_0_246A6F806C239508375333080C997F0C;          // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ShortHandType_1_3113EB40783CBC534F6F577D099798A5;         // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsSelect_2_5E98870015FF3CB05E14D2430A122FC4;              // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ShortHandDesc_3_206782804D9053704085AF7D09969453;         // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ShortHandName_4_5A4783004C61BAD64F1244AE099780F5;         // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ShortHandID_5_4F980600376AF78A13FD704B08C996E4;           // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

