#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Weapon_FirstMenu.BP_STRUCT_Weapon_FirstMenu
// 0x0021
struct FBP_STRUCT_Weapon_FirstMenu
{
	struct FString                                     TypeName_0_5D151F801FD9BC502B9C6983049BD605;              // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IsSelect_1_002B5DC06911E6BF7F9C967B0C69BF34;              // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                WeaponType_2_7AF799C079E0589321C6912D06D20F15;            // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     IconUrl_3_743465C05343FC7B3A44FABD06EB05BC;               // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               RedPoint_4_0A93600053EB2CE4263363760F66CE44;              // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

