#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:51 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WeekSignUpUI_Info.BP_STRUCT_WeekSignUpUI_Info
// 0x0034
struct FBP_STRUCT_WeekSignUpUI_Info
{
	int                                                status_0_EC8A35D74F5AC2CC2B98F591C9409F6E;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_1_53251327494CC92F32987E8745702062;                  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                itemQuality_3_56B4A3B3426227C55FA26CA98E36D3AB;           // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     itemName_4_6A7EF4194025F1D0E47130BACFB2F4A9;              // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     itemImage_5_FA483C614A13FD79836B3FB3D77C8481;             // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                itemResID_6_AD9534F24C781486346957AF128CF8EF;             // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                dropItemTime_7_0A3C58D5463863B3C2C38385677CF898;          // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

