#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_FriendProfile_LobbyWatching.BP_STRUCT_FriendProfile_LobbyWatching
// 0x0054
struct FBP_STRUCT_FriendProfile_LobbyWatching
{
	int                                                level_0_4E083080501D62AC4E22DC1B0445B0AC;                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                teamState_1_51F494807335F9FC64D251E90C3E8565;             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                timeSinceGameBegin_8_25C60A80758F4D5A414EC7BD0D08DB4E;    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_avatar_box_id_11_5ECB09806CD0ACEA33D5D4F10983D1B4;    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     picUrl_12_0608E6404DA42F9F3DBC01D802184DCC;               // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     nickName_17_152F34007E0995B42AD15552085F0405;             // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                sex_38_6DA31E8035E68AD82373FBEC0C142EB8;                  // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                intimacy_40_768FE200291473AC3D608702026F7439;             // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     gid_58_7079978079F77854237593D80C143A84;                  // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                gameSubMode_64_5B377CC05B0A02E96DDA20DC0E8D3A15;          // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gameMode_65_3F5312405F69BDCF511E341101F98605;             // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                enableWatch_66_717F2200340B63F43C9928B70690B138;          // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                timeGameBegin_67_52D02E00271A74E04D6413C10E07349E;        // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                watching_segment_max_68_4F4BBD807F63C42C21B5102500595768; // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ownerID_69_4F87B880361FFCC2087D711C01B8D294;              // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

