#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WeaponDetailInfo.BP_STRUCT_WeaponDetailInfo
// 0x0044
struct FBP_STRUCT_WeaponDetailInfo
{
	int                                                BulletID_0_4B408CC0781892BF035D59500A3318A4;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BulletUrl_1_26BB9640637FBE336FDF349A03319B2C;             // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BulletDesc_2_1F11494074457F937829B66A0318D6A3;            // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     WeaponName_3_08070A401A91F6F13EBDF22B08947FB5;            // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                WeaponResID_4_6FAA77C0657CD6D159A19E46092B5F54;           // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     WeaponDesc_5_4E2709C05446B70B3B908DD108939513;            // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BulletName_6_58F149C03A90BF79780072D603193E05;            // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

