#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SeasonReview_Summary.BP_STRUCT_SeasonReview_Summary
// 0x0048
struct FBP_STRUCT_SeasonReview_Summary
{
	bool                                               isProcessing_0_1FFEA5802A4CD4EC5570EF6D0C912227;          // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FString                                     segmentName_2_47DB04402F7332310AF9A9780905C655;           // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                id_3_770FFA805980D3C66726482103C534A4;                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     maxSegmentModelName_4_7E484A000E9B1F247551112D0FB51CF5;   // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                maxSegmentLevel_5_11E84B806796E89A65211E98045A59AC;       // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     seasonInfo_6_3E336C807B5D71F80651DB910D774C8F;            // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     seasonName_7_5238E9C00DB8D91D0646FF2A0D789075;            // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               isPageShowing_8_0D81D540073C93030833A90F0C6CF2B7;         // 0x003C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
	int                                                curTab_9_3D12BF8038A018D64CA0295404FFBF42;                // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                maxModelId_10_6D4C20400B81506955E47EA2076FEBE4;           // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

