#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SeasonTaskUI_TaskLevelItem.BP_STRUCT_SeasonTaskUI_TaskLevelItem
// 0x003C
struct FBP_STRUCT_SeasonTaskUI_TaskLevelItem
{
	int                                                item_time_0_1BA991403338DEA529A6213C02909E25;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     condition2_txt1_1_3AE81C4047A66B23624960120F703BC1;       // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               condition1_finish_2_311A180011EC79527001B72A034D0F18;     // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	int                                                item_id_3_4EEB18C0260877C155C36DA9021293C4;               // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               condition2_finish_4_0F8638400D2F01BB1ABF7C9E034D0FE8;     // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_season_end_reward_5_5AD4318052E77BD27910B637058AA7E4;  // 0x0019(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x001A(0x0002) MISSED OFFSET
	int                                                task_id_6_399079C07E52013D78226B2D0834B3C4;               // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                take_state_7_1115EB4076492F1B1E7BB03B01092515;            // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     condition1_txt_8_04CE8FC03F95FADD1CD720370BF803B4;        // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     condition2_txt2_9_3AE91C8047A66B24624960110F703BC2;       // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

