#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ItemVoicePkg.BP_STRUCT_ItemVoicePkg
// 0x0020
struct FBP_STRUCT_ItemVoicePkg
{
	int                                                id_0_43A2FA40082818795E0D11900CB220F4;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     authorName_1_7854CC0047D543126F7EE54A0D47C825;            // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               unlocked_2_645B5C4071AC289F27D7784009A7C074;              // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FString                                     iconPath_3_5571748069D5F860105CDE3006F14858;              // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

