#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WeaponAttr.BP_STRUCT_WeaponAttr
// 0x002C
struct FBP_STRUCT_WeaponAttr
{
	int                                                AttrType_0_6C90CDC0102D941D58E48970078A5805;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AttrMaxValue_1_0A5F4E001757E21A0B2A7C3800BC0F75;          // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     AttrValue_6_29080480086553F64FCF04F908A405C5;             // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     AttrName_3_15C4658052EB3C40581834FC078CC055;              // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     AttrValueBase_7_11770340437C7C5176F5C6A705C12C95;         // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

