#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CreateRole_BuyAvatarInfo.BP_STRUCT_CreateRole_BuyAvatarInfo
// 0x001C
struct FBP_STRUCT_CreateRole_BuyAvatarInfo
{
	int                                                avatar_id_0_D977F59044788D0B5572899185050858;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                buy_time_type_1_3B2B5C64479786727E9490991074CD6F;         // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                selected_2_AE60D2114D46BBEA9CDFEE8987C9C72D;              // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               owned_4_DD6165EE48649A9C16E10999CA9384CB;                 // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	struct FString                                     remain_time_str_5_20A485C020AE33474218FA3B0A06B0A2;       // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

