#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_DecomposeItem.BP_STRUCT_DecomposeItem
// 0x0044
struct FBP_STRUCT_DecomposeItem
{
	int                                                res_id_0_5251E6402225C0F5055BDFC106A093B4;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ins_id_1_68EF064048EA62377794292007E993B4;                // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               isSelect_2_73A677C0492FC22D5519E4A6049E6384;              // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FString                                     itemImage_3_7A81ED4062446B512D902A130C7CB5B5;             // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                total_4_6B3531C060A78C832CA424AD0469AA1C;                 // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                count_5_5D1CD300486A90D610741733047CAC34;                 // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     itemName_6_318574C076ED86F75ADF9FC906C81015;              // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                itemQuality_7_53B28EC0347EF83B621765D30C365CF9;           // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                WardrobeTabType_8_05B9A4802A9BAA3C15BF5C5202AAB785;       // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               isTimeLimit_9_3C9723402347081B78E4B2800720CAA4;           // 0x003C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
	int                                                expireTS_10_7851B5C0364AACB752D821DD0376CD73;             // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

