#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:51 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsMenuInfo.BP_STRUCT_CorpsMenuInfo
// 0x0088
struct FBP_STRUCT_CorpsMenuInfo
{
	bool                                               player_online_0_26330380763CF312164DE20F0D138C55;         // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               player_isSpeaking_1_25E345C00A06C57F1616A66D02AB4247;     // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	struct FString                                     anchor_prefix_2_534DC1401B2957F56B69D99E0C4F7328;         // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                player_position_3_393C9F8051FEF8BE320678B10044B11E;       // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               player_openVoice_4_7B5B0C4011DA26C1467A502F027E8C95;      // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	struct FString                                     player_carteamName_5_08D559C07FA6927F4ABA82BE0ACEA5D5;    // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     player_corpsName_6_269B8C40127B44A7627D50B703378B35;      // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     player_name_7_19FECA800320EE840CD5723C041D1295;           // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                anchor_color_A_8_0D53CD802C8546B43C98F7950B3F86C1;        // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     player_id_9_4966D580219AB4AC651731D706A41CA4;             // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                anchor_color_B_10_0D54CDC02C8546B53C98F78A0B3F86C2;       // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     player_corpsIconUrl_11_66571B001B29313247C84E8C03560FEC;  // 0x0050(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                anchor_color_G_12_0D59CF002C8546BA3C98F78F0B3F86C7;       // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                player_sex_13_4CC896402DDBB6C1393953DE0A41FCA8;           // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                player_credit_14_4D53010055993C8045CC383F0CFE1F14;        // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     anchor_icon_res_path_15_178B154073C4739762A52F45008C8CD8; // 0x0068(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                anchor_color_R_16_0D64D1C02C8546C53C98F7FA0B3F86B2;       // 0x0074(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                player_status_17_024D0B406E9F77510906E81D0FFC2FD3;        // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                player_gameStart_18_4C5F8C403C6DD0952FFCB68809EB60B4;     // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               player_isFriend_19_249B8F405CE759C1009C46D0017CE714;      // 0x0080(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0081(0x0003) MISSED OFFSET
	int                                                player_rank_20_2DFC2D403FC629DF0CD74E51041FD2EB;          // 0x0084(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

