#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CORPS_WeekRecord_PlayerInfo.BP_STRUCT_CORPS_WeekRecord_PlayerInfo
// 0x0030
struct FBP_STRUCT_CORPS_WeekRecord_PlayerInfo
{
	struct FString                                     headUrl_0_004D78C01F6B68875770F5F3036D6B1C;               // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     nickName_1_3BDFF10052599AFE23611C7C02313EA5;              // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     uid_2_5A0D58007074BACC0BE748CB0AF78624;                   // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                avatarBoxId_3_2DE33CC0550299B7172407960FFE7EA4;           // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_4_43E46D802A7EE54650D2180E07AF164C;                 // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gender_5_4E5204C05239A11918E51A0A0907E5B2;                // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

