#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:47 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Reflux_New_Award_Info.BP_STRUCT_Reflux_New_Award_Info
// 0x0044
struct FBP_STRUCT_Reflux_New_Award_Info
{
	struct FString                                     name_6_0148D3800E5727747269E25F094B6295;                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     iconPath_8_400398C04D127C477270EF41010A2248;              // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                itemIdx_13_1E5D004008A99E2F7615B5DD02C28B08;              // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                awardID_14_5889D240065C20AF04DBE2C50AB21C74;              // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                status_15_2EEE1440611704750FA1EBF70B8C2283;               // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                needInviteCount_16_402370406F72AED543BE58D30B868184;      // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                rank_17_154636403E8F807D726BBFE3094BA2EB;                 // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     iconOpenPath_18_1133BD403661F287512FA7360C626488;         // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Type_19_308133C045A317CF75BCC65A0949A6C5;                 // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                expireTime_20_1B7A524067595DB1487C946209C047E5;           // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                currentInviteCount_21_676D4A004911A1927D32A08C05A00554;   // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

