#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:42 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RecordingUpload.BP_STRUCT_RecordingUpload
// 0x004C
struct FBP_STRUCT_RecordingUpload
{
	struct FString                                     openUid_0_54D56FF14523BD47320C999A356D4A89;               // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     battleUid_1_E085462F49A09FBF73121597985007B0;             // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     roleUid_2_BCE9DEF348A2756A826DBAB7C9C35515;               // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                HeadShotNum_3_1F6986E44FBDD374A4EFFCB4D9155E13;           // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                killNum_4_58DEC1EE4B1FE46CCB08479A637854DD;               // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     platform_5_11FC63E6443F3259AD396F958EDEB0F1;              // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                MaxKillDistane_6_FF85298B476C4D8EF2CDAC87DBCDCD81;        // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TeamId_7_6FEAAAC03EB5C79730725D8601BEEA34;                // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Mode_8_64C7DF00703CDF000F52FBA60BC13005;                  // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

