#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:40 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum Gameplay.EBattleItemOperationType
enum class EBattleItemOperationType : uint8_t
{
	EBattleItemOperationType__Pickup = 0,
	EBattleItemOperationType__Drop = 1,
	EBattleItemOperationType__Use  = 2,
	EBattleItemOperationType__Disuse = 3,
	EBattleItemOperationType__Enable = 4,
	EBattleItemOperationType__Disable = 5,
	EBattleItemOperationType__EBattleItemOperationType_MAX = 6
};


// Enum Gameplay.EBattleItemOperationFailedReason
enum class EBattleItemOperationFailedReason : uint8_t
{
	EBattleItemOperationFailedReason__PickupFailed_Default = 0,
	EBattleItemOperationFailedReason__PickupFailed_CapacityExceeded = 1,
	EBattleItemOperationFailedReason__DropFailed_Default = 2,
	EBattleItemOperationFailedReason__UseFailed_Default = 3,
	EBattleItemOperationFailedReason__UseFailed_CapacityExceeded = 4,
	EBattleItemOperationFailedReason__DisuseFailed_Default = 5,
	EBattleItemOperationFailedReason__DisuseFailed_CapacityExceeded = 6,
	EBattleItemOperationFailedReason__EBattleItemOperationFailedReason_MAX = 7
};


// Enum Gameplay.ECharacterGender
enum class ECharacterGender : uint8_t
{
	ECharacterGender__Male         = 0,
	ECharacterGender__Female       = 1,
	ECharacterGender__ECharacterGender_MAX = 2
};


// Enum Gameplay.ECharacterPoseType
enum class ECharacterPoseType : uint8_t
{
	ECharPose_Stand                = 0,
	ECharPose_Crouch               = 1,
	ECharPose_Prone                = 2,
	ECharPose_Max                  = 3
};


// Enum Gameplay.ECharacterAnimType
enum class ECharacterAnimType : uint8_t
{
	ECharAnim_Move                 = 0,
	ECharAnim_Aim                  = 1,
	ECharAnim_ToStand              = 2,
	ECharAnim_ToCrouch             = 3,
	ECharAnim_ToProne              = 4,
	ECharAnim_PickM                = 5,
	ECharAnim_PickL                = 6,
	ECharAnim_Equip_Primary        = 7,
	ECharAnim_Equip_Secondary      = 8,
	ECharAnim_Equip_Pistol         = 9,
	ECharAnim_Equip_Melee          = 10,
	ECharAnim_Equip_Thrown         = 11,
	ECharAnim_Hurt                 = 12,
	ECharAnim_Reload               = 13,
	ECharAnim_TacticsReload        = 14,
	ECharAnim_Fire_Single          = 15,
	ECharAnim_Fire_Burst           = 16,
	ECharAnim_Fire_Auto            = 17,
	ECharAnim_Turn_L               = 18,
	ECharAnim_Turn_R               = 19,
	ECharAnim_PullingPlug          = 20,
	ECharAnim_PutDownWeapon        = 21,
	ECharAnim_WeaponIdle           = 22,
	ECharAnim_VehWeaponIdle        = 23,
	ECharAnim_VehWeaponAim         = 24,
	ECharAnim_VehWeaponReload      = 25,
	ECharAnim_Peek                 = 26,
	ECharAnim_PeekLeftAim          = 27,
	ECharAnim_PeekRightAim         = 28,
	ECharAnim_ForegripAnim         = 29,
	ECharAnim_Fire_Scope           = 30,
	ECharAnim_SprintToProne        = 31,
	ECharAnim_ShieldAdditive       = 32,
	ECharAnim_OpenDoor             = 33,
	ECharAnim_Max                  = 34
};


// Enum Gameplay.ECharAnimEventType
enum class ECharAnimEventType : uint8_t
{
	ECharAnimEvent_PoseChange      = 0,
	ECharAnimEvent_PickUp          = 1,
	ECharAnimEvent_Fire            = 2,
	ECharAnimEvent_Reload          = 3,
	ECharAnimEvent_Switch          = 4,
	ECharAnimEvent_Peek            = 5,
	ECharAnimEvent_PeekAim         = 6,
	ECharAnimEvent_Bolt            = 7,
	ECharAnimEvent_Max             = 8
};


// Enum Gameplay.ECharacterJumpType
enum class ECharacterJumpType : uint8_t
{
	ECharJump_InPlace              = 0,
	ECharJump_Forward              = 1,
	ECharJump_Max                  = 2
};


// Enum Gameplay.ETLog_BackpackEquipmentSlotType
enum class ETLog_BackpackEquipmentSlotType : uint8_t
{
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_None = 0,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_WeaponSlot1 = 1,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_WeaponSlot2 = 2,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_HelmetSlot = 3,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_ArmorSlot = 4,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_BagSlot = 5,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_Weapon1GunPoint = 6,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_Weapon1Grip = 7,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_Weapon1Magazine = 8,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_Weapon1Gunstock = 9,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_Weapon1OpticalSight = 10,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_Weapon2GunPoint = 11,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_Weapon2Grip = 12,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_Weapon2Magazine = 13,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_Weapon2Gunstock = 14,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_Weapon2OpticalSight = 15,
	ETLog_BackpackEquipmentSlotType__EBackpackEquipmentSlotType_MAX = 16
};


// Enum Gameplay.EDropdownSchemeTypes
enum class EDropdownSchemeTypes : uint8_t
{
	DST_DeathBox                   = 0,
	DST_MAX                        = 1
};


// Enum Gameplay.EVehicleSpotRandomType
enum class EVehicleSpotRandomType : uint8_t
{
	Vehicle_TotalCount             = 0,
	Vehicle_Probability            = 1,
	Vehicle_MAX                    = 2
};


// Enum Gameplay.ESpotType
enum class ESpotType : uint8_t
{
	ESpotType_A                    = 0,
	ESpotType_B                    = 1,
	ESpotType_C                    = 2,
	ESpotType_D                    = 3,
	ESpotType_E                    = 4,
	ESpotType_F                    = 5,
	ESpotType_G                    = 6,
	ESpotType_H                    = 7,
	ESpotType_I                    = 8,
	ESpotType_J                    = 9,
	ESpotType_K                    = 10,
	ESpotType_L                    = 11,
	ESpotType_M                    = 12,
	ESpotType_N                    = 13,
	ESpotType_O                    = 14,
	ESpotType_P                    = 15,
	ESpotType_Q                    = 16,
	ESpotType_R                    = 17,
	ESpotType_S                    = 18,
	ESpotType_T                    = 19,
	ESpotType_U                    = 20,
	ESpotType_V                    = 21,
	ESpotType_W                    = 22,
	ESpotType_X                    = 23,
	ESpotType_Y                    = 24,
	ESpotType_Z                    = 25,
	ESpotType_MAX                  = 26
};


// Enum Gameplay.ESpotGroupType
enum class ESpotGroupType : uint8_t
{
	ESpotGroup_A                   = 0,
	ESpotGroup_B                   = 1,
	ESpotGroup_C                   = 2,
	ESpotGroup_D                   = 3,
	ESpotGroup_E                   = 4,
	ESpotGroup_F                   = 5,
	ESpotGroup_G                   = 6,
	ESpotGroup_H                   = 7,
	ESpotGroup_I                   = 8,
	ESpotGroup_J                   = 9,
	ESpotGroup_K                   = 10,
	ESpotGroup_L                   = 11,
	ESpotGroup_M                   = 12,
	ESpotGroup_N                   = 13,
	ESpotGroup_O                   = 14,
	ESpotGroup_P                   = 15,
	ESpotGroup_Q                   = 16,
	ESpotGroup_R                   = 17,
	ESpotGroup_S                   = 18,
	ESpotGroup_T                   = 19,
	ESpotGroup_U                   = 20,
	ESpotGroup_V                   = 21,
	ESpotGroup_W                   = 22,
	ESpotGroup_X                   = 23,
	ESpotGroup_Y                   = 24,
	ESpotGroup_Z                   = 25,
	ESpotGroup_MAX                 = 26
};


// Enum Gameplay.EVehicleSeatType
enum class EVehicleSeatType : uint8_t
{
	EVehSeatType_Driver            = 0,
	EVehSeatType_Left              = 1,
	EVehSeatType_Right             = 2,
	EVehSeatType_Max               = 3
};


// Enum Gameplay.EVehicleType
enum class EVehicleType : uint8_t
{
	EVehType_Buggy                 = 0,
	EVehType_UAZ                   = 1,
	EVehType_Motorcycle            = 2,
	EVehType_Dacia                 = 3,
	EVehType_PG                    = 4,
	EVehType_Max                   = 5
};


// Enum Gameplay.ECharacterJumpPhase
enum class ECharacterJumpPhase : uint8_t
{
	EJumpPhase_PreJump             = 0,
	EJumpPhase_FallLoop0           = 1,
	EJumpPhase_FallLoop1           = 2,
	EJumpPhase_Land0               = 3,
	EJumpPhase_Land1               = 4,
	EJumpPhase_Max                 = 5
};


// Enum Gameplay.ECharaAnimListType
enum class ECharaAnimListType : uint8_t
{
	ECharaAnimListType_TPP         = 0,
	ECharaAnimListType_FPP         = 1,
	ECharaAnimListType_Jump        = 2,
	ECharaAnimListType_JumpFPP     = 3,
	ECharaAnimListType_Shield      = 4,
	ECharaAnimListType_Max         = 5
};


// Enum Gameplay.ECharacterShieldAnimType
enum class ECharacterShieldAnimType : uint8_t
{
	ECharShieldAnim_Move           = 0,
	ECharShieldAnim_Aim            = 1,
	ECharShieldAnim_ToStand        = 2,
	ECharShieldAnim_ToCrouch       = 3,
	ECharShieldAnim_PickM          = 4,
	ECharShieldAnim_PickL          = 5,
	ECharShieldAnim_Turn_L         = 6,
	ECharShieldAnim_Turn_R         = 7,
	ECharShieldAnim_InPlace_PreJump = 8,
	ECharShieldAnim_InPlace_FallLoop0 = 9,
	ECharShieldAnim_InPlace_FallLoop1 = 10,
	ECharShieldAnim_InPlace_Land0  = 11,
	ECharShieldAnim_InPlace_Land1  = 12,
	ECharShieldAnim_Forward_PreJump = 13,
	ECharShieldAnim_Forward_FallLoop0 = 14,
	ECharShieldAnim_Forward_FallLoop1 = 15,
	ECharShieldAnim_Forward_Land0  = 16,
	ECharShieldAnim_Forward_Land1  = 17,
	ECharShieldAnim_Max            = 18
};


// Enum Gameplay.ECharacterVehicleAnimType
enum class ECharacterVehicleAnimType : uint8_t
{
	ECharVehAnim_Idle              = 0,
	ECharVehAnim_IdleWithWeapon    = 1,
	ECharVehAnim_LeanOut           = 2,
	ECharVehAnim_LeanIn            = 3,
	ECharVehAnim_Aim               = 4,
	ECharVehAnim_Scope             = 5,
	ECharVehAnim_AimFPPCommon      = 6,
	ECharVehAnim_MotorbikeIdle     = 7,
	ECharVehAnim_MotorbikeVacate   = 8,
	ECharVehAnim_Max               = 9
};


// Enum Gameplay.EWeatherType
enum class EWeatherType : uint8_t
{
	EWeatherType_None              = 0,
	EWeatherType_Sunday            = 1,
	EWeatherType_Rainy             = 2,
	EWeatherType_Foggy             = 3,
	EWeatherType_Dark              = 4,
	EWeatherType_Night             = 5,
	EWeatherType_DayToNight        = 6,
	EWeatherType_Max               = 7
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Gameplay.DynamicBlockTransform
// 0x0018
struct FDynamicBlockTransform
{
	float                                              locX;                                                     // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              locY;                                                     // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LocZ;                                                     // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              RotX;                                                     // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              RotY;                                                     // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              RotZ;                                                     // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.IDIPDynamicBlock
// 0x0018
struct FIDIPDynamicBlock
{
	TArray<struct FDynamicBlockTransform>              Transforms;                                               // 0x0000(0x000C) (ZeroConstructor)
	struct FString                                     DynamicBlockClassPath;                                    // 0x000C(0x000C) (ZeroConstructor)
};

// ScriptStruct Gameplay.DynamicTriggerTransform
// 0x0018
struct FDynamicTriggerTransform
{
	struct FVector                                     Loc;                                                      // 0x0000(0x000C) (IsPlainOldData)
	struct FRotator                                    Rot;                                                      // 0x000C(0x000C) (IsPlainOldData)
};

// ScriptStruct Gameplay.DynamicTriggerConfig
// 0x0018
struct FDynamicTriggerConfig
{
	TArray<struct FDynamicTriggerTransform>            Transforms;                                               // 0x0000(0x000C) (ZeroConstructor)
	struct FString                                     TriggerClassPath;                                         // 0x000C(0x000C) (ZeroConstructor)
};

// ScriptStruct Gameplay.DropdownSchemeData
// 0x0024
struct FDropdownSchemeData
{
	int                                                SchemeId;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ItemID;                                                   // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FString                                     ItemName;                                                 // 0x0008(0x000C) (ZeroConstructor)
	int                                                MaxNum;                                                   // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                MinNum;                                                   // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Probability;                                              // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      DropType;                                                 // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0021(0x0003) MISSED OFFSET
};

// ScriptStruct Gameplay.AirDropBoxInOb
// 0x0014
struct FAirDropBoxInOb
{
	int                                                boxId;                                                    // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               Flying;                                                   // 0x0004(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsEmpty;                                                  // 0x0005(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0006(0x0002) MISSED OFFSET
	struct FVector                                     pos;                                                      // 0x0008(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
};

// ScriptStruct Gameplay.AdvertisementActorConfig
// 0x003C
struct FAdvertisementActorConfig
{
	struct FString                                     ResPath;                                                  // 0x0000(0x000C) (ZeroConstructor)
	struct FString                                     HttpImgPath;                                              // 0x000C(0x000C) (ZeroConstructor)
	struct FVector                                     Loc;                                                      // 0x0018(0x000C) (IsPlainOldData)
	struct FRotator                                    Rot;                                                      // 0x0024(0x000C) (IsPlainOldData)
	struct FVector                                     Scale;                                                    // 0x0030(0x000C) (IsPlainOldData)
};

// ScriptStruct Gameplay.CakeInfo
// 0x0018
struct FCakeInfo
{
	struct FString                                     CakeActorPath;                                            // 0x0000(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FString                                     CakeButtonImage;                                          // 0x000C(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct Gameplay.CharacterOverrideAttrData
// 0x0010
struct FCharacterOverrideAttrData
{
	struct FString                                     AttrName;                                                 // 0x0000(0x000C) (ZeroConstructor)
	float                                              AttrValue;                                                // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.DSCorpsInfo
// 0x0020
struct FDSCorpsInfo
{
	uint64_t                                           CorpsID;                                                  // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     CorpsName;                                                // 0x0008(0x000C) (ZeroConstructor)
	int                                                Icon;                                                     // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                SegmentLevel;                                             // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct Gameplay.GameModeCorpsDetailData
// 0x0028
struct FGameModeCorpsDetailData
{
	struct FString                                     Name;                                                     // 0x0000(0x000C) (BlueprintVisible, ZeroConstructor)
	int                                                CorpsHeadIcon;                                            // 0x000C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                KilledNum;                                                // 0x0010(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SegmentLevel;                                             // 0x0014(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RealtimeRank;                                             // 0x0018(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DefeatPlayerNum;                                          // 0x001C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TotalDamage;                                              // 0x0020(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SurvivalTime;                                             // 0x0024(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.GameModeTeamBattleResultData
// 0x0060
struct FGameModeTeamBattleResultData
{
	struct FString                                     Reason;                                                   // 0x0000(0x000C) (ZeroConstructor)
	int                                                RemainTeamCount;                                          // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                RemainAlivePlayerCount;                                   // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	TMap<struct FString, struct FString>               PlayersLogoutTime;                                        // 0x0014(0x0050) (ZeroConstructor)
	TArray<struct FGameModeCorpsDetailData>            RealTimeCorpsRank;                                        // 0x0050(0x000C) (ZeroConstructor)
	bool                                               bIsGameTerminator;                                        // 0x005C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x005D(0x0003) MISSED OFFSET
};

// ScriptStruct Gameplay.BattleData
// 0x0008
struct FBattleData
{
	int                                                WatcherNum;                                               // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CircleNum;                                                // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.TLog_PickUpItemFlow
// 0x0028
struct FTLog_PickUpItemFlow
{
	int                                                ItemSpesificID;                                           // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                Count;                                                    // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0008(0x000C) (Edit, IsPlainOldData)
	int                                                SourceType;                                               // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                AdditionalParam;                                          // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FString                                     TimeStr;                                                  // 0x001C(0x000C) (Edit, ZeroConstructor)
};

// ScriptStruct Gameplay.UseItemFlow
// 0x0008
struct FUseItemFlow
{
	int                                                ItemSpesificID;                                           // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                UseCount;                                                 // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.TLog_PropEquipUnequipFlow
// 0x0014
struct FTLog_PropEquipUnequipFlow
{
	int                                                ItemSpesificID;                                           // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	ETLog_BackpackEquipmentSlotType                    slotType;                                                 // 0x0004(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEquip;                                                   // 0x0005(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0006(0x0002) MISSED OFFSET
	struct FString                                     TimeStr;                                                  // 0x0008(0x000C) (Edit, ZeroConstructor)
};

// ScriptStruct Gameplay.VehicleDriveDisData
// 0x0010
struct FVehicleDriveDisData
{
	int                                                VehicleType;                                              // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DriveDistance;                                            // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DriveTime;                                                // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              VehicleJumpDistanceMax;                                   // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.FlareGunReport
// 0x0010
struct FFlareGunReport
{
	int                                                PickUpNum;                                                // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                FireNum;                                                  // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CallSuperAirDropSuccessNum;                               // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CallVehicleDropSuccessNum;                                // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.EquipmentData
// 0x0050
struct FEquipmentData
{
	int                                                HelmetID;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ArmorID;                                                  // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                BackPackID;                                               // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                MainWeapon1ID;                                            // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<int>                                        MainWeapon1AttachmentsID;                                 // 0x0010(0x000C) (ZeroConstructor)
	int                                                MainWeapon2ID;                                            // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<int>                                        MainWeapon2AttachmentsID;                                 // 0x0020(0x000C) (ZeroConstructor)
	int                                                ViceWeaponID;                                             // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<int>                                        ViceWeaponAttachmentsID;                                  // 0x0030(0x000C) (ZeroConstructor)
	int                                                CloseWeaponID;                                            // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<int>                                        ThrowWeaponsID;                                           // 0x0040(0x000C) (ZeroConstructor)
	int8_t                                             IsLuckyClothing;                                          // 0x004C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x004D(0x0003) MISSED OFFSET
};

// ScriptStruct Gameplay.GameModePlayerTaskData
// 0x0014
struct FGameModePlayerTaskData
{
	int                                                task_id;                                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                process;                                                  // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FString                                     ext_info;                                                 // 0x0008(0x000C) (ZeroConstructor)
};

// ScriptStruct Gameplay.ReportCollection
// 0x0008
struct FReportCollection
{
	int                                                item_id;                                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Count;                                                    // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.WeaponDamageRecord
// 0x0008
struct FWeaponDamageRecord
{
	int                                                WeaponID;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Damage;                                                   // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.SpecialPickItemState
// 0x0008
struct FSpecialPickItemState
{
	int                                                item_id;                                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsCollectionCompleted;                                   // 0x0004(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
};

// ScriptStruct Gameplay.GameModeTeammateBattleResultData
// 0x00B0
struct FGameModeTeammateBattleResultData
{
	struct FString                                     Name;                                                     // 0x0000(0x000C) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	uint64_t                                           UID;                                                      // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                Kill;                                                     // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FString                                     State;                                                    // 0x001C(0x000C) (ZeroConstructor)
	float                                              travelDistance;                                           // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              marchDistance;                                            // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              DriveDistance;                                            // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              DamageAmount;                                             // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              HealAmount;                                               // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                AssistNum;                                                // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                HeadShotNum;                                              // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              surviveTime;                                              // 0x0044(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                rescueTimes;                                              // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                startToRescueTimes;                                       // 0x004C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                DestroyVehicles;                                          // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<struct FString>                             KillFlow;                                                 // 0x0054(0x000C) (ZeroConstructor)
	float                                              OutsideBlueCircleTime;                                    // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<struct FVehicleDriveDisData>                VehicleDriveDisDataArray;                                 // 0x0064(0x000C) (ZeroConstructor)
	int                                                FirstOpenedAirDropBoxNum;                                 // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              HitEnemyHeadAmount;                                       // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                GetPropsNumFromTeammates;                                 // 0x0078(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                SendPropsNumToTeammates;                                  // 0x007C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TotalBeenDamageAmount;                                    // 0x0080(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                KillerWeaponId;                                           // 0x0084(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              KillerDistance;                                           // 0x0088(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                OccupyPoint;                                              // 0x008C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsGameTerminator;                                        // 0x0090(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0091(0x0003) MISSED OFFSET
	int                                                GamePlayingTime;                                          // 0x0094(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TouchDownAreaID;                                          // 0x0098(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TouchDownLocTypeID;                                       // 0x009C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FString                                     TouchDownObjectName;                                      // 0x00A0(0x000C) (ZeroConstructor)
	unsigned char                                      UnknownData02[0x4];                                       // 0x00AC(0x0004) MISSED OFFSET
};

// ScriptStruct Gameplay.GameModePlayerBattleResultData
// 0x01A0
struct FGameModePlayerBattleResultData
{
	struct FString                                     Reason;                                                   // 0x0000(0x000C) (ZeroConstructor)
	int                                                RemainingPlayerCount;                                     // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TotalPlayerCount;                                         // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                RemainingTeamCount;                                       // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TotalTeamCount;                                           // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               IsSolo;                                                   // 0x001C(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               IsSafeExit;                                               // 0x001D(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x001E(0x0002) MISSED OFFSET
	uint64_t                                           Killer;                                                   // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     KillerName;                                               // 0x0028(0x000C) (ZeroConstructor)
	int                                                ShootWeaponShotNum;                                       // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ShootWeaponShotAndHitPlayerNum;                           // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                HealTimes;                                                // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<struct FString>                             KillFlow;                                                 // 0x0040(0x000C) (ZeroConstructor)
	TArray<struct FTLog_PickUpItemFlow>                TLog_PickUpItemFlowData;                                  // 0x004C(0x000C) (ZeroConstructor)
	TArray<struct FUseItemFlow>                        UseItemFlow;                                              // 0x0058(0x000C) (ZeroConstructor)
	int                                                destroyVehicleNum;                                        // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                is_escape;                                                // 0x0068(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<struct FGameModeTeammateBattleResultData>   TeammateList;                                             // 0x006C(0x000C) (ZeroConstructor)
	struct FVector                                     LandLocation;                                             // 0x0078(0x000C) (IsPlainOldData)
	struct FVector                                     DeadLocation;                                             // 0x0084(0x000C) (IsPlainOldData)
	struct FString                                     DeadDamangeType;                                          // 0x0090(0x000C) (ZeroConstructor)
	struct FString                                     DeadTimeStr;                                              // 0x009C(0x000C) (ZeroConstructor)
	struct FString                                     logoutime;                                                // 0x00A8(0x000C) (ZeroConstructor)
	float                                              Pronetime;                                                // 0x00B4(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              BeInWaterTime;                                            // 0x00B8(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              SwimmingDistance;                                         // 0x00BC(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                BeDownTimes;                                              // 0x00C0(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                DeadNum;                                                  // 0x00C4(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                BeSavedTimes;                                             // 0x00C8(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PickUpAirDrops;                                           // 0x00CC(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FEquipmentData                              EquipmentData;                                            // 0x00D0(0x0050)
	int                                                Rank;                                                     // 0x0120(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TotalScore;                                               // 0x0124(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                OccupyPoint;                                              // 0x0128(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                FollowState;                                              // 0x012C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                InviteTimes;                                              // 0x0130(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsGameTerminator;                                        // 0x0134(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0135(0x0003) MISSED OFFSET
	int                                                GamePlayingTime;                                          // 0x0138(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TouchDownAreaID;                                          // 0x013C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TouchDownLocTypeID;                                       // 0x0140(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FString                                     TouchDownObjectName;                                      // 0x0144(0x000C) (ZeroConstructor)
	TArray<struct FGameModePlayerTaskData>             CompletedTaskList;                                        // 0x0150(0x000C) (ZeroConstructor)
	TArray<struct FReportCollection>                   SpecialCollectionList;                                    // 0x015C(0x000C) (ZeroConstructor)
	TArray<struct FWeaponDamageRecord>                 WeaponDamageRecordList;                                   // 0x0168(0x000C) (ZeroConstructor)
	TArray<int>                                        SecretAreaIDList;                                         // 0x0174(0x000C) (ZeroConstructor)
	int                                                KillNumInVehicle;                                         // 0x0180(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TotalSprintDistance;                                      // 0x0184(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TotalBeenDamageAmount;                                    // 0x0188(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              DestroyVehicleWheelNum;                                   // 0x018C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                BreakDoorNum;                                             // 0x0190(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<struct FUseItemFlow>                        UseSpecificBulletFlow;                                    // 0x0194(0x000C) (ZeroConstructor)
};

// ScriptStruct Gameplay.WeatherInfo
// 0x0014
struct FWeatherInfo
{
	struct FString                                     WeatherLevelName;                                         // 0x0000(0x000C) (BlueprintVisible, ZeroConstructor)
	int                                                WeatherID;                                                // 0x000C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              WeatherTime;                                              // 0x0010(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.PlayerNetStats
// 0x0030
struct FPlayerNetStats
{
	struct FString                                     ClientAddr;                                               // 0x0000(0x000C) (ZeroConstructor)
	struct FString                                     LocalAddr;                                                // 0x000C(0x000C) (ZeroConstructor)
	float                                              AvgPing;                                                  // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MaxPing;                                                  // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              HighPingPercent;                                          // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0024(0x000C) MISSED OFFSET
};

// ScriptStruct Gameplay.PlayerOBInfo
// 0x0048
struct FPlayerOBInfo
{
	bool                                               IsEnableOB;                                               // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	uint64_t                                           UID;                                                      // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           PlayerKey;                                                // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                SegmentLevel;                                             // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                BattleMode;                                               // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               ValidBattleInfo;                                          // 0x001C(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	int                                                GameCount;                                                // 0x0020(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                WinCount;                                                 // 0x0024(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                TopTenCount;                                              // 0x0028(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                KillNum;                                                  // 0x002C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              KDNum;                                                    // 0x0030(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                ShowWeaponID;                                             // 0x0034(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Title_Type;                                               // 0x0038(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Title_RankID;                                             // 0x003C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Title_RankType;                                           // 0x0040(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Title_RankNo;                                             // 0x0044(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.GameModePlayerItem
// 0x0008
struct FGameModePlayerItem
{
	int                                                ItemTableID;                                              // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Count;                                                    // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.GameModePlayerExpressionItem
// 0x0000 (0x0008 - 0x0008)
struct FGameModePlayerExpressionItem : public FGameModePlayerItem
{

};

// ScriptStruct Gameplay.SpecialPickItem
// 0x000C
struct FSpecialPickItem
{
	int                                                item_id;                                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                cur_count;                                                // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                total_count;                                              // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.PlayerOBBattleInfo
// 0x0028
struct FPlayerOBBattleInfo
{
	uint32_t                                           UID;                                                      // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                BattleMode;                                               // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ValidBattleInfo;                                          // 0x0008(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	int                                                GameCount;                                                // 0x000C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                WinCount;                                                 // 0x0010(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TopTenCount;                                              // 0x0014(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                KillNum;                                                  // 0x0018(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     KDNum;                                                    // 0x001C(0x000C) (BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Gameplay.GameModePlayerBanChat
// 0x0010
struct FGameModePlayerBanChat
{
	int                                                end_time;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FString                                     Reason;                                                   // 0x0004(0x000C) (ZeroConstructor)
};

// ScriptStruct Gameplay.GameModePlayerParams
// 0x0158
struct FGameModePlayerParams
{
	uint64_t                                           UID;                                                      // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FName                                       PlayerType;                                               // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     PlayerName;                                               // 0x0010(0x000C) (ZeroConstructor)
	uint32_t                                           PlayerKey;                                                // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TeamID;                                                   // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerBornPointID;                                        // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bTeamLeader;                                              // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsGM;                                                    // 0x0029(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsGMWatcher;                                             // 0x002A(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      gender;                                                   // 0x002B(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bAIPlayer;                                                // 0x002C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	TArray<struct FGameModePlayerItem>                 ItemList;                                                 // 0x0030(0x000C) (ZeroConstructor)
	TArray<struct FGameModePlayerItem>                 fireworksInfo;                                            // 0x003C(0x000C) (ZeroConstructor)
	TArray<struct FGameModePlayerExpressionItem>       ExpressionItemList;                                       // 0x0048(0x000C) (ZeroConstructor)
	TArray<struct FGameModePlayerTaskData>             TaskDataList;                                             // 0x0054(0x000C) (ZeroConstructor)
	TArray<struct FGameModePlayerItem>                 WeaponAvatarList;                                         // 0x0060(0x000C) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x4];                                       // 0x006C(0x0004) MISSED OFFSET
	struct FPlayerOBInfo                               PlayerOBInfoList;                                         // 0x0070(0x0048) (IsPlainOldData)
	struct FGameModePlayerBanChat                      banChat;                                                  // 0x00B8(0x0010)
	struct FGameModePlayerBanChat                      banBlack;                                                 // 0x00C8(0x0010)
	TArray<struct FSpecialPickItem>                    SpecialPickItem;                                          // 0x00D8(0x000C) (ZeroConstructor)
	TArray<int>                                        audioChat;                                                // 0x00E4(0x000C) (ZeroConstructor)
	struct FName                                       CurrentPlayerState;                                       // 0x00F0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FName                                       CurrentCharacterState;                                    // 0x00F8(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              SyncedTimestamp;                                          // 0x0100(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              DestinyValue;                                             // 0x0104(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              WarmScore;                                                // 0x0108(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              RatingScore;                                              // 0x010C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsObserver;                                              // 0x0110(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0111(0x0007) MISSED OFFSET
	uint64_t                                           WatchPlayerKey;                                           // 0x0118(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      PlatformGender;                                           // 0x0120(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsFireworksActOpen;                                      // 0x0121(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x0122(0x0002) MISSED OFFSET
	int                                                MatchLabel;                                               // 0x0124(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                AnchorPlatColorID;                                        // 0x0128(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                AnchorPlatResID;                                          // 0x012C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               OnlyTeammateSeeAvatar;                                    // 0x0130(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0131(0x0007) MISSED OFFSET
	int64_t                                            LastGameResultTime;                                       // 0x0138(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            CorpsID;                                                  // 0x0140(0x0008) (ZeroConstructor, IsPlainOldData)
	int64_t                                            CampID;                                                   // 0x0148(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               bUsedSimulation;                                          // 0x0150(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x0151(0x0007) MISSED OFFSET
};

// ScriptStruct Gameplay.UAEWindowRepData
// 0x0050
struct FUAEWindowRepData
{
	struct FTransform                                  Transform;                                                // 0x0000(0x0030) (IsPlainOldData)
	struct FString                                     PathToLoad;                                               // 0x0030(0x000C) (ZeroConstructor)
	int                                                ID;                                                       // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bBroken;                                                  // 0x0040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0041(0x0003) MISSED OFFSET
	class APawn*                                       LastInstigatorPawn;                                       // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0048(0x0008) MISSED OFFSET
};

// ScriptStruct Gameplay.SpecialPickInfo
// 0x000C
struct FSpecialPickInfo
{
	int                                                item_id;                                                  // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                cur_count;                                                // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                total_count;                                              // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Gameplay.BattleItemNet
// 0x0038
struct FBattleItemNet
{
