#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_EXCITINGTOUR_LOG.BP_STRUCT_EXCITINGTOUR_LOG
// 0x0020
struct FBP_STRUCT_EXCITINGTOUR_LOG
{
	int                                                eventId_0_5F658A802B03B8902ECBF9630E004754;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                timeSec_1_18718940267D02B94FD1FE740BD7B603;               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                param_2_337C7B003B42723221C48F5A0FB7BC6D;                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     timeStr_3_59C9B0C045C775094FD1E8160BD7B502;               // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                circleIdx_4_14197C805E8B859A40768C010C9D3688;             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gridIdx_5_3777A98072CBD0C824D423580FBB9018;               // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

