#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_FPPCombatBattleInfo.BP_STRUCT_FPPCombatBattleInfo
// 0x003C
struct FBP_STRUCT_FPPCombatBattleInfo
{
	struct FString                                     role_avedamage_0_60E27140103FA57D5776B48E0D9D4445;        // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_critcount_1_00D361401B5C944F56DB5F7606931BB4;        // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_hitrate_2_62ACA6C06A10E341123F2261065DB3D5;          // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_maxdamage_3_462093C038DFAF7154B58098089DBF05;        // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_maxkill_4_19F28700299C329854334FFC08D925AC;          // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

