#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_OpenBoxPanel_ItemData.BP_STRUCT_OpenBoxPanel_ItemData
// 0x001C
struct FBP_STRUCT_OpenBoxPanel_ItemData
{
	int                                                res_id_1_D32ECC9C4F13FFF6AFB8C4896E44B806;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                count_2_3C510FE249C175603249A7BF2DE8DA7A;                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     valid_hours_str_4_D7F28E654E0508A8CF4685AAA19630D7;       // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                product_price_6_E5A8CBB04081CBC1D39B9FA09C27CDF8;         // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                money_type_7_4041344057C8DC6F3DED55740542C485;            // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

