#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:47 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_NewYear_Info.BP_STRUCT_NewYear_Info
// 0x0030
struct FBP_STRUCT_NewYear_Info
{
	int                                                fireworksNum_0_3418A9C038559B157B9AB7D90BACB30D;          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     imgTitle_1_0620F68015E869163AE1961D0D917865;              // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     imgUrl_2_649422C00AEE27C37F7719A40D4D96FC;                // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     actTime_3_3EE618802BE648F869E735610B4C09E5;               // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                fireCount_4_30AEF2804D3FB2561AAE7BF20D3FBBB4;             // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                awardGetPage_5_4A1471C04E4EF171129A13F9008AB525;          // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

