#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:46 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Intimacy_Data.BP_STRUCT_Intimacy_Data
// 0x0058
struct FBP_STRUCT_Intimacy_Data
{
	int                                                level_0_7E68CE0D4941D712809799ACF0877723;                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     nickName_1_3E5D3B3442796412EB503AB1C7843B31;              // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     picUrl_2_67F164524B65C16B9774AC8F87702490;                // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     signature_3_24C9002246F648F6B830778920EBFF0D;             // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                vipLevel_4_D9D1E6024950B860062C5A9EF7D757E2;              // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sex_5_EBD809D347C068036473C8BD8DA70D98;                   // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     gid_6_FDE92E1E40AD4942355D7C9B04BB6D14;                   // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                param_7_CD78BCB5430771FD7B3FA783C6D0F4E7;                 // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                state_8_1C66488844262395339163BFF772C68D;                 // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                intimacy_12_A40101234C232AB187CE219B4DE8F98B;             // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_avatar_box_id_13_FA196E2744F0265650F6AC8F856AD89F;    // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                relationSortPriority_14_A9B94E3347974FC07483EA90826CEEE7; // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                stateSortPriority_15_30C568F84F455B363AF654B4993B36D8;    // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_max_segment_level_16_2C0131001DACF968057BC1D004B587CC;// 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

