#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ShareHistoryRanking_DetailInfo.BP_STRUCT_ShareHistoryRanking_DetailInfo
// 0x0090
struct FBP_STRUCT_ShareHistoryRanking_DetailInfo
{
	struct FString                                     reason_0_BF938E264C9018FAD97EFABBEAE2429A;                // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                change_kill_rating_1_0BE411A544EE40077CE6D18BCC62A9A9;    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     final_score_2_923383BF40E03242C1B698837CA888B6;           // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                person_rank_3_616270D240A84589AC35F0914305840B;           // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_solo_4_7BB2FA83462C888B852044B75F64F63F;               // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0021(0x0003) MISSED OFFSET
	int                                                total_player_count_5_76E14EBD435749EC9B1F8E9C136BB609;    // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                change_rating_6_4EE1FE1D4F3550E23FE3B69CEE3872AB;         // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                battle_type_7_5C8A76C64F99DAB4282FB1BFD08F1369;           // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     final_level_8_AB22F9354D4AE5ADBE6101BC938F47B7;           // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     battle_typename_9_8BB44781426DD43EC0F693A3A67B6FFD;       // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                battle_time_10_50AACF3F444D67BC855D49A74114C4E3;          // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                battle_id_11_D7A3C8324AB835F100373988188AB357;            // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                rating_12_96E6C9DE4069412D2419DC89FD88B0B5;               // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                total_team_count_13_D4C956E8408BCA79D7A9D0A55867BCBB;     // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     reason_result_14_6C339FF14F41A3C88F9D108B47F9767F;        // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                team_rank_15_714479934BC756D2215DF8965AA0551C;            // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     wisdom_16_8C17AEE54AF8F78F20D3C0BAF63A4906;               // 0x0068(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                add_gold_17_FBE8E18B43A1EFF597A3AE9E58F8DDC6;             // 0x0074(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                add_exp_18_91DFBF0D4D4ABF07A2EB6F947755C5EE;              // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segment_19_8DDF41F3471ACAA295519E9ED24C9B33;              // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                change_win_rating_20_56485EBA4FE20347F8CD7C9B52BAE35B;    // 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                change_rating_base_22_05DE29806E56FC5A2E6FEC860C13F495;   // 0x0084(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cj_day_act_23_59B2F8C05C5F56055FB97DDA0F54E764;           // 0x0088(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_blackroom_24_464F95C0189954D730D0EB6E09BB5CAD;         // 0x008C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_festival_mode_25_694F3FC04095059D7DDA2E9D0F12ACA5;     // 0x008D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_resource_battle_26_1E66D800744EE28660C684B90DDDCFE5;   // 0x008E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_resource_win_27_244AEC8019ED278C3C28FC9B074CE8AE;      // 0x008F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

