#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:52 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Task_type.BP_STRUCT_Task_type
// 0x005C
struct FBP_STRUCT_Task_type
{
	int                                                DropID_0_EDFA2544484D0B5D506F8E83EB1C91C0;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     JumpTo_10_E6FDA34245F399EC6B49FF803A40E386;               // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Desc_2_EDDB3027489FAB629B0917A87284A3EC;                  // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Icon_3_036CC8BE4F699E60ECA5278EFBAD0238;                  // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Cond_4_365CF13E451CADC77F5E39A9F083C71A;                  // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_5_DF7D60344762A3A08BC48B84574A73F3;                    // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Title_6_E3F6EA9E4242B6D72D896E85BEC181FE;                 // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                TaskCategory_7_CDC278AC48914E74EEBDECB7FB696040;          // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     TaskCategoryDesc_8_D7B0EDCB4B5744222677178CE7B64346;      // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                TaskType_9_1C64153D458C97E2C228C0A988BD3C4E;              // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Sort_11_6629496A435C79D29C84A18D753FBB58;                 // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TouristSwitch_12_4CD240D94FF3D930173BEB807B7CF9E7;        // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IOSCheck_13_0FD80900436EE9C4238A19867E3CE6D8;             // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

