#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:52 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsTask_type.BP_STRUCT_CorpsTask_type
// 0x0044
struct FBP_STRUCT_CorpsTask_type
{
	int                                                ID_0_7E6996EC40752F259DA93A936F28A9E0;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     JumpTo_1_4A125F6244EBAF2C9E8935A6B3B1F64E;                // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Desc_2_97560C50499EEABA1A4398BD21EE5E63;                  // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Sort_3_069EF401434A3CEE01A21394BF3C48EE;                  // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Cond_4_20AE278D4A4133BD4F9860858E4B46E6;                  // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Icon_5_91055E7D4FAA9400CCA749886C09279F;                  // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                TaskType_6_10F03A144E1ABD5FE24A7FB6AC796B46;              // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Title_7_E85531C741E9463B5382CD9BA7C5460B;                 // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                DropID_8_DCD3CEF44F18D8B5633604A5F09A9BFD;                // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

