#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:47 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RoleInfo_CorpsAvatar.BP_STRUCT_RoleInfo_CorpsAvatar
// 0x0040
struct FBP_STRUCT_RoleInfo_CorpsAvatar
{
	struct FString                                     LastOnlineTimeStr_0_6D5566406EAB6A4516276CB30BF06F82;     // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Name_1_15E5164071300E2755B85A3300547C85;                  // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     strUid_2_6F9974C01AE4A461021C04000097CBA4;                // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Level_3_6F9A54005A8A8D663BBB59EF054107BC;                 // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     IconUrl_4_7CB1A500239DA92A77E1598A0C6F39BC;               // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Sex_5_1D88C2000D34AEDC068D29190B052A08;                   // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RankIntegralLevel_6_7266E480003A1CAA0699621F0D83BDCC;     // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IconFrameID_7_23127640158A94290DD63D5608BC56F4;           // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

