#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsWarRoomlistRoomData.BP_STRUCT_CorpsWarRoomlistRoomData
// 0x0038
struct FBP_STRUCT_CorpsWarRoomlistRoomData
{
	TArray<struct FBP_STRUCT_CorpsWarRoomListPlayerInfo> BP_ARRAY_CorpsWarRoomListPlayerList_0_1DA9D6006DFAD15019C82D8508CE7364;// 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     RoomStatus_1_18F98DC002240FBD5FA960E905B53D63;            // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                RoomSize_2_12F2538041C37440087D37A206A5A0B5;              // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RoomIndex_3_4C224AC05A04BA61213B0E330A6FB1A8;             // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     LeaderUid_4_32AAE140496816F7382629540BDD8B44;             // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     TeamID_6_3C4B4A800334778E45F8D12E0F8BC6C4;                // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

