#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SignInUIInfo.BP_STRUCT_SignInUIInfo
// 0x004C
struct FBP_STRUCT_SignInUIInfo
{
	int                                                sign_awardnum1_0_824CF28047E21479CB1BDAAD61154BCD;        // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sign_awardnum2_1_B68801B644154A28711DA88ED33F34E1;        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     sign_awardimage2_2_FACEA9164563AFD924227684FC79DAB8;      // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     sign_awardimage1_3_A3896BA243321F625181478E9563F50C;      // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                sign_state_4_33EFB76A48184DC84EAA00A6C14C7E14;            // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     sign_awardname1_5_A6EE8A96476127C55E19EF93D452F8E9;       // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     sign_awardname2_6_F52AE4BC4D434E97B8EFA39E4E288664;       // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                sign_awardID2_7_DACC3DD34FAA6201F0B7FCBB5D5E873B;         // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sign_awardquality2_8_D45BE8D5489602C50459B8B509E57AD7;    // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sign_awardquality1_9_B7EF70E04E7FFFE00C77F2B073EEE2B5;    // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sign_awardID1_10_6F16D7EE49FB4F665B9255A20B890BD5;        // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

