#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SeasonPassPassLevelData.BP_STRUCT_SeasonPassPassLevelData
// 0x0014
struct FBP_STRUCT_SeasonPassPassLevelData
{
	int                                                PassType_0_5BED6DC06823EB9D3684479D0ACE98C5;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PassLevel_1_4152A3404D22AFD76B7619B30C21461C;             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CurStarNum_2_2488BC80720B22241B5FFFFE0C911BAD;            // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxStarNum_3_53783B80052046DC47B12E530C92AF0D;            // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SeasonID_4_11197D0041D5745257D6BBB909F07A84;              // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

