#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:47 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Reflux_Award_Info.BP_STRUCT_Reflux_Award_Info
// 0x0044
struct FBP_STRUCT_Reflux_Award_Info
{
	int                                                expireTime_1_6542F0005FD76F8433B22D3E0A1041E5;            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                status_3_22E23200152D87F85B97400B0B8A2153;                // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                needInviteCount_4_3E8DAE00201056C01BB889E20BBF81E4;       // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                currentInviteCount_5_01DEE7C059A10CA569E74535059E0564;    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                itemIdx_6_7E9E3E002F72759A418E754602A2B608;               // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                awardID_7_38CB10005371F2BA4517CBAF0AD22174;               // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     iconPath_8_7801F68076B5247C7D9FE9D20B09F278;              // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     iconOpenPath_9_7A869B0046CFA48C10E93AF90C786158;          // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     name_10_3EF2B14010A4C1796A7518EA0A9B6895;                 // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                rank_11_52F014004712D5A26A8578DA0A9BA8EB;                 // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Type_12_6E2B118041FB2E746BB01C1C0A99A0C5;                 // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

