#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsWarRoomListPlayerInfo.BP_STRUCT_CorpsWarRoomListPlayerInfo
// 0x0040
struct FBP_STRUCT_CorpsWarRoomListPlayerInfo
{
	struct FString                                     LastOnlineTimeStr_0_149186406B9DD70D48D20F3701811A32;     // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IconFrameID_1_1AAE9640744F8AE148742CCE02AB6564;           // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Name_2_01F1364078D359BF611CF9E409F36BD5;                  // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Sex_3_15A4E200484F9DB44BBD83E20E9F3B18;                   // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     IconUrl_4_748DC5006CF8DE82771C734F0D5CA3AC;               // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Level_5_5796740073F4D01E5BBAC5050F30122C;                 // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     strUid_6_5B8594C013F314795044A8BC01869204;                // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                RankIntegralLevel_7_19A304805BC8D9D21716026A0772C85C;     // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

