#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Weapon_SecMenu.BP_STRUCT_Weapon_SecMenu
// 0x0038
struct FBP_STRUCT_Weapon_SecMenu
{
	int                                                WeaponID_0_1CC1794074E290EF48708FDA0544EAF4;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     WeaponIconUrl_1_4C1245005581D45C22285CB60DD2722C;         // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                WeaponType_2_5F021E8039EF73364DE6930B04EBA525;            // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     WeaponName_3_0835B6405FEEA96902BD5AAB04EB6375;            // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IsSelect_4_10B2A28049BF3BF46D655735065FA154;              // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     WeaponShortName_5_5CDCBA4078FA90BD1AC4C45B02D7FDF5;       // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               RedPoint_6_1B1AA4C0465A211940DADE080554D824;              // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0031(0x0003) MISSED OFFSET
	int                                                SkinQuality_7_7D295B007552069640D3AB610031E4D9;           // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

