#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RankRegionStrongerInfo.BP_STRUCT_RankRegionStrongerInfo
// 0x0089
struct FBP_STRUCT_RankRegionStrongerInfo
{
	int                                                no_0_1629C880329DE9D477E8BBF80BB837EF;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     strongerlist_type_name_1_3B51858009B2516A5ECCB7C80882E545;// 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                cur_avatar_box_id_2_7A8150401366C58D2068C5C00E3E1044;     // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     rank_icon_frame_path_3_70005BC04B7E75A525A8E8F60FFAD868;  // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                level_4_37F6F74053C28D2953529B5F0378773C;                 // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     rank_icon_path_5_1791C1407093063F69B5228E0C4F0068;        // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     rank_time_str_6_62F7CDC01D24A55575E6804F0EDBFF62;         // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     uid_7_29C1A1C026181A476CF920440B837144;                   // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     name_8_05AF59801DEA9924568E006A0837ED85;                  // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                stronger_type_9_0B14168044D73BFA2B568D4B0C8267C5;         // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gender_10_2E3BAE8034B7860857125E1E0671F2F2;               // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     url_11_50F586005CEA52266CF923760B83763C;                  // 0x005C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               showWarZone_12_63B2D3006D4E95C054C706BC0EF57905;          // 0x0068(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0069(0x0003) MISSED OFFSET
	struct FString                                     corpsName_13_35169B40486E9787424B11A202F524E5;            // 0x006C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                corpsIcon_15_692BBD407DEF1CFF424C2A8A02F49E8E;            // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                systemType_16_1CFA03000EE7BF5E6A9E81C60295BB75;           // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                score_17_511C58405D6A0F195E2B809903733D05;                // 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                corpsId_18_5DC766404611371114A68DB604D2F494;              // 0x0084(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               showCorpsWarZone_19_1A7AD4C06D8E71F70B39698F0E37B515;     // 0x0088(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

