#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:41 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_AvatarBPTable_type.BP_STRUCT_AvatarBPTable_type
// 0x0038
struct FBP_STRUCT_AvatarBPTable_type
{
	struct FString                                     CName_0_A4052DC94E7BDAA9FAD3B19A7B988D48;                 // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     AvatarBPPath_1_891FA0534B751701E31560B16F286D8B;          // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ItemID_2_5414CFBB435533293B561394BF4A770E;                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BaseMaterial_4_BB10FD1746E1312D290060B355928632;          // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IsPackage_6_8A447B1A47E74FFEC3441AB4077497C5;             // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Wrapper_7_663E34007B103FC200DAC514020BE042;               // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

