#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:42 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_LinkStyleRes_type.BP_STRUCT_LinkStyleRes_type
// 0x002C
struct FBP_STRUCT_LinkStyleRes_type
{
	int                                                FontSize_0_A45833814314772AA0F40587CB0DD2DB;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     StyleName_1_01B6B5F543AB25F3AC37A48BDB25594A;             // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               UnderLine_2_89F7D6C64387435409BA1A84421C6F57;             // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FString                                     FontColor_3_D2BCBAE447301225879E948D36B9BD28;             // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     FontPath_4_0A5E92CA4BB4DAF4821590AD6C060516;              // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

