#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsShareSegmentInfo.BP_STRUCT_CorpsShareSegmentInfo
// 0x0040
struct FBP_STRUCT_CorpsShareSegmentInfo
{
	int                                                corpsSegement_0_748F0B4011CE79A57710ED2304C676C4;         // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                corpsIcon_10_401B3F8032B30CAA40694ADA0E41F74E;            // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                beatPlayerCnt_2_53A97F00758CC3E207EED8DB0733C974;         // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                beatCorpsCnt_3_498485803C9A1BB40E659CA2066B8654;          // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                fightCnt_4_7BB0A140252AE8E921747D2108ACEAE4;              // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     corpsSegementIcon_5_458FED8022DD30262F8583FE06CC402E;     // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                corpsFeatValue_6_6467FC8016B164C01BFD59DB09787FF5;        // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     corpsName_7_0C061D8057C7E9DC4056C75C0E424925;             // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                winCnt_8_43E7B040567F949776022A2701A95B34;                // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     corpsSegementName_9_117ACB8026F4C1182F85EDB006CD8245;     // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

