#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:47 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_BP_RefluxTrainingListDataList_type.BP_STRUCT_BP_RefluxTrainingListDataList_type
// 0x0044
struct FBP_STRUCT_BP_RefluxTrainingListDataList_type
{
	int                                                online_11_1B4F3C000BC4FCC4208A2D5D028AA945;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                teamState_6_126A44C02F1F411B049A91C4005AA0D5;             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     uid_2_69928B406BA70AD52966B04E08700924;                   // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                sex_3_79618EC0213494DF2966AFBF08700B18;                   // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_4_58A383005147B3021E4BD42407026BB5;                  // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                segmentLebel_5_47BCD0801F9E7BDA277B1CC60544DC7C;          // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                maxTeamCount_7_7F13F040516C25E540EAE765060D37E4;          // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     iconUrl_8_7F40F1C0464B105D057E4EC80D5E4C9C;               // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                level_9_406E60C04B3E8D2B4EA68D4A002014CC;                 // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                currentTeamCount_10_05DC7F807D68B678232669E009DE71F4;     // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                iconBoxID_12_17B8D280315D979C0C4415920E597184;            // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

