#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ShareHistoryResults_DetailInfo.BP_STRUCT_ShareHistoryResults_DetailInfo
// 0x0087
struct FBP_STRUCT_ShareHistoryResults_DetailInfo
{
	int                                                battle_type_0_EC056C1D41DAEEEF282803ABEA159A14;           // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     wisdom_1_8DDE52924801AE817B25549580F20645;                // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     battle_typename_2_067CE6214BDEF762DA0FE3880B0D1E53;       // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     final_level_3_BC8AF8BA4E1A0FE9368C1BAA3D3B0041;           // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                add_exp_4_0F8B045F4E66AAAFBA16E584C49F15AF;               // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                battle_id_5_85BA1B3A4FB4D9C4EA07DD9B486DD38E;             // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                battle_time_6_5E58672240C44BA4F691869801278A0D;           // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     final_score_7_9D21DD7746756B47B226DF91DC560853;           // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     reason_result_8_714579224E7E18693A13B481205D8E88;         // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                change_rating_9_15F0F046473F08858405CD943C919BD3;         // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                total_team_count_10_482B56C64683AF3654F158BAE3D50087;     // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                person_rank_11_CF6FD76E434E0B59E8F844868E646AE0;          // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_solo_12_1F451E3F4A5F5145EDAF8E9B30F677F0;              // 0x0058(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0059(0x0003) MISSED OFFSET
	struct FString                                     reason_13_897CB41B4316E7B6811B179FF5215BA6;               // 0x005C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                add_gold_14_AC1FFB564D665D07ACB8138DB718A2E0;             // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                total_player_count_15_79DDF22942C00C115E6161BF99FD18A2;   // 0x006C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                rating_16_8E2BCE7A4EDBA4FD54C9FE91F1E79F3A;               // 0x0070(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                team_rank_17_966D6BEE4726BB3C32812E803AF63D2A;            // 0x0074(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                change_kill_rating_18_A6FFF35949AA12E4475E518CF2AC4585;   // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                change_win_rating_19_3021694046196AD9A0F993A2303AE165;    // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segment_20_00C611304733906A98116CB85DE8D8E3;              // 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_blackroom_21_4BAD5FC03BF27B8D6650F9060D2EA15D;         // 0x0084(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_resource_battle_22_13A6A2004390AAC0708D815301681875;   // 0x0085(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_resource_win_23_2E59B68047AAB032480795750AD523FE;      // 0x0086(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

