#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:42 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsRank.BP_STRUCT_CorpsRank
// 0x0028
struct FBP_STRUCT_CorpsRank
{
	int                                                SegmentLevel_0_532494C02AE7E7293F16F5CB098A7EFC;          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                KilledNum_1_155263405DF712FF5E66A67B0633726D;             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TotalDamage_3_0BE352C065241D3D3FBF7412086B6AA5;           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DefeatPlayerNum_4_3D967B806AE991C05E4B620B035C3E1D;       // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RealtimeRank_5_022F71C01EEA830150766D8304D2966B;          // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CorpsHeadIcon_6_044942807D60609E5BF59D600B26975E;         // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Name_7_7AB9424051E0E96D118F9D45018E2545;                  // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SurvivalTime_8_34423CC016344913078CB98500CE42B5;          // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

