#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Shop_Gift_Item_Info.BP_STRUCT_Shop_Gift_Item_Info
// 0x0040
struct FBP_STRUCT_Shop_Gift_Item_Info
{
	int                                                quality_0_74D236804F6FA3245EB179A109BFB6E9;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     product_desc_1_584A940061B2203847B47587000C6F73;          // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     pruduct_name_2_6A81D6006FF759D811FD5377000D65D5;          // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_path_3_6741E18056945A2817668A780DC02608;             // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                item_id_4_09984B00549CFA1870DC26AB01A3B3A4;               // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                product_price_5_0D0851003691EC46442F4C4A00FBB195;         // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                before_discount_price_6_35ABDF80237DF02A36201BC5001F1715; // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     money_path_7_3BF541405D6F6BBB36C8A74D04935E78;            // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

