#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_OB_TITLE_TOTAL.BP_STRUCT_OB_TITLE_TOTAL
// 0x0034
struct FBP_STRUCT_OB_TITLE_TOTAL
{
	TArray<struct FBP_STRUCT_OB_TOP_HIT_RATE_SINGLE>   BP_ARRAY_TOP_HIT_RATE_LIST_0_36447D804F7E88064EC484E10A007234;// 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FBP_STRUCT_OB_TOP_KILLER_SINGLE>     BP_ARRAY_TOP_KILLER_LIST_1_0461F2406F2603B37507D40C00B28DB4;// 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     first_blood_uid_5_54C9C0803C5192B27A7751890204B684;       // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FBP_STRUCT_OB_TOP_DAMAGE_SINGLE>     BP_ARRAY_TOP_DAMAGE_LIST_3_4F9EE9406081126F59D8A28C01860DE4;// 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                battle_id_4_0770BC801D8F2EFA3E5BF5E306623234;             // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

