#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// ScriptBlueprintGeneratedClass bp_macros.bp_macros_C
// 0x0830 (0x0B00 - 0x02D0)
class Abp_macros_C : public ALuaClassObj
{
public:
	class UScriptContextComponent*                     Generated_ScriptContext;                                  // 0x02D0(0x0004) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	int                                                BP_ENUM_STARTUPTYPE_WXGAME;                               // 0x02D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_MAIL;                                  // 0x02D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_PROMOTION_ZORDER;                              // 0x02DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_OB_RESULT_TITLE_MORE_DETAIL_ZORDER;            // 0x02E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_SEASON_REVIEW_ZORDER;                          // 0x02E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_REFLUX_TRAINING_AWARD_ZORDER;                  // 0x02E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_CORPS_UI_LBSRANK;                                 // 0x02EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_WARZONE_SHARE;                                    // 0x02F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_BATTLERESULT_STRATEGYBTN;                         // 0x02F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_WX_COMMUNITY;                 // 0x02F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_ENABLE_STACK_PANEL;                               // 0x02FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_OPEN_BOX_ZORDER;                               // 0x0300(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_SHOPLIMIT_ZORDER;                              // 0x0304(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_ADD_FRIEND_FROM_CHAT;                             // 0x0308(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_CORPS_WAR_ENTRY_ZORDER;                        // 0x030C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_ADD_FRIEND_FROM_CORPS;                            // 0x0310(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_ADD_FRIEND_FROM_RECOMMENDLIKED;                   // 0x0314(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_PLAYFORM_UNINGAME;                                // 0x0318(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_LIVE_BROADCAST_ZORDER;                         // 0x031C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_AllRedPacket_ZORDER;                           // 0x0320(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_SETTING;                               // 0x0324(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_COMMON_TREASUREBOXPOPUP_ZORDER;                // 0x0328(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_WX_ESPORTS;                   // 0x032C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_COMMON_ITEM_GET_ZORDER;                        // 0x0330(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_FRONTIER_AWARD;                            // 0x0334(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_NEWTEACHING;                               // 0x0338(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_MUSTER;                                    // 0x033C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_REFLUX_NEW;                                // 0x0340(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_REFLUX_ZORDER;                                 // 0x0344(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_FRIEND_PANEL_JUMP_TO_LABEL_PANEL;          // 0x0348(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_WATERING_TREE;                             // 0x034C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOGINLIMIT_TIME2;                                 // 0x0350(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_EXCITINGTOUR;                              // 0x0354(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_PLAYFORM_XINYUE;                                  // 0x0358(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_ADD_FRIEND_FROM_RECRUIT;                          // 0x035C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_ENUM_wardrobeTabString_all;                            // 0x0360(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BP_ENUM_MODULE_WEEKEND_REVELRY;                           // 0x036C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_SEASON_CHALLENGE;                           // 0x0370(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_QQ_VIP;                                       // 0x0374(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_CORPS_ModifyAnnouncement;                      // 0x0378(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_WARZONE_MAIN;                                     // 0x037C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_LIVE;                                         // 0x0380(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_ALLIANCE_PANEL;                               // 0x0384(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_SHARE_ITEM_ZORDER;                             // 0x0388(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_STARTUPTYPE_COMM;                                 // 0x038C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_AVATAR_HEAD;                                      // 0x0390(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_MAIL_ZORDER;                                   // 0x0394(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_EIGHT_DAY;                                 // 0x0398(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_ACTIVITY_WATERTREE;                            // 0x039C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_NIAN_MONSTER_EXPLORE;                      // 0x03A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_Share_cjhb_ZORDER;                             // 0x03A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_COMMON_ITEMTIPS_ZORDER;                        // 0x03A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_CORPS_TRAINING;                            // 0x03AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_VIDEO;                                        // 0x03B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOGINLIMIT_TIME1;                                 // 0x03B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_GENDER_MALE;                                      // 0x03B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_UPDATENOTICE_INGAME;                   // 0x03BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_TREASURE_HUNT;                             // 0x03C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_ResetRole;                                     // 0x03C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_SETTING_PANEL;                                // 0x03C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_PROFILE_MSG_TYPE_FRIEND;                               // 0x03CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_SHOP_PANEL;                                   // 0x03D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_PROFILE_MSG_TYPE_ROLEINFO;                             // 0x03D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_LOBBY_CORP_RANK;                              // 0x03D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_CORP_RANK_TYPE_B;                             // 0x03DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_Alliance_Recruit;                              // 0x03E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_NEXT_GROUP;                  // 0x03E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_FRIEND_ZORDER;                                 // 0x03E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_QQ_LIULIANG;                  // 0x03EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER_ONLINE_DAY;           // 0x03F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER_TACTICS_OPTIMISTIC;   // 0x03F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_QQ_LIVE;                      // 0x03F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_COMMON_USEITEMS;                               // 0x03FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_ALLIANCE;                              // 0x0400(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_TOURIST_LIVE;                 // 0x0404(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_WORLDVIEW;                             // 0x0408(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_ARMORY;                                // 0x040C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_LOBBY_CORPS;                               // 0x0410(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER_MAP_SNOW;             // 0x0414(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER_TEAM_5;               // 0x0418(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER_TEAMJOY_3;            // 0x041C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_LOADING_ZORDER;                                // 0x0420(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_WATCHING_PRIVACY;                      // 0x0424(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_CORPS_WAR_RANK_UPDATE_ZORDER;                  // 0x0428(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CORPS_HOMEPAGE;                                     // 0x042C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_ITEM;                                         // 0x0430(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_GRADE;                                        // 0x0434(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_WXFRIENDCIRCLE;                               // 0x0438(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_SHAREBTN;                                     // 0x043C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_SETTING;                                   // 0x0440(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_WXFRIEND;                                     // 0x0444(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_EIGHT_DAY_NEW;                             // 0x0448(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_QQ_INVITE_FRIEND_TEAM;        // 0x044C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_TOP_UI_DEVICE_NOTICE_ZORDER;                      // 0x0450(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_INVITE_PLATFORM_TEAMUP;                       // 0x0454(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_VIDEO_TO_FRIEND;                              // 0x0458(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_TASK;                                      // 0x045C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_PROFILE_MSG_TYPE_CHATROOM;                             // 0x0460(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_NEWTEACHING_CLICK_2;                                // 0x0464(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_COME_BACK_LOGIN_AWARD;                            // 0x0468(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_APPLY_TO_DISCIPLE;                         // 0x046C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_ROLEINFO_ZORDER;                               // 0x0470(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_MASTER_APPLIST_ZORDER;                         // 0x0474(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_QQ_COMPETITION;                        // 0x0478(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_LEVEL_UP_ZORDER;                               // 0x047C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_MUSTER_ZORDER;                                 // 0x0480(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_NEWTEACHING_CLICK_8;                                // 0x0484(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_PANDORA_WISH;                              // 0x0488(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_NEWTEACHING_CLICK_10;                               // 0x048C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SLAP_SYSTEMGO;                                      // 0x0490(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_REDPACKET;                                 // 0x0494(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_CORPS_INFO_ZORDER;                             // 0x0498(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CORPS_TASK;                                         // 0x049C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_TASK;                                  // 0x04A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CORPS_TRAINING;                                     // 0x04A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_COME_BACK_NOTIFY_FRIENDS;                         // 0x04A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_Share_Day_Fianly_ZORDER;                       // 0x04AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_WARDROBE;                              // 0x04B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CORPS_INVITE_FRIEND;                                // 0x04B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_DEPOSCOME;                                 // 0x04B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_WARDROBE;                                  // 0x04BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_SHARE;                                     // 0x04C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_ADD_FRIEND_FROM_MUSTER;                           // 0x04C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_ACTIVITY_GROUP_ZORDER;                         // 0x04C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SETTING_FREEDOM_REC;                                // 0x04CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_SHOP;                                      // 0x04D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_INVITED;                     // 0x04D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_GIFTCENTER;                   // 0x04D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_PROMOTION;                                 // 0x04DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_WX_DIANJING;                                  // 0x04E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_COME_BACK_ZORDER;                              // 0x04E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CORPS_INVITE_ARMY;                                  // 0x04E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_CORPS_UI_BASE_INFO;                               // 0x04EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_EXCITING_FEAST;                            // 0x04F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_WARZONE_LOCATE_UI;                                // 0x04F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_CORPS_HOMEPAGE_ZORDER;                         // 0x04F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_WARZONE_OPEN;                                       // 0x04FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_MYSTICAL_DIVINE_LOTTERY;                            // 0x0500(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_MYSTICAL_DIVINE_INVITE_ONLINE;                      // 0x0504(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_MYSTICAL_DIVINE_INVITE_TEAM;                        // 0x0508(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_COMMON_RIGHT_NOTIFY_ZORDER;                    // 0x050C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_SHare_normal_cjhb_ZORDER;                      // 0x0510(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_WXGAMEGROUP;                                  // 0x0514(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_CORPS_UI_RANK;                                    // 0x0518(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_ROOM_LIST_ZORDER;                              // 0x051C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLOCK_LOCAL_NOTIFICATION;                           // 0x0520(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_WARZONE_PERMISSION_CONFIRM;                         // 0x0524(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_ACTIVITY_APPOINTMENT_OPEN;                          // 0x0528(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_OWN_CORPS_ZORDER;                              // 0x052C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_ACTIVITY_NIAN_LOBBY;                                // 0x0530(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER_MAP_ISLAND;           // 0x0534(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_WARZONE_TITLE;                                    // 0x0538(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_ACTIVITY_NEWYEARFIREWORKS_ZORDER;              // 0x053C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_SHOP_TYPE_AVATAR;                                 // 0x0540(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_CORP_RANK_SELF_TYPE;                          // 0x0544(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_LOBBY_BGTYPE_PARACHUTE;                                // 0x0548(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_ENUM_wardrobeTabString_default;                        // 0x054C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BP_ENUM_wardrobeTabString_head;                           // 0x0558(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BP_ENUM_wardrobeTabString_gun;                            // 0x0564(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BP_ENUM_wardrobeTabString_parachute;                      // 0x0570(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BP_ENUM_LOBBY_MENU_PANDORA_RECOMMEND;                     // 0x057C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_ENUM_wardrobeTabString_emoj;                           // 0x0580(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BP_ENUM_DIAMOND_ID;                                       // 0x058C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_ENUM_wardrobeTabString_items;                          // 0x0590(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BP_ENUM_wardrobeTabString_trousers;                       // 0x059C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BP_ENUM_WardrobePageType_Avatar;                          // 0x05A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_WardrobePageType_Parachute;                       // 0x05AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_NEWTEACHING_CLICK_5;                                // 0x05B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_SHARE_PANDORA_ZORDER;                          // 0x05B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CORP_RANK_WEEK;                                     // 0x05B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_CORPS_UI_GROUP;                                   // 0x05BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_ACTIVITY_CENTER;                              // 0x05C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_WXAROUND_OUT;                          // 0x05C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_PANDORA_COllECTION;                        // 0x05C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_WATCH_CHAIN;                           // 0x05CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_CORPS_UI_MAIN;                                    // 0x05D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_ADD_FRIEND_FROM_MASTER;                           // 0x05D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_FRIEND_MASTER;                         // 0x05D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_CONTEST_PAGE;                              // 0x05DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_ALLIANCE_MAIN_PANEL;                       // 0x05E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_TEACHING;                              // 0x05E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_PROFILE_MSG_TYPE_RANK;                                 // 0x05E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_SHOP_ZORDER;                                   // 0x05EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_COMBAT_MSG_TYPE_ROLEINFO;                              // 0x05F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_UPDATENOTICE_INGAME;                       // 0x05F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_Nian_Monster_ZORDER;                           // 0x05F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_SHOP_SUB_TYPE_HEAD;                               // 0x05FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_FACETOFACE_GANGUP;            // 0x0600(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_GOOD_ITEM_GET_ZORDER;                          // 0x0604(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_TOP_UI_NEWER_GUIDE_ZORDER;                        // 0x0608(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CORPS_WAR_ENTRY_SHOW;                               // 0x060C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_TEAM;                                      // 0x0610(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_GENDER_FEMALE;                                    // 0x0614(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_WARZONE_PERMISSION_CANCEL;                          // 0x0618(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_PANDORA_OPEN;                                     // 0x061C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_ADD_FRIEND_FROM_FRIEND_SEARCH_PANDORA;            // 0x0620(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_Share_Game_Result_ZORDER;                      // 0x0624(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_ROOM;                                  // 0x0628(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CORPS_INVITE_RECENT;                                // 0x062C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_OB_RESULT_TITLE_ZORDER;                        // 0x0630(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_ONE_CLICK_ATT;                                      // 0x0634(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_WATCHING_BATTLE_DETAILBTN;             // 0x0638(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_UISetting_ZORDER;                              // 0x063C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_CORPS_AUTO_INVITE_ZORDER;                      // 0x0640(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_CORPS_UI_CORPS_RANK_B;                            // 0x0644(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_QQ_GAMEGROUP;                 // 0x0648(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_ACTIVITY_NIAN_ENTRANCE;                             // 0x064C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_STARTUPTYPE_QQGAME;                               // 0x0650(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_RECONNECT_WAITING_ZORDER;                      // 0x0654(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MUDULE_OFFICER_TRAINING;                          // 0x0658(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_Share_PersonInfo;                              // 0x065C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_CHAT_ENTRANCE_ZORDER;                          // 0x0660(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_CITYCIRCLE_RUN;                            // 0x0664(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_ENUM_wardrobeTabString_face;                           // 0x0668(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_WX_START;                     // 0x0674(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER_ONLINE_UNLIMITED;     // 0x0678(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_APPRAISE_ZORDER;                               // 0x067C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_PLAYFORM_WX;                                      // 0x0680(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_SEASON_PASS;                                // 0x0684(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_PLAYFORM_QQ;                                      // 0x0688(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_INVITE_FRIEND;                             // 0x068C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_COMMUNITY;                                    // 0x0690(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_COMPLAIT_FEEDBACK;                     // 0x0694(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_INVITEFRIEND_FROM_WX_QQ;                      // 0x0698(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_QQFRIEND;                                     // 0x069C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_WARZONE_RANK_ZORDER;                           // 0x06A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_MARKET_ZORDER;                                 // 0x06A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_UPDATENOTICE_INGAME_PERMANENT;                // 0x06A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER_TEAMJOY_5;            // 0x06AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_ACTIVITY;                              // 0x06B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_CORPS;                                     // 0x06B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_SEASON;                                // 0x06B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_ACTIVITYBTNLIST;              // 0x06BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_WATCHING_PANEL;                               // 0x06C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PANDORA_SEARCH;                        // 0x06C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_ADD_FRIEND_FROM_FRIEND_NEARBY;                    // 0x06C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_RANK;                                  // 0x06CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_BATTLERESULT_SHAREWXMINAPP;                       // 0x06D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_WORLDVIEW_PANEL;                              // 0x06D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_UPDATE_NOTICE_ZORDER;                          // 0x06D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_WATCHING_INVITE;                       // 0x06DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_WEEK_SIGNUP;                               // 0x06E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_LIVE_BROADCAST;                               // 0x06E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_GAMEPROPAGANDAPANEL;                          // 0x06E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_OPENSERVICE_CARNIVAL;                      // 0x06EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_QQSPACE;                                      // 0x06F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_LOBBY_BGTYPE_MARKETAPPREARANCE;                        // 0x06F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_CORPS_UI_WAR;                                     // 0x06F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_WX_GAMEGROUP;                 // 0x06FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_WardrobePageType_Gun;                             // 0x0700(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_ADD_FRIEND_FROM_MASTER_APPLIST;                   // 0x0704(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_CORPS_TEAM_MEMBER_ZORDER;                      // 0x0708(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_WX_XINYUE;                    // 0x070C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_ENABLE_DESTROY_DYNAMIC_WIDGETLIST;                // 0x0710(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER_MAP_DESERT;           // 0x0714(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_QQ_ESPORTS;                   // 0x0718(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_CORPS_UI_TRAINING;                                // 0x071C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SETTING_WONDERFUL_MOMENT;                           // 0x0720(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_QQMORE;                                // 0x0724(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_ROLEIFNO_CREDITPOINT;                  // 0x0728(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_FACE_SLAP_ACTIVITY;                               // 0x072C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_SEASON_PASS_COLLECT_PROGRESS;               // 0x0730(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_EIGHTDAY_ZORDER;                               // 0x0734(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_SHOP;                                  // 0x0738(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_PLAYFORM_TOURIST;                                 // 0x073C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_ACT_NOTICE_SHOW;                                    // 0x0740(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SETTING_OPENED_MOMENT;                              // 0x0744(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_LOBBY_PLATFORM_ZORDER;                         // 0x0748(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_JOIN_PLATFORM_TEAMUP;                         // 0x074C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_WX_HUATIQUAN;                 // 0x0750(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_RANK;                                      // 0x0754(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_SEVEN_DAYS_FUN;                            // 0x0758(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_ROLE_INFO;                             // 0x075C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_GUIDE_PANEL;                                  // 0x0760(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_REFLUX;                                    // 0x0764(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER_TACTICS_APATHY;       // 0x0768(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_EXCITING_TOUR_ZORDER;                          // 0x076C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_TASK_PANEL;                                   // 0x0770(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_FRD_RECALL_ACT_CLICK;                               // 0x0774(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_COLLECT_EQUIPMENT;                         // 0x0778(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_XINYUE;                                       // 0x077C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_SYSTEM_USE_UE_DROP;                               // 0x0780(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_NEWTEACHING_CLICK_6;                                // 0x0784(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_LIBAO;                                        // 0x0788(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_SEASON;                                    // 0x078C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER;                      // 0x0790(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER_TEAM_3;               // 0x0794(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_SHARE_AWARD;                               // 0x0798(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_QQAROUND_OUT;                          // 0x079C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_ROLEIFNO_BATTLEDETAIL;                 // 0x07A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_RANK_ZORDER;                                   // 0x07A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_CORPS_UI_MALL;                                    // 0x07A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_QQ_START;                     // 0x07AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_WATCHING_BATTLE_BASEINFO;              // 0x07B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_ACTIVITY_APPOINTMENT;                      // 0x07B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_WARDROBE_ZORDER;                               // 0x07B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_WX_LIULIANG;                  // 0x07BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_MODULE_CHAT;                                      // 0x07C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_CORPS_UI_MISSION;                                 // 0x07C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_INVITEFRIEND_FROM_FRIENDLIST;                 // 0x07C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_ADD_FRIEND;                  // 0x07CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_RESERVATION;                                  // 0x07D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_ACTIVITY_ZORDER;                               // 0x07D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_WXAROUND_IN;                           // 0x07D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_SHARE_ROOMREFASH;                                   // 0x07DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CLICK_PLATFORM_RECRUIT_FILTER_OK;                   // 0x07E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_BANINFO;                               // 0x07E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_CORPS_Invitation;                              // 0x07E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_NOTICE_ZORDER;                                 // 0x07EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_GUARD_ZORDER;                                  // 0x07F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_WARZONE_STRONGER_RANK_ZORDER;                  // 0x07F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_CORPS_LOBBY_ZORDER;                            // 0x07F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_WATCHING;                              // 0x07FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_MASTER_TASK_ZORDER;                            // 0x0800(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_AVATAR_FACE;                                      // 0x0804(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_LOBBY_UPDATENOTICE_INGAME_ACTIVITY;                 // 0x0808(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_PLATFORM_QQ_INVITE_FRIEND_LOBBY;       // 0x080C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_UI_CORPS_SEASON_HISTORY_ZORDER;                   // 0x0810(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_ENUM_LOBBY_MENU_CORPS;                                 // 0x0814(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_CORPS_INVITE_NEARBY;                                // 0x0818(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
