#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:47 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_FPPCombatTotalInfo.BP_STRUCT_FPPCombatTotalInfo
// 0x0048
struct FBP_STRUCT_FPPCombatTotalInfo
{
	struct FString                                     role_toptennum_0_40010F007A84FD886E0958450EF641AD;        // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_allmatchnum_1_0A7E3A0045EF75286C8D283906E699DD;      // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_critrate_2_479D6C000119B05A535F3E55009E6CE5;         // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_killnum_3_12B453805F0DAD9E7A62CE5F089C8BED;          // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_kd_4_3C0B2840767EACFD5F1979630795E584;               // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_winnum_5_0128BC0016CB752E36080D900749E05D;           // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

