#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ReservationFriendProfile.BP_STRUCT_ReservationFriendProfile
// 0x00C4
struct FBP_STRUCT_ReservationFriendProfile
{
	struct FString                                     nickName_0_6F6E55801C3B21303AD1A91900D27B85;              // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                sex_1_1FDE000047ABD12E7AACB5C204E3D638;                   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                maxTeamAmount_2_650C9C401822039955E198950D1B24E4;         // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                timeSinceGameBegin_3_1C2DAC00751648607965017B0080541E;    // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     remarks_name_4_201E294037B56EC500C2E21D000132E5;          // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ladder_5_7D7A87007F7C996E06DDED450DD8E4F2;                // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                online_6_45CDCD405157BE857E9243D30DBC6275;                // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                history_max_segment_level_7_25200C002CD558F23175E9570E632FDC;// 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                vipLevel_9_09B2DDC02CA2DFC9162C07080F1CF1FC;              // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                showInviteIcon_12_68F81A40763572016F52C9C6028C22EE;       // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     picUrl_14_125987C010C749D17E85ACAB0D90C2BC;               // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                teamId_15_4771E1001AC54AA20B3255C10D544FC4;               // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_16_3BF19200520BBD84032C274603DD385C;                // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                currentTeamAmount_17_09CF0B805F632C666DF4CBF10900FE74;    // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     platName_18_29EB188014F8480A431E34FE0DC77B95;             // 0x0050(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                game_mode_19_7A1493801B3DCA0E07E5653A07580735;            // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     gameModeStr_20_50F6A2005D44AF80254728C601983D32;          // 0x0060(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     timeSinceGameBeginStr_21_6599BA4024FAE42319C880AF054232B2;// 0x006C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     applyMsg_22_2F22FF4078DA97650BCA6C16083DF8E7;             // 0x0078(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     gid_23_22B4790011D533827AACBF5304E3C204;                  // 0x0084(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                reserveState_24_6CBACB40540249AB2D452A2601D97A05;         // 0x0090(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                op_25_14AE63C02D2A08515F7006C70F4E3D90;                   // 0x0094(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                intimacy_26_50CF038024199D7A122510ED0AE20BB9;             // 0x0098(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                teamState_27_7BBAF6004DB461C43A9C664904C97DE5;            // 0x009C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                lastOnlineTime_28_3FCB960010A5CE60003A02DA09ADD6C5;       // 0x00A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                watchUid_31_2F5A9A402464BFED2B2E6B7807E7E6D4;             // 0x00A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gameSubMode_32_052C5E400ADA34114E6967A80975B2E5;          // 0x00A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_max_segment_level_33_3DC0DA001B09810634A2ED08053CBFBC;// 0x00AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_avatar_box_id_34_124B6B007DD28D4851B8CF1E0E9B5924;    // 0x00B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     stateStr_35_7DB8828042E30CD2075E238E05C497E2;             // 0x00B4(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ownerID_36_3A9F9A003DE77FDC7F41296A09302504;              // 0x00C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

