#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WarZoneRank_PlayerData.BP_STRUCT_WarZoneRank_PlayerData
// 0x0030
struct FBP_STRUCT_WarZoneRank_PlayerData
{
	int                                                headid_0_3230DB004096FABC15474DC20748E694;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sex_1_5EAB1740620C13197F13712D09C663F8;                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        BP_ARRAY_FeatureList_2_16B771001AE8502E6F7058D606209BA4;  // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     gid_3_6181904029A6052D7F12CF9309C677C4;                   // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<int>                                        BP_ARRAY_AvatarList_4_729655C05D11A59525EEAE1401301D14;   // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                weapon_5_4D12C5C031DC1837264E9EB206781B3E;                // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

