#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WarZoneMedalChooseInfo.BP_STRUCT_WarZoneMedalChooseInfo
// 0x0048
struct FBP_STRUCT_WarZoneMedalChooseInfo
{
	struct FString                                     rank_name_0_361BEDC02E0BFEDB3F704A0108B66FC5;             // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     pedal_path_1_3A5487404DC4A15B002957C40E241A38;            // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     score_var_2_55BAF3C0609F12194FB41A9C052B4492;             // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     display_desc_3_59195FC0502DEED15E6AAD780B3C31B3;          // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                order_4_719409C0376C85D70C62053C00471962;                 // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                id_5_4157960027CC290A1608F16B093A03E4;                    // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     icon_path_6_2FD7F0000B7D1D960EA2AD7107A656B8;             // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                min_segment_id_7_7BCD13400153D3C77E168EF304B945F4;        // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

