#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WarZoneRank_RoleInfo.BP_STRUCT_WarZoneRank_RoleInfo
// 0x002C
struct FBP_STRUCT_WarZoneRank_RoleInfo
{
	struct FString                                     sign_str_0_60A40B40596D6C0D5139F9A60C702172;              // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                title_level_1_2F61B74047CD59A953D6B3AC0FA2FF5C;           // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     title_2_0F0BF98015B9C9E26CE4691004C033E5;                 // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     title_image_path_3_085775005C97B4A424DAC18A036C68E8;      // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                holidayTitle_5_1D570C003091794A3CDA26E9022EAAC5;          // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

