#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:42 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SpawnPlayerData.BP_STRUCT_SpawnPlayerData
// 0x002C
struct FBP_STRUCT_SpawnPlayerData
{
	struct FString                                     gid_0_5016F4854EC3A5A8C89AB9A764FDB20C;                   // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<int>                                        BP_ARRAY_AvatarList_1_8AE9030B48C5C4C6D1018E9AA7E71DC0;   // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                sex_2_0DDDE1C14A0CC9529DBFC78A27E51E63;                   // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                headId_3_268971594D7E7A10BB2864B16488B3D7;                // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                index_4_1D0911E640748785A250C28C3602624D;                 // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                weaponSkinId_5_4C88EC4015366C731872894B0D0BF054;          // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                weaponId_6_496F4700627786786DBF57930A12AD94;              // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

