#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_MatchTagInfo.BP_STRUCT_MatchTagInfo
// 0x0020
struct FBP_STRUCT_MatchTagInfo
{
	int                                                tag_0_441011802E387748146143A30405AAB7;                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     itemText_1_07F73780070A5BCE5018AD990702F0F4;              // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               isSelcted_2_34FA8A8062E013A02CDF672F0DC76AF4;             // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FString                                     icon_3_514B0CC0486849872556302E005BF61E;                  // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

