#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WarZoneMedalInfo.BP_STRUCT_WarZoneMedalInfo
// 0x0054
struct FBP_STRUCT_WarZoneMedalInfo
{
	struct FString                                     icon_path_0_1C4C37C02B9F92B51C9602860AE0CF68;             // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     pedal_path_1_01A0EF000694083254DB16380A8D81C8;            // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                id_2_7822FDC016ECF8D17DF950EE02CE6A74;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     score_var_3_422F3B8059C6FA5872E223560A6DDD42;             // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     rank_name_4_2290358025C803FA5631756409F4F855;             // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                order_5_2E07D18067E05266240EDEE306BEA622;                 // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                min_segment_id_6_59D9FB004A062D3E01E5F5E70CCD7584;        // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     display_desc_7_5FE607804CEEE2D24261808402E7C5D3;          // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     instruction_8_55F79B003CB0B75A0F61CA7F0F12DA0E;           // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

