#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:51 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_TeamUpMenuInfo.BP_STRUCT_TeamUpMenuInfo
// 0x0084
struct FBP_STRUCT_TeamUpMenuInfo
{
	struct FString                                     player_name_0_AC4BB02B4BAB0A57C0CC8BB35C138548;           // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     player_id_3_5E070A5A451350DFEA7B928AC411EFFF;             // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                player_status_5_C32C3D8E4A811B12B86C0B8CA89E1BC3;         // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               player_online_4_625C8CC9452657A2F278B897DF80ABEC;         // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               player_isFriend_6_02EE2E5B495C5B1FEF678691889CE37D;       // 0x001D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x001E(0x0002) MISSED OFFSET
	int                                                player_position_7_B50A33B94FC6B2EAE4B0E28EC3D2AED3;       // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               player_isSpeaking_8_9A8A49094A203D9C6C087384F5EA1564;     // 0x0024(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               player_openVoice_9_7B74A3194F4C86F300FD62A3D76C381D;      // 0x0025(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0026(0x0002) MISSED OFFSET
	int                                                player_gameStart_10_41815B8A47C408F8B226D0AD90A07336;     // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     player_carteamName_11_DE30791E4BEF6562FDFFEC931B696D7F;   // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                player_sex_12_7A33C0EE4F0D241BD801898D51C3AFDE;           // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                player_credit_13_4A2812401029B19F5A31E34F016D9704;        // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     player_corpsIconUrl_14_30206C40442425A75BB8E31E0F0787FC;  // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     player_corpsName_15_7882BD805202D03C507DC99A0BB85205;     // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                anchor_color_G_16_6E3A40405A2D637D7C36581204277957;       // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                anchor_color_A_17_6E343EC05A2D63777C36581404277951;       // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     anchor_prefix_18_5022D2807E5CBF1007F4A78A05DCFEF8;        // 0x0060(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                anchor_color_B_19_6E353F005A2D63787C36581504277952;       // 0x006C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     anchor_icon_res_path_20_0F3FC68071737C020527F6AD09745148; // 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                anchor_color_R_21_6E4543005A2D63887C36580504277922;       // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                player_rank_22_53AA7E800F86928A374C27150C02436B;          // 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

