#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SelfMemberInfo.BP_STRUCT_SelfMemberInfo
// 0x0064
struct FBP_STRUCT_SelfMemberInfo
{
	int                                                day_active_0_2D363F0026644DF8583587E5055C4B85;            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                position_2_6B32D60074AD493478BF022C0550893E;              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                week_active_3_14AA5A801FB5B5104E46B237070437D5;           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                svr_4_19EBEF802539ED1077A886D00D0279E2;                   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FBP_STRUCT_BASE_INFO                        BP_STRUCT_BASE_INFO_5_0DDF4F802415ACB41D1EAB010A627FFF;   // 0x0010(0x0040) (Edit, BlueprintVisible)
	int                                                id_6_2DB08C0050CFBD166B0F18A703D026C4;                    // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                online_state_7_5A6F3A003E3FD12A1BB1D8970E13A8C5;          // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                season_active_8_0F2691C00AFFDF974C4BED4A0FFF1895;         // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                corps_war_week_feat_num_10_4D729B002162B314312BED2A0D38C46D;// 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                corps_war_season_feat_num_11_618BD240384741772389BCEF05DC72CD;// 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

