#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_TeamUPRecruitSpawnPlayer.BP_STRUCT_TeamUPRecruitSpawnPlayer
// 0x006C
struct FBP_STRUCT_TeamUPRecruitSpawnPlayer
{
	int                                                weaponSkinId_0_04CAB0400E700ED5713E922E02047754;          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                star_1_18F8ABC035B2654D011EB06002C21492;                  // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                weaponId_3_1E390B00785895765E7C7EC10595A094;              // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_4_3F20C5800C516A0C0111AACC02C4FA25;                  // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                index_5_579103401CB4EEAD4362E8AF0C35ABE8;                 // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                rank_6_531E2840094A7387011EFB6802C23A5B;                  // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     gid_7_0ACE8A404E20D5BD45993B25012C3614;                   // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                areaId_8_1C3AEEC026149AB111B60EC00336A734;                // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     iconUrl_9_013274406A313D47025AFBFA048510BC;               // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             BP_ARRAY_tags_10_5CDADCC07A18D5494C3278690A34EC93;        // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                recommend_11_448BEBC03EA36C577EBE7BB709901914;            // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                headId_12_35CACD001D5EE08C79E9A31603556A34;               // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sex_13_07F8114003F773694599095F012C2228;                  // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        BP_ARRAY_AvatarList_15_3A134FC01061C935626052EF00B8F754;  // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                status_16_2794064007EDF68914A2EE9502149903;               // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               isInvited_17_5E5429002979610E1F507D450F714124;            // 0x0064(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0065(0x0003) MISSED OFFSET
	int                                                frame_18_18FBC0006144BBEE43F62C470C366715;                // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

