#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsSummary_Data.BP_STRUCT_CorpsSummary_Data
// 0x0064
struct FBP_STRUCT_CorpsSummary_Data
{
	struct FString                                     name_0_AFBC6EEE4B2099A91091489D78C78B89;                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     city_1_F7F92E2240E0EBA60AA8C9999D7CC963;                  // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     announcement_2_DE7195C24FD843B5677A4DA8019D6A2A;          // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     str_corps_id_3_1296C91345D478F86EF08ABA2A1D5874;          // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                join_segment_4_0B251E134D5DDC310BC4F1B54E5967C2;          // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_5_C78D380147CD9704E5D86A88A9A226B9;                 // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                member_max_6_482D9964446A6446564AF9885889DE3D;            // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                join_level_7_2EFE15904B21FC2A85788E996C95D4E8;            // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                member_num_8_8986EFC545903CCE8E39A2AD2AD5F280;            // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                activeness_9_4FAA8BCE41E7C430BD102CAE79C7F319;            // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                icon_10_0AE8E59B48130B2069DA8DB73CA75F2A;                 // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segment_id_11_5BB5F8802C058B0E46D275430BF293D4;           // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                season_feat_num_13_09417E80616144C679EB3D670FA9111D;      // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                season_defeat_corps_num_14_0BA6124054B4C61D1274518103A7D23D;// 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                season_win_sum_15_79464B404B950F211618CB8E0BC27FCD;       // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                season_game_num_16_15699D0038D7903620A25ABC041C110D;      // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                season_kill_num_17_32BB41804D5967D8590DA6760C1110CD;      // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

