#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SeasonRankInfo.BP_STRUCT_SeasonRankInfo
// 0x0050
struct FBP_STRUCT_SeasonRankInfo
{
	struct FString                                     city_0_02E04BC02A4E29CD3A1D88A00634F409;                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     name_1_1E7F05C063CE30F73D86DB0306353485;                  // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                level_2_2B348380288220C648048B10035587DC;                 // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segment_3_60677A401436D38906DEDB8E0EF75904;               // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     url_4_7E6752404D6D4B4151BE57AC0B635BCC;                   // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     uid_5_57336E004073602251BE589F0B635CB4;                   // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                startup_type_6_3AC74A8003F496063809ABC109989FE5;          // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                qq_vip_7_148A8180209206A2130309CF05F3DB30;                // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_avatar_box_id_8_21C55C8064369F1A152002A40E1400A4;     // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gender_10_62F71AC02732F27D7B752C3204B0FCF2;               // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                pass_type_16_1EDDB38056F3594E05AF43EF01F5F1A5;            // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                pass_level_17_64FC09004ACB0EE0536C3A030F77D0AC;           // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

