#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ComeBack_NotifyFriendData.BP_STRUCT_ComeBack_NotifyFriendData
// 0x0030
struct FBP_STRUCT_ComeBack_NotifyFriendData
{
	struct FString                                     iconUrl_0_20B75C000A02886A4A11846805B607FC;               // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     uid_1_70ED7580183A6B9617DFEB7C003B61C4;                   // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                frameLevel_2_619B85C00F3DE5534CEA90520035B73C;            // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                playerLevel_3_0ACE46400F2717915AC99C5E071FD47C;           // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gender_4_07ADE24028135763029E9AAD07794972;                // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_5_2CAD4D40430A2BEF3628307103B8E535;                  // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

