#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsSeasonRecord.BP_STRUCT_CorpsSeasonRecord
// 0x0064
struct FBP_STRUCT_CorpsSeasonRecord
{
	int                                                corps_win_0_79DCE6004FE188524906891E0026A4CE;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                corps_kill_1_0154BD80412701701A3B016E026A8D2C;            // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                corps_feats_2_0632D7407651E47D7405D97006958893;           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     best_member1_3_7B1C1E80128415904A8CBCCD0F3AB1C1;          // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                corps_segment_4_57AB6F4079FE283308272442008E1EF4;         // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                corps_defeat_corps_5_73120E4035DA3A051C85087D0162A093;    // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                member_defeat_corps_6_0D5C02801A42251C638464860F097343;   // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                member_game_7_4CD50D4042D107C52578556101B72EE5;           // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                member_kill_8_538FB1C05F901E871A8A113D01B8E6FC;           // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     corps_rank_17_5F3FDD80235ACB241A2F205A026A154B;           // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                new_base_rank_10_2D6DE4C06C8A09ED23BCC7BF0C40831B;        // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                member_win_11_43DDFA405C7AA549457433500D1B425E;           // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                corps_game_12_7A9A19007A1AD45C1A3B0EF202694535;           // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                member_feats_rank_13_60862E403CE5868B0E5DE7E70A41B71B;    // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                member_feats_14_21B7AB805D24C65E4D3FA3520B7315A3;         // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     best_member3_15_7B1E1F00128415924A8CBCCF0F3AB1C3;         // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     best_member2_16_7B1D1EC0128415914A8CBCCE0F3AB1C2;         // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

