#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Shop_GiftRecv.BP_STRUCT_Shop_GiftRecv
// 0x0090
struct FBP_STRUCT_Shop_GiftRecv
{
	struct FString                                     uid_25_615D72804949FCBC56F3E90506B54AB4;                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               isFetched_2_550C65C01507A81365918C890A7FFF84;             // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	int                                                avatarBox_4_4B8D4C0050BEB85E2705F3530E1D32E8;             // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     iconUrl_5_63ED59004C1104B01C7191490EE489DC;               // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                gender_6_4F525F4073F6D1F96D402D4005D02192;                // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_8_6AEECA40117EAA0922CBD9E10B565455;                  // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                intimacy_9_2DD6798054DABF0648402AE901C56259;              // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     date_10_77B2A98011F8AE0822C292EB0B55BCC5;                 // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     message_11_6B549B401F56E0277F1D4CA2028C22B5;              // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                read_13_0408C9005C1EE6D422ED03020B549F14;                 // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                index_14_5328A800441D5F98268BD8DA055F0C78;                // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                style_15_04104E40101D760B23097652054BFA95;                // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               inited_18_21FE81400B2776557C6F479C05F161E4;               // 0x0058(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0059(0x0003) MISSED OFFSET
	struct FString                                     notice_19_6176C280337C366A5D427DD90662C4C5;               // 0x005C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                shopid_20_378383C01E994C9B4A140ABF048B0DA4;               // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     give_type_21_1346B5006BC5A5006FB8B9230A23FD25;            // 0x006C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                item_22_4476EDC0105683F122DC07460B561EDD;                 // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_23_730A08007DF178A62343BB5405638A0C;                // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                relation_24_5CD0398051DBBD78312E3DF70043FCFE;             // 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     nickName_26_4C75CB8030187C3E7EC5DAD60BF51265;             // 0x0084(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

