#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:52 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SevenDaysFun_type.BP_STRUCT_SevenDaysFun_type
// 0x0040
struct FBP_STRUCT_SevenDaysFun_type
{
	int                                                TabID_0_08607D4042B9C26D495EE24B01352304;                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FinishProgress_1_39BE81C04C426479621C57C0047303E3;        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     TaskCategoryDesc_2_2F4088406BCF305B4D372EC204165AB3;      // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                UnlockDays_3_0F3BD3805B6948A4202FC2E1088CFB83;            // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_4_5C3677803E9EE0B4355F2C5E055D1224;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TotalProgressPercent_6_340A9EC0225DBCC96267017500DB5624;  // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TaskCategory_7_437F488046C0C3E41636DDFF0BF62419;          // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     TabTitle_8_59D41A80382436825ADF8BD102281A75;              // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                DropID_9_62DE3CC077B15719369E390D024E39C4;                // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     JumpURL_10_5632D8004DB7E2F270FD8C7E0EF18B5C;              // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

