#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_FPPCombatSurviveInfo.BP_STRUCT_FPPCombatSurviveInfo
// 0x0060
struct FBP_STRUCT_FPPCombatSurviveInfo
{
	struct FString                                     role_maxdistance_0_2C3A94C00A3D8C4D77EFA4260731BC75;      // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_avesurvivetime_1_267D704070EFD1192C21678D09611FE5;   // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_aveheal_2_3A3486007B4B35285E121B84009D9CFC;          // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_winrate_3_3E068F002EB95AB41E3182C905B3FF15;          // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_aidcount_4_43CA86406B4277E15C21BF340ACF14A4;         // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_avedistance_5_6A2EF24040C70F9345128A83072AF975;      // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_toptenrate_6_287B620063F9E300698011F30DDEBBB5;       // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_maxsurvivetime_7_686D52C051C26A43782C6A620D5120B5;   // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

