#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:52 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_TaskActive_type.BP_STRUCT_TaskActive_type
// 0x003C
struct FBP_STRUCT_TaskActive_type
{
	int                                                DropID_0_775168D84C60002040EB79AFC8FBFBD1;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Cond_1_A1D5CF774529C4E2FCD8CAB7F47BBDE0;                  // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_2_1BACE17942857BA88A9B5780E9CE8691;                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     IconGot_3_81D8940F40B5757123C480AC22C584E1;               // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     IconCheck_4_2114CA504E580587D6C6F4BF8D32E83D;             // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     IconGet_5_773534E6493186E142A4B3AA86B89192;               // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BoxTitleName_6_519C0C704027BD4A1F1D3BB9F81B674B;          // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

