#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_TeamUpRecommendMapInfo.BP_STRUCT_TeamUpRecommendMapInfo
// 0x008C
struct FBP_STRUCT_TeamUpRecommendMapInfo
{
	int                                                map_id_0_5C325BC029AE29AD3CBCC54A0DD77754;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                model_sub_name_type_1_4DEC78000A944A4C3DF5444F0796C8B5;   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     icon_path_2_667F6E803D01E0CA0F4DF5E6072CA9D8;             // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     level_limit_3_6F1E26C0785598B162E16DFF0C9EDDA4;           // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     recommend_buff_tips_4_76EC78007F5C7D90403FF68102C58323;   // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               is_selected_5_557082403809F8AF41DA0E6302F52F04;           // 0x002C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	struct FString                                     forbid_tips_6_6E81A68073C2C156356490AD05654BD3;           // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     model_sub_name_7_27958FC027F9F76B74E4723202008D75;        // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     map_name_8_369C10C012B4A87B17DE87870778EBE5;              // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     recommend_tips_9_6F24D780722173A6459C7363003E1E93;        // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     time_limit_str_10_29139A804EAA0CA2548AFFB503046572;       // 0x0060(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               can_select_11_61766580165BD0F658D5F703043852B4;           // 0x006C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x006D(0x0003) MISSED OFFSET
	struct FString                                     sub_info_12_71E716807CC05C1E7ABEBF800457698F;             // 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     tips_13_39E93140626BBEFD50AB078802AD5F43;                 // 0x007C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                size_type_14_3EF998405626441D4E505CFE039C7965;            // 0x0088(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

