#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CombatBattleInfo.BP_STRUCT_CombatBattleInfo
// 0x003C
struct FBP_STRUCT_CombatBattleInfo
{
	struct FString                                     role_maxkill_2_58CE666D4673E6D7265F1A864AD05E3E;          // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_maxdamage_3_60A3553A4B1764EAF61B3BAE9DB24FE1;        // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_avedamage_4_E85C6DBA482F06B1BECE69BF6F5778C8;        // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_critcount_7_88CD072C4630F97CA8E23DB857109F80;        // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_hitrate_8_03BBCD074A87A51BF24FE9A79728243F;          // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

