#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RankCountryStrongerInfo.BP_STRUCT_RankCountryStrongerInfo
// 0x0059
struct FBP_STRUCT_RankCountryStrongerInfo
{
	int                                                no_0_36B9AC8013ED3C9274D0A7A807118B2F;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     url_1_5FD36A0077DC07CA239865E50118BAFC;                   // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                cur_avatar_box_id_2_72A334402D9986077CC886CF05F2DAB4;     // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     locationName_3_0B53CBC023CB4429547020400511CF15;          // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     name_4_3BDB3D80307C82E45F8EB13C018B2125;                  // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                level_5_4E70DB4054E7219957588E5008B4BDAC;                 // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     uid_6_389F85C01932D311239864C60118BD84;                   // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                gender_7_5E0392807C56D9065864B9610ABD5B42;                // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               showWarZone_8_6900B7004C5EBE6C6E7304020539B395;           // 0x0040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0041(0x0003) MISSED OFFSET
	struct FString                                     corpsName_9_06C87F404E43FDE75C315D6D0870F825;             // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                corpsIcon_11_3ADDA14028A91D455C6A1640086F4A4E;            // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                corpsId_12_5FDD4A40101065C12E2F4E5700186F44;              // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               showCorpsWarZone_13_064EB8C03383734B10D640F607AB79B5;     // 0x0058(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

