#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsBattleOpenBoxTipsRoleInfo.BP_STRUCT_CorpsBattleOpenBoxTipsRoleInfo
// 0x003D
struct FBP_STRUCT_CorpsBattleOpenBoxTipsRoleInfo
{
	int                                                cur_avatar_box_id_0_6861F3401F9A4B031910C2F2007BFDF4;     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_2_3D837C801D6FD72E79190E870DD3B3A5;                  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     uid_3_083744C004C7D4017A22B04009DD34A4;                   // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               is_friend_4_5DA681001E55D418420160390C05C5A4;             // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	int                                                honor_5_31F69DC00123A99944456E2D0D221EB2;                 // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gender_6_630CD1804EAA9EAE61BA6EB8022FD712;                // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                kill_7_7395BF403071C9A7791B5D8A0DD3EBBC;                  // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_8_01E99A40401978BF3B1725DC0D3D956C;                 // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     url_9_2F6B290039DE48A07A22657009DD33DC;                   // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               is_self_10_56E88D804A2545666A9E50E10FEF4716;              // 0x003C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

