#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:46 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Lobby_Friend_Search_Data.BP_STRUCT_Lobby_Friend_Search_Data
// 0x00F8
struct FBP_STRUCT_Lobby_Friend_Search_Data
{
	int                                                expertArea_2_0_0261016949A29F80A06AB38FC4F66816;          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cityId_1_71179DB940AD6A6CFF078395F04E76DE;                // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                tendency_2_8B9CECCA4DFB784DF44D249374D88ABD;              // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                expertArea_1_3_5E4EA9EF41CC7455EE56AA99E71C72C8;          // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FBP_STRUCT_Lobby_Friend_Common_Data         BP_STRUCT_Lobby_Friend_Common_Data_4_B94F1D3C45A92646FA2171B4D02DE6AD;// 0x0010(0x00E0) (Edit, BlueprintVisible)
	int                                                playDate_5_32654876410DF78AA64504B6C035E352;              // 0x00F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                playTime_6_1EF7CC784FFB86CB125B0D88DAA02946;              // 0x00F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

