#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WeaponSkinInfo.BP_STRUCT_WeaponSkinInfo
// 0x0070
struct FBP_STRUCT_WeaponSkinInfo
{
	int                                                SkinID_0_67F4288014ADD112301F5A240F355174;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               HasOwner_1_6DC2E9C067ABAF35604C7ED30CD58A92;              // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	int                                                WeaponType_2_1EDC23003ED0BBA6335FDCF5070CEF55;            // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ShortHandType_3_464C8B401491A0312BDDEB4706F42275;         // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               HasEquip_4_1CB0E8005DDDF57405DCF26F0CCF2650;              // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	int                                                WeaponID_5_736FFDC050DD81FF19F7A4BA0F370DB4;              // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SkinDesc_6_379125006F3CBBA832478D8A055103A3;              // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SkinUrl_7_4BDD520050FCB7803FED241B0355067C;               // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IsSelect_8_6761270025BA2D0438CE3C0E0C298414;              // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsRedPoint_9_13E438401E7AD83973374F0E083AE464;            // 0x0034(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0035(0x0003) MISSED OFFSET
	int                                                ShopingID_10_65A4F940738A5F0508B6A0FA0D56B964;            // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsOpen_11_0F28338061D21F8E44EFBA4F0FB4D51E;               // 0x003C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
	int                                                Price_12_69611CC073DC37111D146E470AFCC4A5;                // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Quality_13_24E11A40470AD5654BAC56F303FD2A49;              // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     leftTime_14_17866E807D803C482CB3C7A30F6A03A5;             // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                MoneyType_15_7E0DEA806DAB49C0074D92AA0FF45945;            // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SkinName_16_717125806E0E230E324C15D20552E905;             // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SkinBuyDesc_17_576271007C4EDD4C1BE72A4A033EF983;          // 0x0064(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

