#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsLobby_PlayerData.BP_STRUCT_CorpsLobby_PlayerData
// 0x0024
struct FBP_STRUCT_CorpsLobby_PlayerData
{
	int                                                sex_0_747DC28074238E6E694925D00EF431B8;                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                headId_1_44729E406158EE710EA9852C026C97B4;                // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                weaponId_2_1A879C403452D4112B1D55010C6A21A4;              // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        BP_ARRAY_AvatarList_3_67CF01001A5CB5184371F7A203694F44;   // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     gid_4_77543B80498AD1AA6B692A500EF42584;                   // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

