#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ShareHonorWall_ShareInfo.BP_STRUCT_ShareHonorWall_ShareInfo
// 0x002C
struct FBP_STRUCT_ShareHonorWall_ShareInfo
{
	int                                                share_honor_gold_2_FA0CE3014E42D2FBA878D084D2FFAA19;      // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                share_honor_total_3_AF8611C94DD64D28C3BFEA97F6A8A444;     // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                share_honor_silver_4_AF188D8E47811BA2DBE569A7A181259D;    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                share_honor_owned_5_59BDBD8A48A30ED1BC347E949502BBE8;     // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                share_honor_copper_7_6117A6E945CD2C3C90D580816E420D87;    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     share_title_9_84BF144944C294EDE573BCB4ED9B2991;           // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             BP_ARRAY_share_title_tags_10_DF17211D427D8E6901E728B0A3362570;// 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

