#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CurSeasonTaskProgressAward.BP_STRUCT_CurSeasonTaskProgressAward
// 0x0034
struct FBP_STRUCT_CurSeasonTaskProgressAward
{
	int                                                item_num_0_2CCE8F4027DA39350335B123041EC6BD;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                status_1_488C80C06233B83708E7176203A43423;                // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_time_3_4EA2C70023166CC204FF890701E8A075;             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id_4_5FB20E8029D6D15C615088690041EBC4;               // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                id_6_52F14B000510A6326CC9D79F0EBFE2F4;                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                progress_7_24B91500753DF4364DF7BCAB07E16FD3;              // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                max_progress_8_5D6DDE405F2314A74505DD660C68F533;          // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     title_9_26004040260D2F7F62CE01960E3BE2D5;                 // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     task_type_10_32E1CCC02C43878349A325F804089A05;            // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

