#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_MyCorpsPrestigeRankInfo.BP_STRUCT_MyCorpsPrestigeRankInfo
// 0x002C
struct FBP_STRUCT_MyCorpsPrestigeRankInfo
{
	int                                                corps_id_0_0C787C0031A5562C712733290A761624;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                members_cnt_1_3ABFCB00077FE72870DCBFFC04DFD5C4;           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                score_2_7FB08E4046AE51833463BBB0082C6895;                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_3_147E8F80301323B84A47AF9C01841CD5;                  // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                level_4_668B2D407D31EACD31E9EA64084702AC;                 // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                max_cnt_5_2EAFA1C06F541FB96E89EF6606444214;               // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                icon_6_4893B1803D4655504A420E8E0183A6BE;                  // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_select_7_1564B600159C30F82F07CCA308846EF4;             // 0x0024(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
	int                                                seg_8_5609D70065DE266E43C5362E0E182C77;                   // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

