#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsBattleOpenBoxTips_PlayerData.BP_STRUCT_CorpsBattleOpenBoxTips_PlayerData
// 0x0030
struct FBP_STRUCT_CorpsBattleOpenBoxTips_PlayerData
{
	struct FString                                     gid_0_1D2DCB40713D8B3D6A5B6AAA0C4178A4;                   // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                sex_1_1A57524043839F816A5B7BC10C416C98;                   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        BP_ARRAY_FeatureList_2_191E2C001EF9A76840D65E7D0C490B44;  // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                weapon_3_2BB680C008521C3545C66C5E068E434E;                // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                headid_4_10D4960007A9D74C597D860307BEBEE4;                // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        BP_ARRAY_AvatarList_5_116A90C045D1320B3A94A2660F8B9A14;   // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

