#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsTrainRankTabInfo.BP_STRUCT_CorpsTrainRankTabInfo
// 0x0018
struct FBP_STRUCT_CorpsTrainRankTabInfo
{
	int                                                week_day_0_12E9BC3F4B8228CD88A733A702983E0C;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                train_id_1_06344E3E44023C0A4C866F87A43900B5;              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               isToday_2_B6541751441B3ACFDDFBF8B5C7F2CE05;               // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	struct FString                                     tab_name_3_199AC2BE4495AD2699299791D045C9B6;              // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

