#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:47 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_MasterTaskCondition.BP_STRUCT_MasterTaskCondition
// 0x0024
struct FBP_STRUCT_MasterTaskCondition
{
	struct FString                                     TaskNodeCondition_0_DE27AC9B4332D7CF486A599D80BC2B16;     // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                TaskNodeNum_1_2FFE7E924CC91FAC08BA0CB2DFB49CB0;           // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TaskProgressNum_2_6CCFC22D4790031444FCC584AE1085B3;       // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ConditionStatus_3_F8A96BDE4C3FCA9307F343994978AD45;       // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ConditionJump_6_04CFB7807464EF2823CC6A500B133E00;         // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

