#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ComplaintFeedback_OneNotice.BP_STRUCT_ComplaintFeedback_OneNotice
// 0x002C
struct FBP_STRUCT_ComplaintFeedback_OneNotice
{
	int                                                template_id_0_40CB830038357BAA78FF7AC3065F0FD4;           // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                id_1_1DEEF4400FEC496515A39FC00FE74C14;                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     report_time_2_05036B80454C506C3B9E99390D509725;           // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     result_3_214CE8C0572E7DB37777E8D10D634D74;                // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     dst_player_4_49A36EC05B3685B77F33333B013EDA42;            // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

