#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CreateRole_SelectTip.BP_STRUCT_CreateRole_SelectTip
// 0x0025
struct FBP_STRUCT_CreateRole_SelectTip
{
	int                                                avatar_price_7_F6C6AA89495286C20BFF94973BCF3E1D;          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               has_item_8_8BF9B9F841DB32C4EBAF74A6FE901DE9;              // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	struct FString                                     avatar_name_10_945810BC42AE1A35BA9DE5BCF7261304;          // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     remain_time_str_12_C37ED8434AB3DAE15D1D38B6BA4CEAA4;      // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                avatar_id_13_84AC56154D9817C5BA38AF92E278B2E9;            // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               show_price_14_66AEC9B047604770EB6D7FB9EA2265C8;           // 0x0024(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

