#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsPrestigeRank_PlayerData.BP_STRUCT_CorpsPrestigeRank_PlayerData
// 0x0030
struct FBP_STRUCT_CorpsPrestigeRank_PlayerData
{
	int                                                sex_0_618D38406C2C39BF792C2ABA0B921A08;                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        BP_ARRAY_FeatureList_1_5A9112006703C3547F8A299D093BDC34;  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     gid_2_6463B1405C166093795EAE240B920E34;                   // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<int>                                        BP_ARRAY_AvatarList_3_437076C044D9AAAB636636F208DE6964;   // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                weapon_4_65B366C012E95C015D5949EE01E7407E;                // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                headid_5_4AD17C00367F5F1676D6AA7700D7C3D4;                // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

