#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_MatchLabelTable_type.BP_STRUCT_MatchLabelTable_type
// 0x0040
struct FBP_STRUCT_MatchLabelTable_type
{
	struct FString                                     LabelIconPath_0_3B81904035FB299F3E8307B40C22D858;         // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_1_073836006465B7825C532B720390FFD4;                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Description_2_6229F3C02552925F06F735E908FD60FE;           // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ImagePath_3_05F2AEC00E5B8AF3678D236C0ECA68A8;             // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Title_4_21CAB3406C4F063F37A51E5E0FEB3425;                 // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     IngameLabelIconPath_5_298624806BD7A2F4733426190C6FBBF8;   // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

