#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WarZoneTitle.BP_STRUCT_WarZoneTitle
// 0x004C
struct FBP_STRUCT_WarZoneTitle
{
	int                                                rank_no_0_5376894058B4FE593F35EEE80AE3F5DF;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                warzone_id_1_086F7BC03EB8FB712A0769BA0F5D66F4;            // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                rank_id_2_6853254045578BC33F35E86F0AE3F464;               // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                tab_id_3_03D528007387F5F01183322C098D2BE4;                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     rank_name_4_2F835A4025C7AF8523F8EA7803F5DED5;             // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     state_5_7921978061E0B6467D7CDD3401980E45;                 // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     pedal_path_6_5DCDB3C06648DDB55EC251690A1F2968;            // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_path_7_293F5C807BA1D4400932D07A04E7E5E8;             // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     desc_8_1B6DB700670DCE366A9452E70E1886F3;                  // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

