#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_FPPCombatGradeInfo.BP_STRUCT_FPPCombatGradeInfo
// 0x0054
struct FBP_STRUCT_FPPCombatGradeInfo
{
	struct FString                                     grade_0_283508C077157D5F299C54480C696535;                 // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     survive_score_1_66884BC06A31C123103A682108430A35;         // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     top1_score_2_5EEC47C06D61307F352FD38F00AE8EA5;            // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     sum_score_3_04FA5C00235DE1444912772301F5FBE5;             // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     assist_score_4_0170AC8031D5E13A16E992A7009D6FF5;          // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     fight_score_5_5F5C0B407CA24C195B689A97060299E5;           // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     rating_score_6_2436C8002A9D8F0E717F6D890C9F2105;          // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

