#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:51 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsRankLevel_type.BP_STRUCT_CorpsRankLevel_type
// 0x0028
struct FBP_STRUCT_CorpsRankLevel_type
{
	int                                                TypeID_0_6DF914002760CFC41E82A75D0451C094;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Order_1_4EEBA7401C0BE6F74948B01304699052;                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Name_2_290D688038462F840E5A31A30946B795;                  // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_3_61B36B806BA0D76C3E62C97F01A94524;                    // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RankType_4_4942F3C056FD10C52FF30F9B07FA0415;              // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     TypeName_5_64DA9100605187EC202F248301C10465;              // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

