#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SeasonReview_Page_Rank.BP_STRUCT_SeasonReview_Page_Rank
// 0x001D
struct FBP_STRUCT_SeasonReview_Page_Rank
{
	int                                                subTabType_0_1ED4C680001DA4B277E3193B032B2F75;            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                tabType_1_752F3C001888C2587B239AEC0A3135A5;               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     taotalRankRefer_5_766AC70049562FF411EA6270053B6E82;       // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                totalRank_3_226991C07CC0542D5EEF5B0C0CF44D6B;             // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                totalRating_4_443988001FC37D5C389294FC044384B7;           // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               showRankNumber_6_32EDF34055C5308714E23ED0055FE412;        // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

