#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_OnceInviteProfileInfo.BP_STRUCT_OnceInviteProfileInfo
// 0x0050
struct FBP_STRUCT_OnceInviteProfileInfo
{
	struct FString                                     nickName_0_09A8DB00304F450432AF664A01A84EB5;              // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     platName_1_44259E00665BBFD65060DC180CB15085;              // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ladder_2_33AA8C801E0B47E035E611CB0AE992C2;                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_selected_3_45A9B2800ED62BA26892AD930C87DFA4;           // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	int                                                cur_max_segment_level_4_544F9F803A788678241BCD03061DE4AC; // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     uid_5_467F4200673BD0D66D11E66F03808714;                   // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                starLevel_6_402B3E0032A038647064F5C90BF24AFC;             // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_7_2E2C578051D143FC10140BEF00AE2F3C;                 // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sex_8_564E4580340060586D11059E03808528;                   // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_avatar_box_id_9_7EC530803BE73BAA7C7414F30DE86844;     // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     picUrl_10_48898D403E143A5F1279AABE08A1B48C;               // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                vipLevel_11_23ED63401C4977516B5B957B0E8AC4AC;             // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

