#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ShortHand_Menu.BP_STRUCT_ShortHand_Menu
// 0x0018
struct FBP_STRUCT_ShortHand_Menu
{
	int                                                IsSelect_0_176B24007B2088980B90524A0D371CF4;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ShortHandType_1_32EE08403C6F8C1D3CFC9D6B0C860BF5;         // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               RedPoint_2_21D3264077BB6DBD5144C9F90E3C6984;              // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	struct FString                                     SkinIconUrl_3_553151403510327D51055FC30CF97A7C;           // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

