#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_HomePageCorpsInfo.BP_STRUCT_HomePageCorpsInfo
// 0x0020
struct FBP_STRUCT_HomePageCorpsInfo
{
	int                                                icon_0_8145C08B41C8FFCF51457C9281A0E618;                  // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_8_9629D5B843C5E7A84CD5B186CF5BA3E1;                  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                level_9_AE4D89B4410A7376C66C9B8166E2C62F;                 // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                exp_12_BA45D404422E14AF0DE6D8A253D977E9;                  // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segment_level_21_3DEE9E003741E29A38F1E64203DF062C;        // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                warzone_id_22_4A72B00071E35850782D8D0900886F54;           // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

