#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:47 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_NearByProfile.BP_STRUCT_NearByProfile
// 0x00A8
struct FBP_STRUCT_NearByProfile
{
	int                                                currentTeamAmount_1_42D501404DC121654604247B08644854;     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     gid_5_665AAEC03C650AE931B0974609037EB4;                   // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     nickName_14_093A2B4039FA0C3F5C652D840B108045;             // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                online_19_3407630077DCAB0C06897E4C0871C075;               // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     remarks_name_20_224E7F003AAD1B5E4ACBD8E90456F0F5;         // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     timeSinceGameBeginStr_21_4AC430004A30CE4436F8995A08A2AE62;// 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                distance_22_78CC5480175AC53E3769B572043A5335;             // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                maxTeamAmount_28_08EE12003832CB480E65B4FC01C8C354;        // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                intimacy_29_6A9AD9405EBC4F073183898801400079;             // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                vipLevel_33_237EB3806CFB270C6077660D04E2FBBC;             // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     gameModeStr_35_62E5D7C07C2BADD10251A8200124E012;          // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                history_max_segment_level_36_4D6F01C04AE9C5C34140F6C202DCCF6C;// 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                timeSinceGameBegin_39_2614C1C028000DF71817FEA6094D8A1E;   // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_avatar_box_id_41_4B5160C0568DAFDD147111830E4802C4;    // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_max_segment_level_42_22EB4FC077654C3B1C7D07F5009C037C;// 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                teamState_44_2177EBC07373311F15E360650F29C155;            // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               isFriend_46_0BE06EC00CD0FE597E179BE40348C474;             // 0x0068(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0069(0x0003) MISSED OFFSET
	int                                                level_52_7A8A07C0729935BF712664D8038185BC;                // 0x006C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sex_55_638435C062F3D2AD31B382BE09036A88;                  // 0x0070(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     platName_56_43B6EE4048CF0A915F4AE5BC06197255;             // 0x0074(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                lastOnlineTime_57_7ECE2BC013D7E4837C33E89E0473D305;       // 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     picUrl_60_00931D800B98A14C4F667408065B1CBC;               // 0x0084(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                game_mode_64_1FD1894028EB8FC7075C409A0AB75BE5;            // 0x0090(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                enableWatch_65_2D6339402E5B71E937D19DE901D48408;          // 0x0094(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                watchUid_66_492670001564927834CE7B620C39ED14;             // 0x0098(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gameSubMode_67_171B94001AF30D4E7DE4B8B009C98F05;          // 0x009C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               isLuckyFriend_68_567910C06CF96CE70E5E7E870E9241E4;        // 0x00A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x00A1(0x0003) MISSED OFFSET
	int                                                ownerID_69_59EA4FC06158E6C744686C0A05ADC554;              // 0x00A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

