#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsManager_PanelInfo.BP_STRUCT_CorpsManager_PanelInfo
// 0x000C
struct FBP_STRUCT_CorpsManager_PanelInfo
{
	bool                                               isAcceptApply_6_8B37B3F741FBE3844F5709AD5AC9913B;         // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               isNeedApproval_7_C4395732449575DAA9AB5EA587D54EF7;        // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	int                                                joinLevel_2_9173843D42569766DD5E93899F731966;             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                joinSegment_3_593036E7453DDB5555B848A4ED2930AB;           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

