#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:42 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_TeammateLikeInfo.BP_STRUCT_TeammateLikeInfo
// 0x0015
struct FBP_STRUCT_TeammateLikeInfo
{
	struct FString                                     uid_0_06F9DD8054B1EE9415879D230651B684;                   // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               like_eachother_1_087EDAC01F03EF613EFCDF4A0076EE42;        // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	int                                                like_num_2_6895E2005328B2FE28F6615E09805E4D;              // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               liked_me_3_0722BB800AF51E2028FC5648097E9FC5;              // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

