#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SeasonRank_PlayerData.BP_STRUCT_SeasonRank_PlayerData
// 0x0024
struct FBP_STRUCT_SeasonRank_PlayerData
{
	TArray<int>                                        BP_ARRAY_AvatarList_0_1C1B7E806BDF0F76271C38D50516F254;   // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                sex_1_2A3640006F0E4A4C21FAE481032927C8;                   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        BP_ARRAY_FeatureList_3_5EB439C0277753DD58B3607E05B28FE4;  // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                headid_4_52B2E3C02E1B033F518F1492030B4864;                // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                weapon_resid_5_7E6FCC00363DEB883CAC60E702537C24;          // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

