#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ShareHistoryRanking_ExploreInfo.BP_STRUCT_ShareHistoryRanking_ExploreInfo
// 0x0014
struct FBP_STRUCT_ShareHistoryRanking_ExploreInfo
{
	int                                                explore_score_0_54FD5A006D29BCB0136B016A0AB1E0C5;         // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sharp_claw_num_1_2BB7F0401653DD712C975EF40E154CBD;        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                carapace_num_2_2790F3407C5778DB49C0493D0BF1DCDD;          // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sharp_claw_score_3_5D9163405CC36C6B466EBB620500A895;      // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                carapace_score_4_258766404B818F71031B561601F10D75;        // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

