#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ShareHistoryResults_RadarInfo.BP_STRUCT_ShareHistoryResults_RadarInfo
// 0x0048
struct FBP_STRUCT_ShareHistoryResults_RadarInfo
{
	struct FString                                     supply_score_0_57625404449BEF342F1DA3A88933032C;          // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     hurt_score_1_63632E3F45B37C089536BF8FF1FA8B40;            // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     survive_score_2_D5E36B0447A94F001E0906B0B2421FC2;         // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     support_score_3_E1C0FB594B623F4CD2C2AB9B294DACC2;         // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     kill_score_4_C1061A184903DECF4250F4BC4E08FE41;            // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     occupy_score_5_5C9BABC0776A991357B8F842084192B5;          // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

