#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_OBPlayerData.BP_STRUCT_OBPlayerData
// 0x0030
struct FBP_STRUCT_OBPlayerData
{
	struct FString                                     name_0_78784380557F426E6471E7050C616575;                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                gender_1_67DA9880641E12DE37BF0E5B00F906A2;                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     icon_2_2C8D6580282F614C647E004B0C60DB1E;                  // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                frame_3_22743E0050F8FDAC0E2DABB5060FB4F5;                 // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_4_00EAE1400258B63F2C8F35E30610F87C;                 // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     uid_5_20DF8BC078DA11711769F9F804C619C4;                   // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

