#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RoomCreateSecondTypeInfo.BP_STRUCT_RoomCreateSecondTypeInfo
// 0x0044
struct FBP_STRUCT_RoomCreateSecondTypeInfo
{
	TArray<int>                                        BP_ARRAY_RoomCreateMultipleList_10_249E26002DDBE1E0178849190BF5AE14;// 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                sort_num_2_63D239C0681F3E637A6180810816A57D;              // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                default_value_3_53D1344065CFD5D116B6D46102384B95;         // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     type_key_4_100456805CB466EE012D27660EE7A169;              // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     type_name_6_35BE8C8008CF1702447B33070E7A4ED5;             // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               adjust_enable_7_087A3040482D425552C0ACF700FD7FB5;         // 0x002C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	struct FString                                     name_8_7BF384401DC8DD1D6D5460C30CC26AB5;                  // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                custom_num_9_0B0EAE80428FFAA032905BB807A4E79D;            // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                value_11_0C13C340710BD17931AB4C960C0EAB75;                // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

