#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Result_RADAR.BP_STRUCT_Result_RADAR
// 0x0050
struct FBP_STRUCT_Result_RADAR
{
	float                                              SurviveScore_f_0_0097DC802939B40A68CA59BD04FE87C6;        // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              HurtScore_f_1_2F476840610E31836DEFD7DD09905E76;           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SupportScore_s_2_52CC420058C4466242C03B650418E4C3;        // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              SupportScore_f_3_52BF3EC058C4465542C03B720418E4F6;        // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SupplyScore_f_4_3A9642C027E270F50F1E70990A5F6AB6;         // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     HurtScore_s_5_2F546B80610E31906DEFD7A809905E43;           // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     KillScore_s_6_7EEC25C0142FC6235228E9BE09CE78C3;           // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              KillScore_f_7_7EDF2280142FC6165228E9A309CE78F6;           // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SupplyScore_s_8_3AA3460027E271020F1E70940A5F6A83;         // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SurviveScore_s_9_00A4DFC02939B41768CA59A804FE87F3;        // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

