#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:51 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SeasonPassInfo_type.BP_STRUCT_SeasonPassInfo_type
// 0x0040
struct FBP_STRUCT_SeasonPassInfo_type
{
	int                                                SeasonID_0_4F918600467BD8E80F94DA600EC582E4;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_1_107D0BC043CE92F76E50B95E054D2174;                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BigImgPath_2_1CEF7780052570A60B528F7D031D4258;            // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SmallImgPath_3_07DD9140205299456CC30FC6007A3898;          // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                PassType_4_1A6576C05349AD53072462C20DE5A0A5;              // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                LobbyMeshBgIdx_5_49F3FD4006BD2FA166E9768B090DBEE8;        // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     CollectCharcterImgPath_7_0FDC8F806C0D6B864E1D78D2092D0C58;// 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CollectBtnImgPath_8_36DA0D8020D4F3CC674D7BE50780E678;     // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

