#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsManager_PanelData.BP_STRUCT_CorpsManager_PanelData
// 0x000C
struct FBP_STRUCT_CorpsManager_PanelData
{
	bool                                               isAcceptApply_6_3B816F05499F3D9B9FA008AA54EEB4E1;         // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               isNeedApproval_7_3F1F0EDB46F735F5E2D467B5476E050B;        // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	int                                                joinLevel_2_F7E5CDCF4962DAD5AF726A954A0084F6;             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                joinSegment_3_199102AA413668D2036CE1851E155C1F;           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

