#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ShareHistoryResults_TeammateInfo.BP_STRUCT_ShareHistoryResults_TeammateInfo
// 0x0060
struct FBP_STRUCT_ShareHistoryResults_TeammateInfo
{
	int                                                assist_num_0_7290347B4E1B139BC7CC4295B6EBF5FC;            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     uid_1_927954AE443AABA0BFB5FE9E379CBE11;                   // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                kill_2_950F87AD422E90186D58E5B52DA3195E;                  // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gender_3_910CAA8541D83C0D08003B89145A84C6;                // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_4_2F01287D44161B063E27EA94758BAEAE;                  // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               is_mvp_5_1E09E15041FB2BD28DDF68AD57DBAE64;                // 0x0024(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
	int                                                heal_amount_6_F68695DB486E26B407D9B29C7D3E5BB3;           // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     final_score_8_0E7133204C3D46A4EF6C7F8188941184;           // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                damage_amount_9_1D832F724EC2F216948EAE82CF41359C;         // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     survive_time_10_179AFEBB4BBE7273176A8A93AC675485;         // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<int>                                        BP_ARRAY_TitleIDList_11_893728ED4BDB4AAD33802C8000B39986; // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               is_myself_12_CBDF81224803BE3F4E80D9A3A17BBEDB;            // 0x0054(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
	int                                                liked_count_13_0B7DDD804AE3A446254BB33D0E76D914;          // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                occupy_point_14_0842E04001C0E049702750CF0DDBDD64;         // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

