#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:46 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_OBLobbySpawnPlayerData.BP_STRUCT_OBLobbySpawnPlayerData
// 0x002C
struct FBP_STRUCT_OBLobbySpawnPlayerData
{
	struct FString                                     gid_0_798BC88074EA3ED86EDE0A7006996D64;                   // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                weaponSkinId_1_52B3CE801BDB90E846488EE604531224;          // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                index_2_236801802856F0CA0A0DDDDF0970DC58;                 // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                headId_3_2986AB407500B9017D41D06D06E21164;                // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                weaponId_4_6C6EA9403D77EC790C08366D02F0D524;              // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        BP_ARRAY_AvatarList_5_209E8E004EE9470017BFBCF00BC16204;   // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                sex_6_76B54F802D504CC46EDE1D3B06997958;                   // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

