#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RoleInfoHistoryItem.BP_STRUCT_RoleInfoHistoryItem
// 0x0064
struct FBP_STRUCT_RoleInfoHistoryItem
{
	struct FString                                     battle_id_0_BAB16CA04FAF0AF37CB29691FFCF7F53;             // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     rating_1_FC2885A443B768AEB436EF9EF09BD3E1;                // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                rank_2_FBC02A2844C3AA084AF7ACB389423D22;                  // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     time_4_A5EC36DA4C11C12025D78F955A301A2B;                  // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     battle_type_5_8E4F69C241A968E63097F8A84C91D992;           // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     change_rating_6_B99EC66D4E63D0A094FB70AFA09E066C;         // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                segment_7_BC3A2CF44BCED11FE4E41F99E3DC55F2;               // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     final_level_10_94646C7646C6FAE43BA207B1646AA7F6;          // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     kill_9_EC73003B44C2B3048F209E920B929681;                  // 0x0050(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                title_id_12_123BE31B4B73FB554A31FB810D99B5CE;             // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               show_score_13_1A5FF40049621D6C1FDB3C2F06E40CC5;           // 0x0060(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_blackroom_14_5C87E2407B43DA892ED6943A0AA308FD;         // 0x0061(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_resource_win_15_3AC879000D15D43260223D150C8F3B3E;      // 0x0062(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_resource_battle_16_3949A4807BAE3A5A68D80EE800E473D5;   // 0x0063(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

