#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ChatBriefFriendData.BP_STRUCT_ChatBriefFriendData
// 0x00B4
struct FBP_STRUCT_ChatBriefFriendData
{
	int                                                lastOnlineTime_0_402EB5C0387548CF32BA17390795CE75;        // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                timeSinceGameBegin_1_07E14BC0003EF2A3242CB2E3083E6C0E;    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                teamId_2_2E3400C0248D5B876850472105EA17F4;                // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     gid_3_5CD238C040161F6549CE2C12076049E4;                   // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                sex_4_59FBBFC072C32CE949CF901E07605DD8;                   // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                currentTeamAmount_5_18C68B404B4B84791B301ACE0D751FF4;     // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     applyMsg_6_24AD5F007A78DC562D00D29C0625E057;              // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                vipLevel_7_7F3D3D8052B9E330561596F60144C92C;              // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                warzone_use_title_level_8_1DBAF640066A5C4B59D03604083D367C;// 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                op_9_4D2003805F6B077829B0959D01760520;                    // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     militaryRank_10_6791C98071DB624A28115CFD0DE1E2EB;         // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     warzone_use_title_image_path_11_02C334007772E3820A8C8BD001347478;// 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                online_12_2C8FED0051021678111DBD7805265A45;               // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     warzone_use_title_13_6042388071BAD6E655CAB21E0D7FFAC5;    // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                cur_avatar_box_id_14_2142EAC0758CB9A1631A46310D10BCA4;    // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     nickName_15_64F8B540167E1BC35512859F0EEA4335;             // 0x0064(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     warzone_use_title_petal_image_path_16_7EF411400892740170C62FBA011218D8;// 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                level_17_053791C0151D49F37B24C5630056DBDC;                // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                history_max_segment_level_18_48388BC044E0AE071BFB1E9407C6A45C;// 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                warzone_use_title_id_19_0F78E3800A65BA5A1452AA400FAC8204; // 0x0084(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_max_segment_level_20_3748D9C02DAFC2DF1BCE5DF60162CC5C;// 0x0088(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     picUrl_21_791BA78078E913380AB7BA02052EFA8C;               // 0x008C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ladder_22_643CA6C071BC1159783507E30566DCC2;               // 0x0098(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                teamState_23_729175C031119ED33CCD1289014AF605;            // 0x009C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     platName_24_1F7578405D14BB750B94884B03FF4305;             // 0x00A0(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                maxTeamAmount_25_48739C001C227C9C37719A5706FAA164;        // 0x00AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                holidayTitle_26_037926C01FE24A8B33805D6E0C605485;         // 0x00B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

