#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_InviteInfo.BP_STRUCT_InviteInfo
// 0x0040
struct FBP_STRUCT_InviteInfo
{
	int                                                maxTeamAmount_0_21402C40215A13A502FE7E87007ECE04;         // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_1_1CB6E44039941E8D157B09F300D36F05;                  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     iconUrl_2_45EE73006469E1400ED821FA0D1731AC;               // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                currentTeamAmount_3_1AE29B807804F972635B448306139A54;     // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                teamState_4_230E86000DCF93703EEE4DFD05279085;             // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                online_5_77795D40209CBD4138A2F7A8038E2095;                // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     uid_6_50128C801E5C6088552D5DB4030D3964;                   // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                gender_7_3AC079400A2C00172800881502F37A12;                // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                frameLevel_8_1FC01CC0760686CF33440E8503503DEC;            // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                playerLevel_9_52175D4004E1C6EB067FD4810167774C;           // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

