#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_EXCITINGTOUR_GRIDInfo.BP_STRUCT_EXCITINGTOUR_GRIDInfo
// 0x0011
struct FBP_STRUCT_EXCITINGTOUR_GRIDInfo
{
	int                                                GridIndex_0_573CCA40799F111D1DF7320E09C990B8;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MapId_1_001E3D800076198A0FAB081B07E772B4;                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GridPos_2_23AC58C0499009517C88F3420A79D2B3;               // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                EventId_3_4FBC56807597CCF04D00E96D083E1F24;               // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               OnBefore_4_5957CEC07AC97F8F51F27CA90DEFC8A5;              // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

