#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:42 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ActivityBtnDisplay.BP_STRUCT_ActivityBtnDisplay
// 0x003C
struct FBP_STRUCT_ActivityBtnDisplay
{
	int                                                Priority_0_46159A294AD8CE52B8706D9F5544BD82;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ActivityName_1_BDDD54604B8656536C99C0A3F5074B3F;          // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     IconPath_2_C79C7E02493AE6F3925939B80B14DE6D;              // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     JumpUrl_3_883F04534B750337906ECABA456B4935;               // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                EndTime_4_197423154ADCB20E680D95A680D052BA;               // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                StartTime_5_BF12CD944EAB63ED3C270ABF863560AD;             // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                HasToken_6_341FB6402DB0637736EEE6A503F4B0BE;              // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Type_7_28A537807B3CB220160DD7A909F06B15;                  // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                HasRedPoint_8_0D865F40112014B7383DE17D04876144;           // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

