#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Shop_GiftPack_Item_Info.BP_STRUCT_Shop_GiftPack_Item_Info
// 0x0098
struct FBP_STRUCT_Shop_GiftPack_Item_Info
{
	struct FString                                     money_path_0_4E68A10022F9252E1E877D1C01D673B8;            // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                toUserGender_1_0280C9C0097C97216D2043EB0871DE12;          // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     pruduct_name_2_527D75C00D3271FD7901756404E4A295;          // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                product_price_3_51B010C05C089EA37BBC5C960EE7E5D5;         // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                product_id_4_260FFF4065660B952C09D22606A4EDF4;            // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     UserName_5_7949FC0018ABA97216C69740069C5CC5;              // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                toUserLV_7_05D29D003D563A46421BC7550B94D9B6;              // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     msg_8_0CACC5C06487EA571589CF3405D20767;                   // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     toUserPlatName_9_21A67900473FF8A87FC22764091D9FE5;        // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CheckCtrName_10_4CDAF600601865AA5FAE2D280718A4D5;         // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     toUserName_11_4117B4C00331DB2158E9171704D9EDA5;           // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_path_12_70D921400F755A551030DE0C01F794D8;            // 0x0064(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                item_id_13_1D474AC05A904C13246F0EA3036007F4;              // 0x0070(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     toUserIcon_14_752CD6C013CC8009591FA2DD04D853CE;           // 0x0074(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     toUserUID_15_54378D0029669C6431E4DE98094D9364;            // 0x0080(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                toUser_box_id_19_62B189804A64809C4934A88B0F4FA854;        // 0x008C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                UserGender_25_5223D10014647E48022993DD0BC8BC52;           // 0x0090(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Quality_26_27792E4006C95B9F6096D3720B440179;              // 0x0094(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

