#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ActivtyInfo.BP_STRUCT_ActivtyInfo
// 0x0078
struct FBP_STRUCT_ActivtyInfo
{
	struct FString                                     LabelDesc_1_0EFC5DED4CED05B79FDCF6B9E65944E9;             // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FBP_STRUCT_SubActivtyInfo>           BP_ARRAY_SubActivtyList_4_933599174B1BED11D5D64F8229990182;// 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ImgUrl_7_118283564B55A3DD0FDF5AAF9712C5DF;                // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EndTimeStr_9_E9AF9C4148A199EC73BB589422750EBE;            // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Title_10_B7DE485B48313542459A0CA90F0A2EA7;                // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     StartTimeStr_12_38F4087242259C1D210C9C98A68AE294;         // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_14_103BF6F54D3F09622B6DF48C276390CD;                   // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ImgLink_18_A5ECFD5B45F94F471012FAB48547C49E;              // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                LabelType_19_4B7540464994C079799243BC5D06BB10;            // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Desc_22_AD24C1674410F87CB92F399F38ECD3EA;                 // 0x005C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Detail_26_D77DDBD54C6614122839C3BE5087AB0E;               // 0x0068(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Page_Type_27_425458C04DB275373AB861680CA4F565;            // 0x0074(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

