#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Rank_RoleInfo.BP_STRUCT_Rank_RoleInfo
// 0x002C
struct FBP_STRUCT_Rank_RoleInfo
{
	struct FString                                     sign_str_0_29DE59C010CA30B3589CBE0C0E4A0A02;              // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     title_image_path_1_6D17C380627C5E5C2F8033BA05831A88;      // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     title_2_7DC4080023C1B50045AB125606091585;                 // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                title_level_3_2BBE45C07723F7717AFAEB050D6BD93C;           // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                holidayTitle_4_57545A80718076E27C7439850940D0E5;          // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

