#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SevenDaysFun_TaskItem.BP_STRUCT_SevenDaysFun_TaskItem
// 0x0028
struct FBP_STRUCT_SevenDaysFun_TaskItem
{
	int                                                finish_progress_1_7ED4618046A81C5E4D2935520DAB2E73;       // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     desc_2_0E8474000A4FEBD01CE7FAE90FC42AE3;                  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                id_8_2FB67F80436F0A2A3D795A1C067FC474;                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                status_5_22C8B54068FA856301B761DC052CF403;                // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                progress_6_3C70C9800530F514588D776F0F214953;              // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FBP_STRUCT_SevenDayFun_DropData>     BP_ARRAY_DropList_7_36D68C40652A516F2F0C2516046EA784;     // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

