#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:44 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsTrainRankItem.BP_STRUCT_CorpsTrainRankItem
// 0x0050
struct FBP_STRUCT_CorpsTrainRankItem
{
	int                                                level_0_3EC28190456680026CD9F7B931AD9DDC;                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                startup_type_1_9D4340EC4FD2A6DCEEEFD091F37B87A5;          // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                score_2_408294F046CAD34CE609B183D5AC3F44;                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     uid_3_57979082471A1A50576109A07F0F458D;                   // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                qq_vip_4_1B51B5AA4644F0C7F476CE9F3A882A17;                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_avatar_box_id_5_DA996EAF46E88485A132028E3B255D07;     // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gender_6_B78822FA4C5719DC29CC3FB527793697;                // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                no_7_62AE5C5E44FBA47D45072B81C64AB559;                    // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     url_8_963C32D14FC7B9F0D2EC81AAB5CD63DB;                   // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     city_9_8773CCD64F76D629A4C420927295D44E;                  // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     name_10_CE5429DC48CCF17E4DE1DD8321127704;                 // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                itemtype_11_93C9C57F4DA299C14D5F0BB6A6A1FDDF;             // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

