#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:47 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RoleInfoAvatarFrame.BP_STRUCT_RoleInfoAvatarFrame
// 0x0040
struct FBP_STRUCT_RoleInfoAvatarFrame
{
	struct FString                                     desc_0_9EA5A7514180A8C5037426941604F705;                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     state_1_08058C3543CE33D3D561879F47077882;                 // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     name_2_03F86960403366ACEC72A5A2C522DE3F;                  // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                id_3_94030D564734EFD97A8EB583222EDC21;                    // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     desc_get_4_66306E3D4BB4116257FA129F1C7DB2EA;              // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     expire_time_5_3963988D494449036ADB16A2DCA3D002;           // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

