#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_LevelTaskInfo.BP_STRUCT_LevelTaskInfo
// 0x0018
struct FBP_STRUCT_LevelTaskInfo
{
	int                                                progress1_1_92975BCD434FC11807B2ABAD68D3024B;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_status_2_4E3122FE44FEAA7668D79F9F56DA7ECD;          // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                progress2_3_D2D57D9243C01C7D8E6D2EAD3FE90E04;             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_4_F12392CF4CD9F708749D358EE3FBA5ED;                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task2_status_6_4E0C146F4BCFFFF4770B3C87CA93E2A2;          // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task1_status_7_B1E5484F4B7CB4BEFCA81898DA804EED;          // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

