#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:47 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Reflux_New_Team_Friend.BP_STRUCT_Reflux_New_Team_Friend
// 0x0048
struct FBP_STRUCT_Reflux_New_Team_Friend
{
	int                                                sex_0_3611984030E8E0C910B5F0C008A9C9B8;                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     uid_1_264294C03A4A71BF10B5DFE308A9CB84;                   // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     name_2_6AE6CC8064E4B15C0A5903650A9E41B5;                  // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                level_3_12A4EA40319D7871492543B309E2B41C;                 // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segmentLebel_4_3C1A1A0055A28934421837E6092ED18C;          // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                currentTeamCount_5_6446C9003830A4323421340606225BF4;      // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                online_6_67D9058058E8171A473735E90E64A6D5;                // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     iconUrl_7_507DFB4060AC51670D74C7240FFE955C;               // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                iconBoxID_10_517C5C007665A8A25D7070030E82B324;            // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                maxTeamCount_11_737139C064C7111F5A79CAC00A273C74;         // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                teamState_12_4C2DCE407EF947C105B75D6A00836275;            // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                isSendInvite_13_10DA59807E190AE42516A93F070AE275;         // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

