#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:42 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_BattleResultMyInfo.BP_STRUCT_BattleResultMyInfo
// 0x002C
struct FBP_STRUCT_BattleResultMyInfo
{
	struct FString                                     roleUid_0_69E651874D1B59E37EFC1EA2C25EE5BD;               // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                cur_avatar_box_id_1_2E423FED44E481BF379E4AA2A1D6D57B;     // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     headIconUrl_2_2DE90D59411C4F69ED9F499E19E825A1;           // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     nickName_3_B3046B5241B93A9AE55B8F9B8703D4FC;              // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                gender_4_923EF15043A1194D7B0182B8366726E8;                // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

