#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:43 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Rank_PlayerData.BP_STRUCT_Rank_PlayerData
// 0x0030
struct FBP_STRUCT_Rank_PlayerData
{
	int                                                sex_0_4D6325C00596A00964DE15CA0B7145D8;                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        BP_ARRAY_FeatureList_1_785C3F80481C84F010BFFA21003609C4;  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                headid_2_7B6B298012EFBBD421DA0DA0052ACDE4;                // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     gid_3_50399EC03B79CD0564DE23A10B7151E4;                   // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                weapon_4_164D144035E1A18D0C75D217041A324E;                // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        BP_ARRAY_AvatarList_5_525A64401052C8A32E623289074ECA34;   // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

