#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SeasonUI_DayTask.BP_STRUCT_SeasonUI_DayTask
// 0x0024
struct FBP_STRUCT_SeasonUI_DayTask
{
	int                                                task_id_0_4BCB1AC030BB74E558F06D610BB7D8C4;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                progress_1_708B20400CFC097B2A9BA65B0CA25FC3;              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                max_progress_2_66D9698015E2BD6C22675FA70C75B603;          // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     info_3_3E56CE005DDCC2AE313122BC0CD2F73F;                  // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                item_time_4_5BA3324034093DCD21F7656905FB9FA5;             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_num_5_78A09A805B3F803A22A08A7D095F96AD;              // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id_6_6125B9C01785C5594196839A0195F8C4;               // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

