#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CollectProgressTitleInfo.BP_STRUCT_CollectProgressTitleInfo
// 0x0024
struct FBP_STRUCT_CollectProgressTitleInfo
{
	int                                                PassLevel_0_7E540B4027B063933BE3B4540B05F91C;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SeasonName_1_5DBF6200017518BA2B95CE610232EFB5;            // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SeasonID_2_624EE5003982DEC64365933E09823174;              // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PassType_3_2D22D5C03AF1B3A756A151860AA0D335;              // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     CollectCharcterImgPath_4_2560EE8052977562391648E00E7EF518;// 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

