#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:47 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Reflux_New_Task_Info.BP_STRUCT_Reflux_New_Task_Info
// 0x0040
struct FBP_STRUCT_Reflux_New_Task_Info
{
	int                                                isBig_0_62006FC07A729C234880FA400471D477;                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     taskName_1_4002E1405B7951294DEE826A02580185;              // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                curTaskID_2_20A2AEC07066F90169DA2CF50B2CF4B4;             // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                taskID_3_7899A4403F7495EF565F09F607B25794;                // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                currentCount_4_787777406C08B36B3F2E83CD03403B54;          // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                awardID_5_4E271B406DF5B5BF420B655609740CB4;               // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                dropID_6_665564C0634641F73D5F360406A3AC94;                // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     awardIcon_7_7CCE7A4054D23FD11A710A93040C912E;             // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                status_8_12DFDD4065702C5553F3EB1307B04383;                // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                needCount_9_5515DD803AF566F03EE7AF03070E1F44;             // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                awardTime_10_70EB1BC0601762771A42DF61040DC745;            // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                awardNum_11_58A5440001011D1033E4F7FE0740D32D;             // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

