#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:51 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_LobbyCameraInfo_type.BP_STRUCT_LobbyCameraInfo_type
// 0x0058
struct FBP_STRUCT_LobbyCameraInfo_type
{
	struct FString                                     FieldOfView_0_774965C01E82608B78610A1F0CEEDE07;           // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CameraLocation_1_337EB9401C40211F6EB5E73A0F1A116E;        // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ProjectMode_2_05044FC04CBC5C8904E0C53F08075A45;           // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                CameraID_3_2E8DAE400C973D5F0716503A0A82BED4;              // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     CameraRotation_4_1901DF00292BF94210F0DE080C2A13CE;        // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BlendTime_5_48FF35C029EC8B7B17E35E2A01AA1EF5;             // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CameraScale_6_187545000777A7B8563DCE430BD94005;           // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CameraLocationX_7_0D8E2F407AB6F6691CDF865C01A117C8;       // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

