#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_NoticeInfo.BP_STRUCT_NoticeInfo
// 0x0078
struct FBP_STRUCT_NoticeInfo
{
	struct FString                                     jump_mode2_0_0AFCDDDE4E49D68EC1E458B7C6E1756D;            // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_1_65F7370B4527B75928D74181AAB77CBB;                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     content_2_7324FFD24CC05DCD4260EA8C6D1905D4;               // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     button_desc_3_66D8B787439345A3F9AACF868C189546;           // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                mark_type_4_631B1E224D9CDBF607B59BB6BB662C72;             // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     mark_desc_5_30A41C5243CA99A80FC828B1A79A9D96;             // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     jump_button2_6_EFE006FA4E76444AA82F5C9E69C799BE;          // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     jump_button1_7_C487EA014040DEE90177F6BBE53EDD1B;          // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     pic_url_8_730A7D1C4C637BA216734BA435E34DD3;               // 0x0050(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     jump_mode1_9_C90DD91148C86A368099CDB014DD5C35;            // 0x005C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     title_10_479143544DB76C39CF8D18B3AF266A85;                // 0x0068(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Page_Type_11_0615F84028DFB9DF0479D1F30C46A335;            // 0x0074(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

