#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_TeamUpMapInfo.BP_STRUCT_TeamUpMapInfo
// 0x0074
struct FBP_STRUCT_TeamUpMapInfo
{
	struct FString                                     tips_0_2096CAC0672F66D75BA5B0D706375413;                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     map_name_1_72B6AA407EF05B0949FB10AF0C4471E5;              // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_path_2_4BE548004EC279884BA979A604650948;             // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                map_id_3_30D675406035231F67F82E3707DC43C4;                // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_selected_4_088CDBC0432AD41302B66DB309557A44;           // 0x0028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
	int                                                size_type_5_245F71C071A1CED57BAAC39406D5D835;             // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     forbid_tips_7_219E00004961152074EB6F050D059E93;           // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     level_limit_8_223A804049F9751F22AA3EBD033E8AE4;           // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     sub_info_9_2E01B0004D438FB83FF8296E0F23D38F;              // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               can_select_10_7E877F00093A4E3E726E624E00AE5FC4;           // 0x0054(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
	struct FString                                     model_sub_name_11_7313A94046CD4DBB3B26ADE90ACC7775;       // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                model_sub_name_type_12_76E2D1802C3056E20449A80A071A8715;  // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     time_limit_str_13_7491B40007A159027EDCC07400551F62;       // 0x0068(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

