#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:42 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_OBPersonalResult.BP_STRUCT_OBPersonalResult
// 0x0024
struct FBP_STRUCT_OBPersonalResult
{
	struct FString                                     name_0_703FDA8026FDF3F6290E6BB503BAFE85;                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                rank_1_043D3D401375153129135EC603B83EFB;                  // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                kill_2_26521D404DDB5A6F290FDEDB03BAA69C;                  // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gender_3_24AB2F80486EF83666B9C9CE0962F972;                // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     uid_5_06C2A2C056D224D92722DDCB0B3B8054;                   // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

