#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:40 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum SlateCore.ESlateBrushImageType
enum class ESlateBrushImageType : uint8_t
{
	ESlateBrushImageType__NoImage  = 0,
	ESlateBrushImageType__FullColor = 1,
	ESlateBrushImageType__Linear   = 2,
	ESlateBrushImageType__ESlateBrushImageType_MAX = 3
};


// Enum SlateCore.ESlateBrushMirrorType
enum class ESlateBrushMirrorType : uint8_t
{
	ESlateBrushMirrorType__NoMirror = 0,
	ESlateBrushMirrorType__Horizontal = 1,
	ESlateBrushMirrorType__Vertical = 2,
	ESlateBrushMirrorType__Both    = 3,
	ESlateBrushMirrorType__ESlateBrushMirrorType_MAX = 4
};


// Enum SlateCore.ESlateBrushTileType
enum class ESlateBrushTileType : uint8_t
{
	ESlateBrushTileType__NoTile    = 0,
	ESlateBrushTileType__Horizontal = 1,
	ESlateBrushTileType__Vertical  = 2,
	ESlateBrushTileType__Both      = 3,
	ESlateBrushTileType__ESlateBrushTileType_MAX = 4
};


// Enum SlateCore.ESlateBrushDrawType
enum class ESlateBrushDrawType : uint8_t
{
	ESlateBrushDrawType__NoDrawType = 0,
	ESlateBrushDrawType__Box       = 1,
	ESlateBrushDrawType__Border    = 2,
	ESlateBrushDrawType__Image     = 3,
	ESlateBrushDrawType__ESlateBrushDrawType_MAX = 4
};


// Enum SlateCore.ESlateColorStylingMode
enum class ESlateColorStylingMode : uint8_t
{
	ESlateColorStylingMode__UseColor_Specified = 0,
	ESlateColorStylingMode__UseColor_Specified_Link = 1,
	ESlateColorStylingMode__UseColor_Foreground = 2,
	ESlateColorStylingMode__UseColor_Foreground_Subdued = 3,
	ESlateColorStylingMode__UseColor_MAX = 4
};


// Enum SlateCore.EWidgetClipping
enum class EWidgetClipping : uint8_t
{
	EWidgetClipping__Inherit       = 0,
	EWidgetClipping__ClipToBounds  = 1,
	EWidgetClipping__ClipToBoundsWithoutIntersecting = 2,
	EWidgetClipping__ClipToBoundsAlways = 3,
	EWidgetClipping__OnDemand      = 4,
	EWidgetClipping__EWidgetClipping_MAX = 5
};


// Enum SlateCore.EFontLayoutMethod
enum class EFontLayoutMethod : uint8_t
{
	EFontLayoutMethod__Metrics     = 0,
	EFontLayoutMethod__BoundingBox = 1,
	EFontLayoutMethod__EFontLayoutMethod_MAX = 2
};


// Enum SlateCore.EFontLoadingPolicy
enum class EFontLoadingPolicy : uint8_t
{
	EFontLoadingPolicy__LazyLoad   = 0,
	EFontLoadingPolicy__Stream     = 1,
	EFontLoadingPolicy__Inline     = 2,
	EFontLoadingPolicy__EFontLoadingPolicy_MAX = 3
};


// Enum SlateCore.EFontHinting
enum class EFontHinting : uint8_t
{
	EFontHinting__Default          = 0,
	EFontHinting__Auto             = 1,
	EFontHinting__AutoLight        = 2,
	EFontHinting__Monochrome       = 3,
	EFontHinting__None             = 4,
	EFontHinting__EFontHinting_MAX = 5
};


// Enum SlateCore.EFocusCause
enum class EFocusCause : uint8_t
{
	EFocusCause__Mouse             = 0,
	EFocusCause__Navigation        = 1,
	EFocusCause__SetDirectly       = 2,
	EFocusCause__Cleared           = 3,
	EFocusCause__OtherWidgetLostFocus = 4,
	EFocusCause__WindowActivate    = 5,
	EFocusCause__EFocusCause_MAX   = 6
};


// Enum SlateCore.ETextShapingMethod
enum class ETextShapingMethod : uint8_t
{
	ETextShapingMethod__Auto       = 0,
	ETextShapingMethod__KerningOnly = 1,
	ETextShapingMethod__FullShaping = 2,
	ETextShapingMethod__ETextShapingMethod_MAX = 3
};


// Enum SlateCore.EUINavigationRule
enum class EUINavigationRule : uint8_t
{
	EUINavigationRule__Escape      = 0,
	EUINavigationRule__Explicit    = 1,
	EUINavigationRule__Wrap        = 2,
	EUINavigationRule__Stop        = 3,
	EUINavigationRule__Custom      = 4,
	EUINavigationRule__Invalid     = 5,
	EUINavigationRule__EUINavigationRule_MAX = 6
};


// Enum SlateCore.ESelectInfo
enum class ESelectInfo : uint8_t
{
	ESelectInfo__OnKeyPress        = 0,
	ESelectInfo__OnNavigation      = 1,
	ESelectInfo__OnMouseClick      = 2,
	ESelectInfo__Direct            = 3,
	ESelectInfo__ESelectInfo_MAX   = 4
};


// Enum SlateCore.ETextCommit
enum class ETextCommit : uint8_t
{
	ETextCommit__Default           = 0,
	ETextCommit__OnEnter           = 1,
	ETextCommit__OnUserMovedFocus  = 2,
	ETextCommit__OnCleared         = 3,
	ETextCommit__ETextCommit_MAX   = 4
};


// Enum SlateCore.EScrollDirection
enum class EScrollDirection : uint8_t
{
	Scroll_Down                    = 0,
	Scroll_Up                      = 1,
	Scroll_MAX                     = 2
};


// Enum SlateCore.EOrientation
enum class EOrientation : uint8_t
{
	Orient_Horizontal              = 0,
	Orient_Vertical                = 1,
	Orient_MAX                     = 2
};


// Enum SlateCore.EMenuPlacement
enum class EMenuPlacement : uint8_t
{
	MenuPlacement_BelowAnchor      = 0,
	MenuPlacement_CenteredBelowAnchor = 1,
	MenuPlacement_BelowRightAnchor = 2,
	MenuPlacement_ComboBox         = 3,
	MenuPlacement_ComboBoxRight    = 4,
	MenuPlacement_MenuRight        = 5,
	MenuPlacement_AboveAnchor      = 6,
	MenuPlacement_CenteredAboveAnchor = 7,
	MenuPlacement_AboveRightAnchor = 8,
	MenuPlacement_MenuLeft         = 9,
	MenuPlacement_Center           = 10,
	MenuPlacement_RightLeftCenter  = 11,
	MenuPlacement_MatchBottomLeft  = 12,
	MenuPlacement_MAX              = 13
};


// Enum SlateCore.EVerticalAlignment
enum class EVerticalAlignment : uint8_t
{
	VAlign_Fill                    = 0,
	VAlign_Top                     = 1,
	VAlign_Center                  = 2,
	VAlign_Bottom                  = 3,
	VAlign_MAX                     = 4
};


// Enum SlateCore.EHorizontalAlignment
enum class EHorizontalAlignment : uint8_t
{
	HAlign_Fill                    = 0,
	HAlign_Left                    = 1,
	HAlign_Center                  = 2,
	HAlign_Right                   = 3,
	HAlign_MAX                     = 4
};


// Enum SlateCore.ENavigationGenesis
enum class ENavigationGenesis : uint8_t
{
	ENavigationGenesis__Keyboard   = 0,
	ENavigationGenesis__Controller = 1,
	ENavigationGenesis__User       = 2,
	ENavigationGenesis__ENavigationGenesis_MAX = 3
};


// Enum SlateCore.ENavigationSource
enum class ENavigationSource : uint8_t
{
	ENavigationSource__FocusedWidget = 0,
	ENavigationSource__WidgetUnderCursor = 1,
	ENavigationSource__ENavigationSource_MAX = 2
};


// Enum SlateCore.EUINavigation
enum class EUINavigation : uint8_t
{
	EUINavigation__Left            = 0,
	EUINavigation__Right           = 1,
	EUINavigation__Up              = 2,
	EUINavigation__Down            = 3,
	EUINavigation__Next            = 4,
	EUINavigation__Previous        = 5,
	EUINavigation__Num             = 6,
	EUINavigation__Invalid         = 7,
	EUINavigation__EUINavigation_MAX = 8
};


// Enum SlateCore.EButtonPressMethod
enum class EButtonPressMethod : uint8_t
{
	EButtonPressMethod__DownAndUp  = 0,
	EButtonPressMethod__ButtonPress = 1,
	EButtonPressMethod__ButtonRelease = 2,
	EButtonPressMethod__EButtonPressMethod_MAX = 3
};


// Enum SlateCore.EButtonTouchMethod
enum class EButtonTouchMethod : uint8_t
{
	EButtonTouchMethod__DownAndUp  = 0,
	EButtonTouchMethod__PreciseTap = 1,
	EButtonTouchMethod__EButtonTouchMethod_MAX = 2
};


// Enum SlateCore.EButtonClickMethod
enum class EButtonClickMethod : uint8_t
{
	EButtonClickMethod__DownAndUp  = 0,
	EButtonClickMethod__MouseDown  = 1,
	EButtonClickMethod__MouseUp    = 2,
	EButtonClickMethod__PreciseClick = 3,
	EButtonClickMethod__EButtonClickMethod_MAX = 4
};


// Enum SlateCore.EFontFallback
enum class EFontFallback : uint8_t
{
	EFontFallback__FF_NoFallback   = 0,
	EFontFallback__FF_LocalizedFallback = 1,
	EFontFallback__FF_LastResortFallback = 2,
	EFontFallback__FF_Max          = 3
};


// Enum SlateCore.ECheckBoxState
enum class ECheckBoxState : uint8_t
{
	ECheckBoxState__Unchecked      = 0,
	ECheckBoxState__Checked        = 1,
	ECheckBoxState__Undetermined   = 2,
	ECheckBoxState__ECheckBoxState_MAX = 3
};


// Enum SlateCore.ESlateCheckBoxType
enum class ESlateCheckBoxType : uint8_t
{
	ESlateCheckBoxType__CheckBox   = 0,
	ESlateCheckBoxType__ToggleButton = 1,
	ESlateCheckBoxType__ESlateCheckBoxType_MAX = 2
};


// Enum SlateCore.EConsumeMouseWheel
enum class EConsumeMouseWheel : uint8_t
{
	EConsumeMouseWheel__WhenScrollingPossible = 0,
	EConsumeMouseWheel__Always     = 1,
	EConsumeMouseWheel__Never      = 2,
	EConsumeMouseWheel__EConsumeMouseWheel_MAX = 3
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct SlateCore.Margin
// 0x0010
struct FMargin
{
	float                                              Left;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Top;                                                      // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Right;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Bottom;                                                   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct SlateCore.SlateColor
// 0x001C
struct FSlateColor
{
	struct FLinearColor                                SpecifiedColor;                                           // 0x0000(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	TEnumAsByte<ESlateColorStylingMode>                ColorUseRule;                                             // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xB];                                       // 0x0011(0x000B) MISSED OFFSET
};

// ScriptStruct SlateCore.SlateBrush
// 0x0068
struct FSlateBrush
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
	struct FVector2D                                   ImageSize;                                                // 0x0004(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	struct FMargin                                     Margin;                                                   // 0x000C(0x0010) (Edit, BlueprintVisible)
	struct FSlateColor                                 TintColor;                                                // 0x001C(0x001C) (Edit, BlueprintVisible)
	class UObject*                                     ResourceObject;                                           // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
	struct FName                                       ResourceName;                                             // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FBox2D                                      UVRegion;                                                 // 0x0048(0x0014)
	TEnumAsByte<ESlateBrushDrawType>                   DrawAs;                                                   // 0x005C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ESlateBrushTileType>                   Tiling;                                                   // 0x005D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ESlateBrushMirrorType>                 Mirroring;                                                // 0x005E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ESlateBrushImageType>                  ImageType;                                                // 0x005F(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      bIsDynamicallyLoaded : 1;                                 // 0x0060(0x0001)
	unsigned char                                      bHasUObject : 1;                                          // 0x0060(0x0001) (Deprecated)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0061(0x0007) MISSED OFFSET
};

// ScriptStruct SlateCore.Geometry
// 0x0038
struct FGeometry
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0000(0x0038) MISSED OFFSET
};

// ScriptStruct SlateCore.InputEvent
// 0x0014
struct FInputEvent
{
	unsigned char                                      UnknownData00[0x14];                                      // 0x0000(0x0014) MISSED OFFSET
};

// ScriptStruct SlateCore.PointerEvent
// 0x004C (0x0060 - 0x0014)
struct FPointerEvent : public FInputEvent
{
	unsigned char                                      UnknownData00[0x4C];                                      // 0x0014(0x004C) MISSED OFFSET
};

// ScriptStruct SlateCore.FontOutlineSettings
// 0x001C
struct FFontOutlineSettings
{
	int                                                OutlineSize;                                              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UObject*                                     OutlineMaterial;                                          // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                OutlineColor;                                             // 0x0008(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	bool                                               bSeparateFillAlpha;                                       // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
};

// ScriptStruct SlateCore.SlateFontInfo
// 0x0040
struct FSlateFontInfo
{
	class UObject*                                     FontObject;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UObject*                                     FontMaterial;                                             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFontOutlineSettings                        OutlineSettings;                                          // 0x0008(0x001C) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0024(0x000C) MISSED OFFSET
	struct FName                                       TypefaceFontName;                                         // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Size;                                                     // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct SlateCore.SlateWidgetStyle
// 0x0004
struct FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
};

// ScriptStruct SlateCore.TableRowStyle
// 0x051C (0x0520 - 0x0004)
struct FTableRowStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 SelectorFocusedBrush;                                     // 0x0008(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 ActiveHoveredBrush;                                       // 0x0070(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 ActiveBrush;                                              // 0x00D8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 InactiveHoveredBrush;                                     // 0x0140(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 InactiveBrush;                                            // 0x01A8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 EvenRowBackgroundHoveredBrush;                            // 0x0210(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 EvenRowBackgroundBrush;                                   // 0x0278(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 OddRowBackgroundHoveredBrush;                             // 0x02E0(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 OddRowBackgroundBrush;                                    // 0x0348(0x0068) (Edit, BlueprintVisible)
	struct FSlateColor                                 TextColor;                                                // 0x03B0(0x001C) (Edit, BlueprintVisible)
	struct FSlateColor                                 SelectedTextColor;                                        // 0x03CC(0x001C) (Edit, BlueprintVisible)
	struct FSlateBrush                                 DropIndicator_Above;                                      // 0x03E8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 DropIndicator_Onto;                                       // 0x0450(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 DropIndicator_Below;                                      // 0x04B8(0x0068) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.SlateSound
// 0x0018
struct FSlateSound
{
	class UObject*                                     ResourceObject;                                           // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x14];                                      // 0x0004(0x0014) MISSED OFFSET
};

// ScriptStruct SlateCore.ButtonStyle
// 0x01F4 (0x01F8 - 0x0004)
struct FButtonStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 Normal;                                                   // 0x0008(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 Hovered;                                                  // 0x0070(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 Pressed;                                                  // 0x00D8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 Disabled;                                                 // 0x0140(0x0068) (Edit, BlueprintVisible)
	struct FMargin                                     NormalPadding;                                            // 0x01A8(0x0010) (Edit, BlueprintVisible)
	struct FMargin                                     PressedPadding;                                           // 0x01B8(0x0010) (Edit, BlueprintVisible)
	struct FSlateSound                                 PressedSlateSound;                                        // 0x01C8(0x0018) (Edit, BlueprintVisible)
	struct FSlateSound                                 HoveredSlateSound;                                        // 0x01E0(0x0018) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.ComboButtonStyle
// 0x02DC (0x02E0 - 0x0004)
struct FComboButtonStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FButtonStyle                                ButtonStyle;                                              // 0x0008(0x01F8) (Edit, BlueprintVisible)
	struct FSlateBrush                                 DownArrowImage;                                           // 0x0200(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 MenuBorderBrush;                                          // 0x0268(0x0068) (Edit, BlueprintVisible)
	struct FMargin                                     MenuBorderPadding;                                        // 0x02D0(0x0010) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.ComboBoxStyle
// 0x0314 (0x0318 - 0x0004)
struct FComboBoxStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FComboButtonStyle                           ComboButtonStyle;                                         // 0x0008(0x02E0) (Edit, BlueprintVisible)
	struct FSlateSound                                 PressedSlateSound;                                        // 0x02E8(0x0018) (Edit, BlueprintVisible)
	struct FSlateSound                                 SelectionChangeSlateSound;                                // 0x0300(0x0018) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.EditableTextStyle
// 0x019C (0x01A0 - 0x0004)
struct FEditableTextStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateFontInfo                              Font;                                                     // 0x0008(0x0040) (Edit, BlueprintVisible)
	struct FSlateColor                                 ColorAndOpacity;                                          // 0x0048(0x001C) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
	struct FSlateBrush                                 BackgroundImageSelected;                                  // 0x0068(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 BackgroundImageComposing;                                 // 0x00D0(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 CaretImage;                                               // 0x0138(0x0068) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.ScrollBarStyle
// 0x03AC (0x03B0 - 0x0004)
struct FScrollBarStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 HorizontalBackgroundImage;                                // 0x0008(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 VerticalBackgroundImage;                                  // 0x0070(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 VerticalTopSlotImage;                                     // 0x00D8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 HorizontalTopSlotImage;                                   // 0x0140(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 VerticalBottomSlotImage;                                  // 0x01A8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 HorizontalBottomSlotImage;                                // 0x0210(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 NormalThumbImage;                                         // 0x0278(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 HoveredThumbImage;                                        // 0x02E0(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 DraggedThumbImage;                                        // 0x0348(0x0068) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.EditableTextBoxStyle
// 0x061C (0x0620 - 0x0004)
struct FEditableTextBoxStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 BackgroundImageNormal;                                    // 0x0008(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 BackgroundImageHovered;                                   // 0x0070(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 BackgroundImageFocused;                                   // 0x00D8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 BackgroundImageReadOnly;                                  // 0x0140(0x0068) (Edit, BlueprintVisible)
	struct FMargin                                     Padding;                                                  // 0x01A8(0x0010) (Edit, BlueprintVisible)
	struct FSlateFontInfo                              Font;                                                     // 0x01B8(0x0040) (Edit, BlueprintVisible)
	struct FSlateColor                                 ForegroundColor;                                          // 0x01F8(0x001C) (Edit, BlueprintVisible)
	struct FSlateColor                                 BackgroundColor;                                          // 0x0214(0x001C) (Edit, BlueprintVisible)
	struct FSlateColor                                 ReadOnlyForegroundColor;                                  // 0x0230(0x001C) (Edit, BlueprintVisible)
	struct FMargin                                     HScrollBarPadding;                                        // 0x024C(0x0010) (Edit, BlueprintVisible)
	struct FMargin                                     VScrollBarPadding;                                        // 0x025C(0x0010) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData01[0x4];                                       // 0x026C(0x0004) MISSED OFFSET
	struct FScrollBarStyle                             ScrollBarStyle;                                           // 0x0270(0x03B0) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.TextBlockStyle
// 0x0174 (0x0178 - 0x0004)
struct FTextBlockStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateFontInfo                              Font;                                                     // 0x0008(0x0040) (Edit, BlueprintVisible)
	struct FSlateColor                                 ColorAndOpacity;                                          // 0x0048(0x001C) (Edit, BlueprintVisible)
	struct FVector2D                                   ShadowOffset;                                             // 0x0064(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	struct FLinearColor                                ShadowColorAndOpacity;                                    // 0x006C(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	struct FSlateColor                                 SelectedBackgroundColor;                                  // 0x007C(0x001C) (Edit)
	struct FLinearColor                                HighlightColor;                                           // 0x0098(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	struct FSlateBrush                                 HighlightShape;                                           // 0x00A8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 UnderlineBrush;                                           // 0x0110(0x0068) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.SpinBoxStyle
// 0x023C (0x0240 - 0x0004)
struct FSpinBoxStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 BackgroundBrush;                                          // 0x0008(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 HoveredBackgroundBrush;                                   // 0x0070(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 ActiveFillBrush;                                          // 0x00D8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 InactiveFillBrush;                                        // 0x0140(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 ArrowsImage;                                              // 0x01A8(0x0068) (Edit, BlueprintVisible)
	struct FSlateColor                                 ForegroundColor;                                          // 0x0210(0x001C)
	struct FMargin                                     TextPadding;                                              // 0x022C(0x0010) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData01[0x4];                                       // 0x023C(0x0004) MISSED OFFSET
};

// ScriptStruct SlateCore.FontData
// 0x0014
struct FFontData
{
	struct FString                                     FontFilename;                                             // 0x0000(0x000C) (ZeroConstructor)
	EFontHinting                                       Hinting;                                                  // 0x000C(0x0001) (ZeroConstructor, IsPlainOldData)
	EFontLoadingPolicy                                 LoadingPolicy;                                            // 0x000D(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x000E(0x0002) MISSED OFFSET
	class UObject*                                     FontFaceAsset;                                            // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct SlateCore.TypefaceEntry
// 0x0020
struct FTypefaceEntry
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FFontData                                   Font;                                                     // 0x0008(0x0014)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct SlateCore.Typeface
// 0x000C
struct FTypeface
{
	TArray<struct FTypefaceEntry>                      Fonts;                                                    // 0x0000(0x000C) (ZeroConstructor)
};

// ScriptStruct SlateCore.CompositeSubFont
// 0x001C
struct FCompositeSubFont
{
	struct FTypeface                                   Typeface;                                                 // 0x0000(0x000C)
	TArray<struct FInt32Range>                         CharacterRanges;                                          // 0x000C(0x000C) (ZeroConstructor)
	float                                              ScalingFactor;                                            // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct SlateCore.CompositeFont
// 0x0018
struct FCompositeFont
{
	struct FTypeface                                   DefaultTypeface;                                          // 0x0000(0x000C)
	TArray<struct FCompositeSubFont>                   SubTypefaces;                                             // 0x000C(0x000C) (ZeroConstructor)
};

// ScriptStruct SlateCore.NavigationEvent
// 0x0004 (0x0018 - 0x0014)
struct FNavigationEvent : public FInputEvent
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct SlateCore.MotionEvent
// 0x0030 (0x0044 - 0x0014)
struct FMotionEvent : public FInputEvent
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0014(0x0030) MISSED OFFSET
};

// ScriptStruct SlateCore.CharacterEvent
// 0x0004 (0x0018 - 0x0014)
struct FCharacterEvent : public FInputEvent
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct SlateCore.KeyEvent
// 0x001C (0x0030 - 0x0014)
struct FKeyEvent : public FInputEvent
{
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0014(0x001C) MISSED OFFSET
};

// ScriptStruct SlateCore.AnalogInputEvent
// 0x0008 (0x0038 - 0x0030)
struct FAnalogInputEvent : public FKeyEvent
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET
};

// ScriptStruct SlateCore.FocusEvent
// 0x0008
struct FFocusEvent
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
};

// ScriptStruct SlateCore.WindowStyle
// 0x0C74 (0x0C78 - 0x0004)
struct FWindowStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FButtonStyle                                MinimizeButtonStyle;                                      // 0x0008(0x01F8) (Edit, BlueprintVisible)
	struct FButtonStyle                                MaximizeButtonStyle;                                      // 0x0200(0x01F8) (Edit, BlueprintVisible)
	struct FButtonStyle                                RestoreButtonStyle;                                       // 0x03F8(0x01F8) (Edit, BlueprintVisible)
	struct FButtonStyle                                CloseButtonStyle;                                         // 0x05F0(0x01F8) (Edit, BlueprintVisible)
	struct FTextBlockStyle                             TitleTextStyle;                                           // 0x07E8(0x0178) (Edit, BlueprintVisible)
	struct FSlateBrush                                 ActiveTitleBrush;                                         // 0x0960(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 InactiveTitleBrush;                                       // 0x09C8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 FlashTitleBrush;                                          // 0x0A30(0x0068) (Edit, BlueprintVisible)
	struct FSlateColor                                 BackgroundColor;                                          // 0x0A98(0x001C) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0AB4(0x0004) MISSED OFFSET
	struct FSlateBrush                                 OutlineBrush;                                             // 0x0AB8(0x0068) (Edit, BlueprintVisible)
	struct FSlateColor                                 OutlineColor;                                             // 0x0B20(0x001C) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0B3C(0x0004) MISSED OFFSET
	struct FSlateBrush                                 BorderBrush;                                              // 0x0B40(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 BackgroundBrush;                                          // 0x0BA8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 ChildBackgroundBrush;                                     // 0x0C10(0x0068) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.ScrollBorderStyle
// 0x00D4 (0x00D8 - 0x0004)
struct FScrollBorderStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 TopShadowBrush;                                           // 0x0008(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 BottomShadowBrush;                                        // 0x0070(0x0068) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.ScrollBoxStyle
// 0x01A4 (0x01A8 - 0x0004)
struct FScrollBoxStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 TopShadowBrush;                                           // 0x0008(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 BottomShadowBrush;                                        // 0x0070(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 LeftShadowBrush;                                          // 0x00D8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 RightShadowBrush;                                         // 0x0140(0x0068) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.DockTabStyle
// 0x056C (0x0570 - 0x0004)
struct FDockTabStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FButtonStyle                                CloseButtonStyle;                                         // 0x0008(0x01F8) (Edit)
	struct FSlateBrush                                 NormalBrush;                                              // 0x0200(0x0068) (Edit)
	struct FSlateBrush                                 ActiveBrush;                                              // 0x0268(0x0068) (Edit)
	struct FSlateBrush                                 ColorOverlayTabBrush;                                     // 0x02D0(0x0068) (Edit)
	struct FSlateBrush                                 ColorOverlayIconBrush;                                    // 0x0338(0x0068) (Edit)
	struct FSlateBrush                                 ForegroundBrush;                                          // 0x03A0(0x0068) (Edit)
	struct FSlateBrush                                 HoveredBrush;                                             // 0x0408(0x0068) (Edit)
	struct FSlateBrush                                 ContentAreaBrush;                                         // 0x0470(0x0068) (Edit)
	struct FSlateBrush                                 TabWellBrush;                                             // 0x04D8(0x0068) (Edit)
	struct FMargin                                     TabPadding;                                               // 0x0540(0x0010) (Edit)
	float                                              OverlapWidth;                                             // 0x0550(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FSlateColor                                 FlashColor;                                               // 0x0554(0x001C) (Edit)
};

// ScriptStruct SlateCore.TableColumnHeaderStyle
// 0x03AC (0x03B0 - 0x0004)
struct FTableColumnHeaderStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 SortPrimaryAscendingImage;                                // 0x0008(0x0068) (Edit)
	struct FSlateBrush                                 SortPrimaryDescendingImage;                               // 0x0070(0x0068) (Edit)
	struct FSlateBrush                                 SortSecondaryAscendingImage;                              // 0x00D8(0x0068) (Edit)
	struct FSlateBrush                                 SortSecondaryDescendingImage;                             // 0x0140(0x0068) (Edit)
	struct FSlateBrush                                 NormalBrush;                                              // 0x01A8(0x0068) (Edit)
	struct FSlateBrush                                 HoveredBrush;                                             // 0x0210(0x0068) (Edit)
	struct FSlateBrush                                 MenuDropdownImage;                                        // 0x0278(0x0068) (Edit)
	struct FSlateBrush                                 MenuDropdownNormalBorderBrush;                            // 0x02E0(0x0068) (Edit)
	struct FSlateBrush                                 MenuDropdownHoveredBorderBrush;                           // 0x0348(0x0068) (Edit)
};

// ScriptStruct SlateCore.SplitterStyle
// 0x00D4 (0x00D8 - 0x0004)
struct FSplitterStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 HandleNormalBrush;                                        // 0x0008(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 HandleHighlightBrush;                                     // 0x0070(0x0068) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.HeaderRowStyle
// 0x08C4 (0x08C8 - 0x0004)
struct FHeaderRowStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FTableColumnHeaderStyle                     ColumnStyle;                                              // 0x0008(0x03B0) (Edit)
	struct FTableColumnHeaderStyle                     LastColumnStyle;                                          // 0x03B8(0x03B0) (Edit)
	struct FSplitterStyle                              ColumnSplitterStyle;                                      // 0x0768(0x00D8) (Edit)
	struct FSlateBrush                                 BackgroundBrush;                                          // 0x0840(0x0068) (Edit)
	struct FSlateColor                                 ForegroundColor;                                          // 0x08A8(0x001C) (Edit)
	unsigned char                                      UnknownData01[0x4];                                       // 0x08C4(0x0004) MISSED OFFSET
};

// ScriptStruct SlateCore.InlineTextImageStyle
// 0x0074 (0x0078 - 0x0004)
struct FInlineTextImageStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 Image;                                                    // 0x0008(0x0068) (Edit)
	int16_t                                            Baseline;                                                 // 0x0070(0x0002) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0072(0x0006) MISSED OFFSET
};

// ScriptStruct SlateCore.SliderStyle
// 0x01AC (0x01B0 - 0x0004)
struct FSliderStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 NormalBarImage;                                           // 0x0008(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 DisabledBarImage;                                         // 0x0070(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 NormalThumbImage;                                         // 0x00D8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 DisabledThumbImage;                                       // 0x0140(0x0068) (Edit, BlueprintVisible)
	float                                              BarThickness;                                             // 0x01A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x01AC(0x0004) MISSED OFFSET
};

// ScriptStruct SlateCore.VolumeControlStyle
// 0x03BC (0x03C0 - 0x0004)
struct FVolumeControlStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSliderStyle                                SliderStyle;                                              // 0x0008(0x01B0) (Edit)
	struct FSlateBrush                                 HighVolumeImage;                                          // 0x01B8(0x0068) (Edit)
	struct FSlateBrush                                 MidVolumeImage;                                           // 0x0220(0x0068) (Edit)
	struct FSlateBrush                                 LowVolumeImage;                                           // 0x0288(0x0068) (Edit)
	struct FSlateBrush                                 NoVolumeImage;                                            // 0x02F0(0x0068) (Edit)
	struct FSlateBrush                                 MutedImage;                                               // 0x0358(0x0068) (Edit)
};

// ScriptStruct SlateCore.SearchBoxStyle
// 0x081C (0x0820 - 0x0004)
struct FSearchBoxStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FEditableTextBoxStyle                       TextBoxStyle;                                             // 0x0008(0x0620) (Edit)
	struct FSlateFontInfo                              ActiveFontInfo;                                           // 0x0628(0x0040) (Edit)
	struct FSlateBrush                                 UpArrowImage;                                             // 0x0668(0x0068) (Edit)
	struct FSlateBrush                                 DownArrowImage;                                           // 0x06D0(0x0068) (Edit)
	struct FSlateBrush                                 GlassImage;                                               // 0x0738(0x0068) (Edit)
	struct FSlateBrush                                 ClearImage;                                               // 0x07A0(0x0068) (Edit)
	struct FMargin                                     ImagePadding;                                             // 0x0808(0x0010) (Edit)
	bool                                               bLeftAlignButtons;                                        // 0x0818(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0819(0x0007) MISSED OFFSET
};

// ScriptStruct SlateCore.ExpandableAreaStyle
// 0x00DC (0x00E0 - 0x0004)
struct FExpandableAreaStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 CollapsedImage;                                           // 0x0008(0x0068) (Edit)
	struct FSlateBrush                                 ExpandedImage;                                            // 0x0070(0x0068) (Edit)
	float                                              RolloutAnimationSeconds;                                  // 0x00D8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00DC(0x0004) MISSED OFFSET
};

// ScriptStruct SlateCore.ProgressBarStyle
// 0x013C (0x0140 - 0x0004)
struct FProgressBarStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FSlateBrush                                 BackgroundImage;                                          // 0x0008(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 FillImage;                                                // 0x0070(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 MarqueeImage;                                             // 0x00D8(0x0068) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.InlineEditableTextBlockStyle
// 0x079C (0x07A0 - 0x0004)
struct FInlineEditableTextBlockStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FEditableTextBoxStyle                       EditableTextBoxStyle;                                     // 0x0008(0x0620) (Edit, BlueprintVisible)
	struct FTextBlockStyle                             TextStyle;                                                // 0x0628(0x0178) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.HyperlinkStyle
// 0x0384 (0x0388 - 0x0004)
struct FHyperlinkStyle : public FSlateWidgetStyle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FButtonStyle                                UnderlineStyle;                                           // 0x0008(0x01F8) (Edit, BlueprintVisible)
	struct FTextBlockStyle                             TextStyle;                                                // 0x0200(0x0178) (Edit, BlueprintVisible)
	struct FMargin                                     Padding;                                                  // 0x0378(0x0010) (Edit, BlueprintVisible)
};

// ScriptStruct SlateCore.CheckBoxStyle
// 0x043C (0x0440 - 0x0004)
struct FCheckBoxStyle : public FSlateWidgetStyle
{
	TEnumAsByte<ESlateCheckBoxType>                    CheckBoxType;                                             // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	struct FSlateBrush                                 UncheckedImage;                                           // 0x0008(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 UncheckedHoveredImage;                                    // 0x0070(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 UncheckedPressedImage;                                    // 0x00D8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 CheckedImage;                                             // 0x0140(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 CheckedHoveredImage;                                      // 0x01A8(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 CheckedPressedImage;                                      // 0x0210(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 UndeterminedImage;                                        // 0x0278(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 UndeterminedHoveredImage;                                 // 0x02E0(0x0068) (Edit, BlueprintVisible)
	struct FSlateBrush                                 UndeterminedPressedImage;                                 // 0x0348(0x0068) (Edit, BlueprintVisible)
	struct FMargin                                     Padding;                                                  // 0x03B0(0x0010) (Edit, BlueprintVisible)
	struct FSlateColor                                 ForegroundColor;                                          // 0x03C0(0x001C) (Edit, BlueprintVisible)
	struct FSlateColor                                 BorderBackgroundColor;                                    // 0x03DC(0x001C) (Edit, BlueprintVisible)
	struct FSlateSound                                 CheckedSlateSound;                                        // 0x03F8(0x0018) (Edit, BlueprintVisible)
	struct FSlateSound                                 UncheckedSlateSound;                                      // 0x0410(0x0018) (Edit, BlueprintVisible)
	struct FSlateSound                                 HoveredSlateSound;                                        // 0x0428(0x0018) (Edit, BlueprintVisible)
};

}

