#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:47 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Exciting_Party_Info.BP_STRUCT_Exciting_Party_Info
// 0x0074
struct FBP_STRUCT_Exciting_Party_Info
{
	int                                                mainActID_0_A7F589774B068F4A4F8D74B8B58E2CB5;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FBP_STRUCT_Exciting_Party_Award_Info> BP_ARRAY_Exciting_Party_Award_Infos_1_CF05F085455BEC91B821E3A741AD5250;// 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     shareNum_2_69CC498744E4B0FB8FFE7B8B698B6AB6;              // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     title_3_885B6403449B299B9DE56FB7F24F8D35;                 // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                itemIdx_4_1913E6744DC0CDA00C15DDA82F7E797C;               // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                status_5_AC2A1B644C589A681341868104DC8B71;                // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     titleHide_6_59B1F9C24CDFA601A6D012849EBEE039;             // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                openTime_7_F96BEB784A23D2F3AFD96D948773A79A;              // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     bigProgress_8_6ADF3FA940792CB1B19C3BB5398ED697;           // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     showName_9_325C6C9C4F2CD774DBA6EE9D5C1768D7;              // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     openTimeStr_10_052991954CD18E0B2E4E32AF51D40402;          // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                actID_11_8D1D839A4E4EA971F762DCAC47F585DE;                // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     targetNum_12_8CBE54CB459BA4047B5CA68162543D92;            // 0x0068(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

