#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:51 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Shop_ItemInfo.BP_STRUCT_Shop_ItemInfo
// 0x0054
struct FBP_STRUCT_Shop_ItemInfo
{
	struct FString                                     pruduct_name_0_5B29BA93499594D4CBB44A8FAE5DDFB0;          // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                product_sub_type_1_D725D632474D3D69533AB6B9BB1A74AB;      // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                product_gold_price_2_F81D1F4C47A822905FC194BBCC31D86A;    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                product_id_3_900CD0FF4DF6081D731F9A9C4FD6B68F;            // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     product_desc_4_CE6E0C65473991A29496FC8C7199BA12;          // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                product_type_5_D05ABCC841B153289F6831907AAF5B22;          // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id_6_C824D15248674294875E6195166C8425;               // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     item_icon_7_7B21BA264199835B609EB8959934C835;             // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                product_sort_8_1057FEEF4CACC02A1DEB36BC4A4D6D7A;          // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                other_coin_price_9_4E8F49404F5F40332EE9702C0F93F455;      // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_timing_10_44035300578D8A704A6484B70CB72797;            // 0x0040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0041(0x0003) MISSED OFFSET
	int                                                other_coin_11_4867ACC049415CE93D53E8190DF47BBE;           // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                off_sale_ts_12_4FBE638054AFAAA6785B8B73007E34C3;          // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                left_time_sec_13_035C37002232299C29DF542705CEF603;        // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                on_sale_ts_14_0EB20C0009C2378E3CB5565908F38E73;           // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

