#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:51 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_InfoMemberInfo.BP_STRUCT_InfoMemberInfo
// 0x008C
struct FBP_STRUCT_InfoMemberInfo
{
	int                                                online_state_9_38DD19FA4E6FE637E062AE93AA8BEDC0;          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                position_10_4DEB70924CA487D6F5F63685047E8E90;             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FBP_STRUCT_BASE_INFO                        BP_STRUCT_BASE_INFO_11_9BFEEA2242913DBB1C4BA684559EDA59;  // 0x0008(0x0040) (Edit, BlueprintVisible)
	int                                                svr_12_7F8F8D334B15943C9CD7079524B4C525;                  // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                day_active_13_FED44365481D477690841BB401372D8F;           // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                week_active_14_F43237FF40A443D012C3DA993132BF4C;          // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FBP_STRUCT_GROUP_INFO                       BP_STRUCT_GROUP_INFO_18_4E466C800A17C1EC08DFF68B05D1598F; // 0x0054(0x0020) (Edit, BlueprintVisible)
	int                                                season_active_20_5BCCD240033ECCEB31121D2404F7CA05;        // 0x0074(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     strId_22_5A037AC00A66E1BD648D46240C828364;                // 0x0078(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                corps_war_week_feat_num_24_26C65B80023001E04CF984B403CDCCFD;// 0x0084(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                corps_war_season_feat_num_25_454F12C047B3698B0D3569F70CD4AC3D;// 0x0088(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

