#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ListItemInfo.BP_STRUCT_ListItemInfo
// 0x0018
struct FBP_STRUCT_ListItemInfo
{
	int                                                id_0_7BEDB2E245CF52A994D9CE98FA79E479;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     text_1_372DC9B94184E5EA174226961541D5A1;                  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               is_selected_2_B3BB4A3644C6675DE078609367C0BE75;           // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_lock_3_FAFD3EC14AB6725E1AF168B5C908D871;               // 0x0011(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               is_open_4_278EF14E48085B8E849CDB93FAED4128;               // 0x0012(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0013(0x0001) MISSED OFFSET
	int                                                item_type_7_081BFFB4460235DD973BA3806727804F;             // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

