#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ShareGiftRecv.BP_STRUCT_ShareGiftRecv
// 0x005C
struct FBP_STRUCT_ShareGiftRecv
{
	int                                                style_0_56A00CC05DB7FA45179AE9E105755495;                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                senderGender_1_67D4F6001C608E1A4F0F5DEF01BECB52;          // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                myGender_2_587E6F40229554DF7C97A14C03111D72;              // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                myAvatarBox_3_01A15C002F151E084A82B6C50DD35D18;           // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     notice_4_2B0F4100754156501B7CC7D207C864C5;                // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     myName_5_6A2ADA406934904362FBBDE407B48D65;                // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     give_type_6_2FB973801FFDDC1A18BB416A0023E385;             // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     uid_11_1CBBB1003E4CF5D215F2AAAF0CB57414;                  // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     myIconUrl_8_78116900005AAB1643BAD256033147BC;             // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                itemId_9_0611B780513B8908657A1EEC07F48AA4;                // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     senderName_10_1B40210047287A5079009BDF019222B5;           // 0x0050(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

