#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RoleInfoHistoryRadarInfo.BP_STRUCT_RoleInfoHistoryRadarInfo
// 0x0048
struct FBP_STRUCT_RoleInfoHistoryRadarInfo
{
	struct FString                                     survive_score_0_E49F1CDC45113263DDE5A5840EE42220;         // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     support_score_1_76FFD9064D48F931BE1AF395D174F4BF;         // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     supply_score_2_0E9D477F450A041B5E8DA183D5F0F9AA;          // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     hurt_score_3_C3E8292B4E2E9AEC2DE06BA9611865FD;            // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     kill_score_4_0D9EF7684BBCA39F39BD19A360A28370;            // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     occupy_score_5_23364240475FF7610499DDA207839E55;          // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

