#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:49 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SharePersonInfo.BP_STRUCT_SharePersonInfo
// 0x00A0
struct FBP_STRUCT_SharePersonInfo
{
	struct FString                                     role_critrate_0_C202C87F461553C8F5F6B380DBBCB7AF;         // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_killnum_1_0C5745754096913DF2AFF48E2CE2357F;          // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     headIconUrl_2_EB0E44D5491206AE3A6992BC1ABB4F35;           // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_kd_3_223B2FBE49E79A8126865A910B5F747E;               // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     nickName_4_6BE3CCB74CC5C8357A179F97E1791DD8;              // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                gender_11_88095C8947EE93C20778B7A4941A7B1C;               // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     role_allmatchnum_6_C20E084949E5C8DCE41E32893822C8A5;      // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     mordelStr_7_8B4C5C7A4E9FBD88FB3849BA7EA57CB2;             // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_winnum_8_1F858D824C197C5FAAE1679478201249;           // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_toptennum_9_58B8D7474BC5767F0A73A6BB937B2E8F;        // 0x0064(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     roleUid_10_69DBB8CD40F687B2D7EF888FC2C5AD08;              // 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_grade_12_1B2500464ABAFA3E6C997C994B4375CA;           // 0x007C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_sum_13_DF0F8F31465D34385472898906645670;             // 0x0088(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     season_str_14_7E982B0046643AC66B1A1801047197B2;           // 0x0094(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

