#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:48 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SeasonPassPreviewItemData.BP_STRUCT_SeasonPassPreviewItemData
// 0x0034
struct FBP_STRUCT_SeasonPassPreviewItemData
{
	struct FString                                     ItemDesc_0_23C47B8021AD6EEC1CC2422C0C3CF1B3;              // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ItemName_1_5DA47C001F56B5F21CC40E5E0C3D1B15;              // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ItemID_2_7F8DFF004326180E13A4B34A0D2C3C84;                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ItemQuality_3_1892B6005C2538D0239C5F5D0D66F349;           // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsShow_4_2D4ACF403E1A0E250E210BDA0D2E0437;                // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0021(0x0003) MISSED OFFSET
	struct FString                                     ItemIcon_5_11B99E002FF15ADA1CC72ADC0C3CA57E;              // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               Is3DModel_6_17A801007C572A727183FD2A0E6788BC;             // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsEmote_7_49B5C58048DEB0946F02BB2A0213F375;               // 0x0031(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsWeapon_8_4C40E1802E38C73C6340F6010E46DC7E;              // 0x0032(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsCarryWeapon_9_30EB81C079AFCC9B6E4E29E00CCBDB1E;         // 0x0033(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

