#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:50 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WarZoneRankInfo.BP_STRUCT_WarZoneRankInfo
// 0x0085
struct FBP_STRUCT_WarZoneRankInfo
{
	int                                                score_0_3554DBC0382BCE134EBF83520DCA2D85;                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                no_1_60BF8C006121CF8E0F08613508B0DE7F;                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_2_1C2F7AC078CF959D7C6FD2F20DE147BC;                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     content3_3_796820403A5487431E2D59510EEA78C3;              // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     name_4_1DD19D0039013788587B710000DE8085;                  // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     content2_5_796720003A5487421E2D59560EEA78C2;              // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     uid_6_3EADA5402D016BED6BC684760B0DC874;                   // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     content1_7_79661FC03A5487411E2D59570EEA78C1;              // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     url_8_65E1898056EF43666BC683390B0DCF0C;                   // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                qq_vip_9_68FDD8C01C9775351075232E0CBFDDD0;                // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                startup_type_10_7A1CE1C04F9F34313F2750FF00D49905;         // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_avatar_box_id_11_6404D3C050EEEF8B3568093500A740C4;    // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segment_12_22233180639705161C9C64070A373794;              // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gender_13_376A72004E998DC21B7E44200DE4FA12;               // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               showWarZone_14_0AD0D6800C794508442E64EA004E8985;          // 0x0068(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0069(0x0003) MISSED OFFSET
	int                                                corpsIcon_16_167D40C06FBA24496D3FE482027A23BE;            // 0x006C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     corpsName_20_62681EC03764FD2B6DF6BDD4027B9DD5;            // 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                corpsSeg_21_161706400FF9AA6F6F3763750E275407;             // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                corpsId_22_74CC69C01B862E9D13BCFDB90BE27A24;              // 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               showCorpsWarZone_23_6D6818406575E7AF10ABE0AB06DE4615;     // 0x0084(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

