#pragma once

//PUBGM(0.13.5)32位SDK
//作者:清华
//Telegram:@qinghuanb666
//生成时间:Fri Apr 18 20:44:45 2025

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_MysticalDivine_TaskInfo.BP_STRUCT_MysticalDivine_TaskInfo
// 0x0040
struct FBP_STRUCT_MysticalDivine_TaskInfo
{
	struct FString                                     icon_0_26131040653EEFE126B8F7110364F0AE;                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                progress_1_7226C340368828A71CA5700C0FADE9C3;              // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     desc_2_381DEDC02F2641832684D9C50364BA63;                  // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                status_3_3D906F00319E7B086581387B05BC78A3;                // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                id_4_51E1B94005467ABF5AECA05806F364E4;                    // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                totalProgress_5_3B7F84404405E05D665CC0CC055BDB83;         // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_6_71FDEE40580BBE4926A8A48D036552C5;                  // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                dropId_7_1125FE80797FF70459C3166404AF9794;                // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                count_8_7E4C104075A2CDA55C0557F806490564;                 // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                expireTime_10_46372D007F96BAC43506ED1103EE7795;           // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

